var data = [{"Category": "Leadership, Admissions", "End Date": "", "Name": "Workshop: Get Your Faculty on the Admissions Team Bus", "Graduate Credit": "", "URL": "https://www.aisne.org/events", "Location": "Southborough, MA", "Organization": "Association of Independent Schools New England (AISNE)", "Start Date": "Thursday, September 20, 2018", "Emily: 👍": "", "Description": "Do your faculty understand the importance of greeting prospective families in the hallway during a campus tour? Do they understand the importance of talking about the school with the general public? Faculty are some of your most important marketers both inside and outside of your school. The presenters share how their school works with faculty to underscore their role in the admission process. From reminders at faculty meetings to classroom visits from admission officers and prospective families, ensure your faculty are on the admission team bus.\n\nThis workshop is a best fit for: Directors of Admission, Directors of Enrollment Management, Heads of School, Assistant Heads of School, Members of Admission Teams\n\nFacilitated by: Bruce Mutch, Director of Admissions, and Brian Storosko, Deputy Head, Ashbury College (ON)"},
{"Category": "Diversity/Equity/Inclusion, Gender Studies, Counseling", "End Date": "", "Name": "Name it, Face it, End it: Educating to End Sexual Violence and Harassment", "Graduate Credit": "", "URL": "https://nameit-faceit-endit.weebly.com/", "Location": "Cambridge, MA", "Organization": "Harvard University", "Start Date": "Friday, September 21, 2018", "Emily: 👍": "", "Description": "This interactive symposium will prepare K-12 and Higher Education practitioners for their role in changing school cultures in this post-MeToo era. "},
{"Category": "STEM, Technology, Innovation", "End Date": "Sunday, September 23, 2018", "Name": "Maker Faire - New York", "Graduate Credit": "", "URL": "https://makerfaire.com/new-york/", "Location": "New York, NY", "Organization": "Maker Media", "Start Date": "Saturday, September 22, 2018", "Emily: 👍": "", "Description": "We call it the Greatest Show (& Tell) on Earth. Maker Faire is part science fair, part county fair, and part something entirely new! As a celebration of the Maker Movement, it’s a family-friendly showcase of invention, creativity, and resourcefulness. Faire gathers together tech enthusiasts, crafters, educators, tinkerers, food artisans, hobbyists, engineers, science clubs, artists, students, and commercial exhibitors. Makers come to show their creations and share their learnings. Attendees flock to Maker Faire to glimpse the future and find the inspiration to become Makers themselves."},
{"Category": "STEM, Innovation, Technology", "End Date": "Friday, September 28, 2018", "Name": "Dreamforce", "Graduate Credit": "", "URL": "https://www.salesforce.com/dreamforce/get-ready/", "Location": "San Francisco, CA", "Organization": "Salesforce", "Start Date": "Tuesday, September 25, 2018", "Emily: 👍": "", "Description": "Dreamforce is a showcase for discovering and getting inspired by what’s new, and it’s packed with opportunities that will help you and your business innovate, succeed, and stay ahead of the competition.\n\nWhether you’re a company of five or a Fortune 500, what you learn during your four days at Dreamforce will transform your business and lead to a boom in success. The knowledge you gain from 2,700+ breakout sessions, world-renowned leaders and Salesforce experts, hands-on training, hundreds of partners with thousands of innovative solutions, and connecting with your fellow Trailblazers will help you be your best, no matter your industry, role, or company size.\n\nEarn your Get Ready for Dreamforce badge now and start prepping for your perfect four days."},
{"Category": "Counseling", "End Date": "Saturday, September 29, 2018", "Name": "National Association for College Admission Counseling's National Conference", "Graduate Credit": "", "URL": "https://www.nacacconference.org/", "Location": "Salt Lake City, UT", "Organization": "National Association for College Admission Counseling", "Start Date": "Thursday, September 27, 2018", "Emily: 👍": "", "Description": "NACAC’s national conference is a dynamic education and networking event held annually to build relationships among college admission counseling professionals, higher education thought leaders, national policymakers, and others who support students and families in the transition from high school to college.\n\nIt is the only event of its kind to bring together professionals from both sides of the college admission desk.\n\nAt the profession’s preeminent education and networking event:\n\nHear from leading voices in the field\nFine-tune your skills\nDiscover new techniques\nExplore issues affecting the students you serve.\nMore than 6,000 admission professionals from across the world gather annually for this three-day event."},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Writer as Reader", "Graduate Credit": "", "URL": "http://writingandthinking.org/programs/september/", "Location": "Annandale-on-Hudson, NY", "Organization": "The Bard College Institute for Writing & Thinking ", "Start Date": "Friday, September 28, 2018", "Emily: 👍": "", "Description": "Among the key criteria for English/Language Arts is a focus on the close reading of texts—preparing students to read more carefully, grasp the meaning in more complex texts, and to infer meaning from what they read. IWT’s “Writer as Reader” workshops model writing practices that support close reading and Common Core standards in all subjects, and invite secondary and college teachers to consider “writing to read” as a central classroom practice, one that shows rather than tells students how writing clarifies meaning in literary, historical, and nonfiction texts. These techniques are the starting point for each workshop.\n\nIWT workshops also invite readers to find their own ways into a text. Working with diverse writing-to-read strategies, workshop participants discover what they bring to the text, what is noticeable in the text and what is inferred, and what questions the text poses.\n \nThis year we will include sessions on novels, poetry, nonfiction, historical documents, STEM texts, and other media. As educators have come to expect, these workshops focus on putting texts into conversations with other texts, with historical events, and digital media.  The “Writer as Reader” workshops also model writing and reading activities that can focus class discussion, help students engage with difficult material, and emphasize the social character of all learning."},
{"Category": "Humanities, History", "End Date": "Sunday, September 30, 2018", "Name": "Presidents and the Constitution: George Washington", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/libertyfund/", "Location": "Valley Forge, PA", "Organization": "Ashbrook Center at Ashland University and Liberty Fund", "Start Date": "Friday, September 28, 2018", "Emily: 👍": "X", "Description": "TeachingAmericanHistory.org and Liberty Fund are proud to continue their series of weekend colloquia for social studies teachers. These weekend programs allow teachers of American history and government to explore the themes of liberty and responsibility throughout America’s history and constitutional tradition.\n\nParticipating teachers will read a series of primary source documents, travel to a relevant historic site, and engage in conversation with a select group of colleagues over the course of a weekend. These conversations are open-ended – teachers are not expected to reach a set conclusion about the material, are not required to take an assessment, and are not asked to complete a lesson plan. Participating teachers are only expected to engage fully in conversation, taking an active role in each of the six discussion sessions throughout the weekend.\n\nA special feature of our Liberty Fund Weekend Colloquia is the historical tour or experience, which enables participants to see firsthand the places where our history was made. These tours typically involve at least a moderate amount of walking, and the nature of some historic sites precludes access by people with some disabilities or challenges in moving – for example, the mansion at Mt. Vernon involves going up and down tight, steep stairs, and most sites do not have elevators. Please take this into consideration when deciding whether or not to apply, as participation in all parts of the program is required. Contact us if you have any questions.\n\nTeachers selected to participate will have the cost of lodging, meals, and materials for the weekend’s colloquia covered through the generosity of Liberty Fund. In addition, participants will receive a stipend of $400 (contingent on full attendance at program activities) to defray the cost of travel to and from the program site.\n\nParticipation is based on a competitive application process. "},
{"Category": "Pedagogy", "End Date": "", "Name": "AISNE's Beginning Teacher Institute", "Graduate Credit": "", "URL": "https://www.aisne.org/events", "Location": "Southborough, MA", "Organization": "Association of Independent Schools New England (AISNE)", "Start Date": "Tuesday, October 2, 2018", "Emily: 👍": "", "Description": "A full day, immersive program for new teachers starting at independent schools.\n\nBegin your new role with energy and confidence. Spend a day together with your peer group of fellow beginning teachers from independent schools across New England, as well as master teachers there to support your success."},
{"Category": "STEM, Technology", "End Date": "Thursday, October 4, 2018", "Name": "EdSurge FUSION Conference", "Graduate Credit": "", "URL": "https://fusion.edsurge.com/", "Location": "San Francisco, CA", "Organization": "EdSurge", "Start Date": "Tuesday, October 2, 2018", "Emily: 👍": "", "Description": "Bringing together education leaders around learning, equity \nand technology\n\nCome meet America's foremost education leaders, thinkers, researchers and technologists who are putting personalized learning into practice. Build deeper professional relationships with peers from around the country, crystallize your vision and practice for transforming schools and leave with a clear action agenda."},
{"Category": "Pedagogy", "End Date": "Thursday, October 4, 2018", "Name": "Learning Environments for Tomorrow: Next Practices for Educators and Architects", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/learning-environments-tomorrow-next-practices-educators-and-architects", "Location": "Cambridge, MA", "Organization": "Harvard Graduate School of Education", "Start Date": "Tuesday, October 2, 2018", "Emily: 👍": "", "Description": "Collaborate with architects and educators from around the world to apply principles of effective pedagogy and design to physical learning environment projects.\n\nOverview\nPhysical spaces have an enormous impact on learners’ experiences. Building layouts can create opportunities for new relationships among students, staff, and the community. Furniture arrangements in classrooms and hallways can foster planned collaboration and spontaneous informal learning among students. Day-lighting, learning commons, and natural materials can create a sense of place and connection.\n\nWhether we’re engaged in small-scale classroom remodeling or large-scale school planning, effective designs are based on clear sense of learners’ needs and educational goals. How can we understand the needs of the learners and the community for whom we are designing? What are the educational goals that should inform effective designs? And how can we plan and prototype solutions so they can evolve as needs and goals change over time?\n\nParticipants learn from educational and design leaders about emerging trends shaping today and tomorrow’s educational environments such as ubiquitous technologies, personalized learning, sustainable construction, and collaboration. Working in team-based design studios, participants apply the program content by engaging in a design process that spans five areas: the needs of people, design principles, program goals, plans, and prototypes. The program offers content and a process that participants can apply and bring back to their settings.  \n\nProgram Details\nIn this three-day collaborative program, you and your team will explore themes that inform 21st-century school design, such as collaboration, technology, engagement, and sustainability. You will take part in interactive plenary sessions given by leaders in the field of education and architecture, topic-specific workshops led by innovative practitioners and thinkers, guided site visits to provocative learning environments in the Boston-area, and a “design studio,” facilitated by experts in collaborative design processes. \n\nEach component is crafted to create opportunities for your team to consider the needs and values of your learners, the forward-looking educational goals for your community, and the qualities of the spaces that can support such needs and goals. Participants will have the opportunity to focus on a specific school design project they are currently involved in, or to work more abstractly within their design teams. Design studios will offer daily opportunities to get feedback on your plans and future prototyping can support the educational experiences for your community.  "},
{"Category": "Leadership", "End Date": "", "Name": "MISBO Fall Conference", "Graduate Credit": "", "URL": "https://www.misbo.com/events/fall18", "Location": "Hilton Head, SC", "Organization": "Mid-South Independent School Business Officers (MISBO)", "Start Date": "Wednesday, October 3, 2018", "Emily: 👍": "", "Description": "For the past several years independent schools have been asking some big questions. What will the students of tomorrow need, and how do we anticipate those needs? Do we have the right mix of programs, facilities, faculty, and technology to support those needs?\n\nThe 2018 MISBO Fall Conference will connect you with industry professionals, along with some of our schools’ brightest leaders, providing you with answers to these questions. Keynote speaker Ian Symmonds will kick off the conference with three critical questions facing independent schools today, and better yet, he will guide you to find the answers for your school; you will be inspired by the engaging “Leadership Lessons from the Fields of Gettysburg”, which draws parallels between battle strategies and critical leadership traits (who knew?); the final day will have you reimagining student assessment and what that could mean for our country’s future leaders with The Mastery Transcript Consortium. Additional breakout sessions will broaden these themes, designed to offer solutions to many of the issues you face every day: hiring for key positions, compensation design, security, as well as long range and capital budget planning. \n\nThis conference will also feature MISBO’s signature “Sourcing Solutions” session, providing attendees an opportunity to leave with valuable takeaways from MISBO vendors in short 15-minute mini-sessions, along with dedicated exhibit time to talk with vendors and sponsors. And as always, there will be endless opportunities to network and collaborate with your peers!\n\nJoin us as we not only ask the important questions, but also provide the answers for you to take back to your school."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Using Tier I Materials to Teach About Contested Issues: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/new-orleans-2018/", "Location": "New Orleans, LA", "Organization": "Brown University", "Start Date": "Thursday, October 4, 2018", "Emily: 👍": "", "Description": "Our workshops are completely interactive, so be ready to be engaged and inspired!\nParticipants will be introduced to the Choices Program’s award-winning resources and approach to teaching about contested issues and exploring multiple perspectives.\n\nYou will be immersed in the Immigration and the U.S. Policy Debate unit and will examine parts of the Freedom Now: The Civil Rights Movement in Mississippi unit. Both units are provided. Participants will discuss ways to adapt these units to specific classroom goals.\n\nParticipants will also have the opportunity to network with colleagues in social studies education from across the state.\n\nHosted by Cohen College Prep."},
{"Category": "STEM, Math", "End Date": "Saturday, October 6, 2018", "Name": "National Council of Teachers of Mathematics Regional Conferences", "Graduate Credit": "", "URL": "http://www.nctm.org/Conferences-and-Professional-Development/Regional-Conferences-and-Expositions/", "Location": "Hartford, CT", "Organization": "National Council of Teachers of Mathematics", "Start Date": "Thursday, October 4, 2018", "Emily: 👍": "", "Description": "Join us to connect face-to-face with your peers in education and to focus on the learning and resources that promote the mathematical habits of mind that will lead your students to college and career success.\n\nWhether you're a classroom teacher, math coach, administrator, math teacher educator, teacher-in-training, or math specialist, there's something for you at the NCTM Regional Conferences & Expositions."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Teaching about Genocide and Human Rights: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/teaching-genocide-human-rights-choices-approach-2/", "Location": "Hartford, CT", "Organization": "Brown University", "Start Date": "Friday, October 5, 2018", "Emily: 👍": "", "Description": "Our workshops are completely interactive, so be ready to be engaged and inspired!\n\nParticipants will be immersed in the Confronting Genocide: Never Again unit and will examine parts of the Competing Visions of Human Rights: Questions for U.S. Policy unit.  Both units are provided. Participants will discuss ways to adapt these units to address CT Senate Bill 452, which requires Connecticut school districts to include information on genocide and the Holocaust in the curriculum.\n\nDuring the workshop, you will:\n\nBe introduced to the Choices Program’s award-winning resources and approach to teaching about contested international issues;\nExamine and work with the Choices units Confronting Genocide: Never Again and Competing Visions of Human Rights: Questions for U.S. Policy (provided);\nNetwork with exemplary colleagues in social studies education from across the area."},
{"Category": "Leadership", "End Date": "Sunday, October 7, 2018", "Name": "NAIS Leadership Through Partnership (LTP)", "Graduate Credit": "", "URL": "https://www.nais.org/participate/institutes-workshops/leadership-through-partnership/", "Location": "Washington, DC", "Organization": "NAIS & the Center for Creative Leadership", "Start Date": "Friday, October 5, 2018", "Emily: 👍": "", "Description": "NAIS, in partnership with the Center for Creative Leadership, has enhanced and refined the Leadership Through Partnership workshop to enable effective, successful board and head relationships. "},
{"Category": "Diversity/Equity/Inclusion, Leadership", "End Date": "Saturday, October 13, 2018", "Name": "ALAS 15th Annual Education Summit: \"Equity: United We Stand!\"\n", "Graduate Credit": "", "URL": "http://www.alasedu.org/events/2018-education-summit", "Location": "San Diego, CA", "Organization": "Association of Latino Administrators and Superintendents", "Start Date": "Wednesday, October 10, 2018", "Emily: 👍": "", "Description": "Join us for the 2018 Education Summit, designed for educators from across the country to work together to address challenges in the education system, particularly those impacting Latinos. We provide a unique forum to engage in meaningful discussions and identify solutions that can be applied throughout the industry. Check back for more details coming soon."},
{"Category": "STEM, Science", "End Date": "Saturday, October 13, 2018", "Name": "National Science Teachers Association (NSTA) Area Conference: \"Elevating Science: Digging Deeper\"", "Graduate Credit": "", "URL": "http://www.nsta.org/conferences/area1.aspx", "Location": "Reno, NV", "Organization": "National Science Teachers Association (NSTA)", "Start Date": "Thursday, October 11, 2018", "Emily: 👍": "", "Description": "NSTA conferences offer the latest in science content, teaching strategy, and research to enhance and expand your professional growth. Take advantage of this unique opportunity to collaborate with science education leaders and your peers. Each year, NSTA hosts a national conference on science education (in the spring), three area conferences (in the fall), and a STEM Forum & Expo."},
{"Category": "Humanities, History", "End Date": "Sunday, October 14, 2018", "Name": "Presidents and the Constitution: Abraham Lincoln", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/libertyfund/", "Location": "Springfield, IL", "Organization": "Ashbrook Center at Ashland University and Liberty Fund", "Start Date": "Friday, October 12, 2018", "Emily: 👍": "X", "Description": "TeachingAmericanHistory.org and Liberty Fund are proud to continue their series of weekend colloquia for social studies teachers. These weekend programs allow teachers of American history and government to explore the themes of liberty and responsibility throughout America’s history and constitutional tradition.\n\nParticipating teachers will read a series of primary source documents, travel to a relevant historic site, and engage in conversation with a select group of colleagues over the course of a weekend. These conversations are open-ended – teachers are not expected to reach a set conclusion about the material, are not required to take an assessment, and are not asked to complete a lesson plan. Participating teachers are only expected to engage fully in conversation, taking an active role in each of the six discussion sessions throughout the weekend.\n\nA special feature of our Liberty Fund Weekend Colloquia is the historical tour or experience, which enables participants to see firsthand the places where our history was made. These tours typically involve at least a moderate amount of walking, and the nature of some historic sites precludes access by people with some disabilities or challenges in moving – for example, the mansion at Mt. Vernon involves going up and down tight, steep stairs, and most sites do not have elevators. Please take this into consideration when deciding whether or not to apply, as participation in all parts of the program is required. Contact us if you have any questions.\n\nTeachers selected to participate will have the cost of lodging, meals, and materials for the weekend’s colloquia covered through the generosity of Liberty Fund. In addition, participants will receive a stipend of $400 (contingent on full attendance at program activities) to defray the cost of travel to and from the program site.\n\nParticipation is based on a competitive application process. "},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Hamilton vs. Jefferson – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-hamilton-vs-jefferson-great-american-debates/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, October 13, 2018", "Emily: 👍": "", "Description": "Would America be a commercial republic, engaged in trade with the rest of the world and turning steadily toward industry and, eventually, urbanization? Or would the American experiment in self-government be best promoted and maintained by a nation of yeoman farmers, spread across a continent in small towns? Alexander Hamilton and Thomas Jefferson were intellectual giants of the American Revolution, and although their ideas about the shape America should take differed significantly, the passion and egotism with which both men advocated for their ideas was comparable and, unfortunately, only served to increase the rancor between them and their supporters.\n\nScholars\nChristopher Burkett, Ashland University"},
{"Category": "Leadership, Diversity/Equity/Inclusion, Gender Studies", "End Date": "Monday, October 15, 2018", "Name": "Women in Education Leadership", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/women-education-leadership", "Location": "Cambridge, MA", "Organization": "Harvard University: Graduate School of Education, PreK-12 Professional Education Programs", "Start Date": "Saturday, October 13, 2018", "Emily: 👍": "", "Description": "Educational leadership requires skill, passion, and perseverance, and these already-complex roles often present an additional set of challenges for women leaders.\n\nOverview\nWomen in Education Leadership convenes senior leaders interested in strengthening their leadership skills to advance education initiatives. The program focuses on how female senior leaders can effectively navigate multiple responsibilities and constituencies, and it provides a unique opportunity for growth and renewal among diverse yet like-minded women.\n\nProgram Details\nThis three-day interactive program is designed to facilitate self-reflection and peer networking. Through workshops, lectures, and case discussions, you will learn to think more strategically and employ advanced leadership skills, with a special focus on effective negotiation and communication techniques. You will come away having made lasting connections with other women leaders who are equally committed to leading for change in education.\nObjectives\nIdentify the unique leadership challenges and opportunities facing women in education today\nUnderstand when and how gender plays a role in organizational and personal advancement\nLearn how successful women negotiate for what they need to be effective leaders\nGain new strategies for building and leading senior leadership teams\nCreate a lasting network of women leaders across the sector who are affecting change in education"},
{"Category": "Humanities, Writing, Literature, Arts", "End Date": "", "Name": "Baypath University's 17th Writers' Day", "Graduate Credit": "", "URL": "http://www.baypath.edu/events-calendar/community-events/writers-day/", "Location": "East Longmeadow, MA", "Organization": "Baypath University", "Start Date": "Sunday, October 14, 2018", "Emily: 👍": "", "Description": "Join other aspiring and published writers for our 17th Writers' Day featuring Suzanne Strempek Shea, Jonathan Green, Lisa Romeo, Karol Jackowski, and Sophfronia Scott.\n\n"},
{"Category": "STEM, Technology", "End Date": "Tuesday, October 16, 2018", "Name": "ITEC Fall Conference", "Graduate Credit": "", "URL": "http://www.itec-ia.org/?page_id=39", "Location": "Des Moines, IA", "Organization": "Iowa Technology & Education Connection", "Start Date": "Sunday, October 14, 2018", "Emily: 👍": "", "Description": "Described by one participant as a \"mini-ISTE,\" this technology conference helps educators envision the ways they can incorporate technology in the classroom. "},
{"Category": "Pedagogy", "End Date": "Sunday, November 4, 2018", "Name": "Teaching Students to Ask Their Own Questions: Best Practices in the Question Formulation Technique", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/teaching-students-ask-their-own-questions-best-practices-question-formulation-technique", "Location": "Online", "Organization": "Harvard Graduate School of Education", "Start Date": "Monday, October 15, 2018", "Emily: 👍": "", "Description": "Students who learn to ask their own questions become more curious, take ownership of their learning, and demonstrate greater comprehension of challenging content. The ability to ask one’s own questions is, indeed, one of the most important lifelong learning skills a student can acquire in the course of their education and, yet, it is rarely deliberately taught to all students. \n\nOverview\nIntroduced by former Dean James Ryan, Teaching Students to Ask Their Own Questions will be led by staff of the Right Question Institute (RQI), including Dan Rothstein and Luz Santana, RQI co-directors and co-authors of Make Just One Change: Teach Students to Ask Their Own Questions, which has quickly become a classic pedagogical text for strengthening inquiry in all classrooms, from kindergarten through higher education. The workshop will offer a differentiated active learning experience in the Question Formulation Technique (QFT), a simple yet robust method for teaching students to ask better questions that was developed by Rothstein and Santana through years of trial and error and practice-based research.\n\nProgram Details\nThe publication of Make Just One Change was a catalyst for hundreds of thousands of educators around the world to adopt the QFT and generate new knowledge about how to use it for different purposes. The experience and knowledge of educators in a remarkably wide range of classrooms inform the content and structure of this workshop on “best practices” in using the QFT. The workshop offers a very special opportunity for all educators, those new to the QFT and those already experienced in using it, to learn more about innovative ways to teach the skill of question formulation by applying the QFT for different teaching and learning goals in all kinds of classrooms.\n\nThe workshop will provide an in-depth exploration of key components for successful application of the QFT, including:\n\nWhat is the core structure and flow of the QFT?\nWhy does the structure work across all classrooms and for all students?\nWhat are best practices in adapting the QFT for your teaching and learning goals?\nHow does the facilitation of the QFT change some traditional expectations of teacher and student roles in learning?\nWhat are “best practices” in design and facilitation of your use of the QFT?\nThe workshop will deploy a variety of teaching and learning methods to engage participants in individual as well as collaborative problem-solving, reflection, and engagement with QFT tools and resources. Instructional videos, readings, and online discussions will complement peer-to-peer learning with educators across diverse learning environments.\n\nThe online workshop will require a total of 10-12 hours of work. Participants will receive a certificate indicating completion of 10 clock hours of instruction.\n\nObjectives\nUnderstand how and why the skill of question-asking is critical to student achievement and agency in and out of the classroom\nLearn the art and science behind the Question Formulation Technique (QFT)\nStudy and discuss examples of how the QFT is being used to promote increased student engagement and deeper learning among all students\nIdentify ways the teaching of questioning skills can make classrooms more equitable for all learners\nDesign a lesson or unit with the QFT in your area of expertise\nWho Should Participate\nPreK-12 teachers across all content and subject areas\nAdministrators, curriculum specialists, and instructional coaches"},
{"Category": "Math, STEM, Pedagogy", "End Date": "Sunday, October 28, 2018", "Name": "Improving Math Instruction Through Feedback", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/improving-math-instruction-through-feedback", "Location": "Online", "Organization": "Harvard Graduate School of Education", "Start Date": "Monday, October 15, 2018", "Emily: 👍": "", "Description": "Learn practical approaches to improving math instruction using the Mathematical Quality of Instruction (MQI) coaching protocols.\n\nOverview\nHow can the teacher observation process have a greater impact on the day-to-day instruction of math teachers? How can coaching be more specific, effective, and practical in the math classroom?\n\nImproving Math Instruction Through Feedback is an online professional development program for K-12 educators looking to improve instructional coaching for math teachers. Based upon the research of HGSE Professor Heather Hill, the workshop provides strategies for promoting high-quality math instruction and explores the role of school leaders, instructional coaches, and peer teachers in that process. The workshop begins with an introduction to Mathematical Quality of Instruction (MQI), an observation instrument and set of protocols that support teachers, coaches, and principals in analyzing instruction and planning for improvement. You will then practice observing classrooms and engaging in coaching conversations using MQI and other protocols.  In the final portion of the workshop, you will explore strategies for using rubric-based coaching with instructional video capture in your own setting.\n\n"},
{"Category": "Pedagogy, Leadership", "End Date": "", "Name": "Workshop: Successful Negotiations: Navigating Challenging Conversations", "Graduate Credit": "", "URL": "https://www.aisne.org/events", "Location": "Natick, MA", "Organization": "Association of Independent Schools New England (AISNE)", "Start Date": "Tuesday, October 16, 2018", "Emily: 👍": "", "Description": "Registration & Breakfast: 8:15 - 9:00 a.m.\n\nWorkshop begins: 9:00 a.m.\n\nPresented by: Michelle Greenberg-Kobrin\nWorking in education requires many different types of conversations with many different groups of people. Whether it's with parents, administrators, colleagues or others, applying the principles of negotiation will help strengthen your ability to move groups and individuals towards positive outcomes that feel good to all."},
{"Category": "Leadership, Counseling", "End Date": "", "Name": "Creating a Culture of Safety: Building Skills to Prevent & Respond to Sexual Misconduct in Schools & Youth Organizations", "Graduate Credit": "", "URL": "http://www.masskids.org/index.php/enough-abuse-campaign/national-conference-2018", "Location": "Framingham, MA", "Organization": "Mass Kids", "Start Date": "Tuesday, October 16, 2018", "Emily: 👍": "", "Description": "This event will feature a day of skill-building sessions to increase the confidence of school and youth organization leaders to prevent and respond to a range of boundary-violating behaviors on the continuum of employee misconduct."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Teaching about Genocide and Human Rights: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/teaching-genocide-human-rights-choices-approach/", "Location": "Harrisburg, PA", "Organization": "Brown University", "Start Date": "Thursday, October 18, 2018", "Emily: 👍": "", "Description": "Our workshops are completely interactive, so be ready to be engaged and inspired!\nParticipants will be introduced to the Choices Program’s award-winning resources and approach to teaching about contested issues and exploring multiple perspectives.\n\nTeachers will be immersed in Confronting Genocide: Never Again and will examine parts of Competing Visions of Human Rights: Questions for U.S. Policy.  Both curriculum units are provided. Participants will discuss ways to adapt these units to specific classroom goals.\n\nYou will also have the opportunity to network with exemplary colleagues in social studies education from across the state.\n\nCo-sponsored by The Pennsylvania Council for the Social Studies"},
{"Category": "Leadership, Pedagogy, School Design", "End Date": "", "Name": "The Habit-forming Workshop to Becoming a Systems Thinker", "Graduate Credit": "", "URL": "http://watersfoundation.org/professional-development-events/upcoming-events/", "Location": "Phoenix, AZ", "Organization": "Waters Foundation", "Start Date": "Thursday, October 18, 2018", "Emily: 👍": "", "Description": "This workshop will use the book, The Habit-forming Guide to Becoming a Systems Thinker, to introduce the foundation of systems thinking.\n\nA systems thinking point of view encourages individuals to step back and see the whole picture, rather than focusing on just its parts. When individuals have a clear and deep understanding of their jobs, departments, divisions or organizations as whole systems, they are better equipped to identify leverage actions that lead to improvements and desired outcomes.\n\nThrough highly interactive and innovative approaches, participants will learn and practice strategies that will inform the quality of day-to-day interactions and propel desirable outcomes.\n\nWhether you are a student, professional, business leader, community volunteer, civic leader, or simply a lifelong learner, you will walk away with new ideas, insights and skills to impact your system.\n\nThe day will be filled with interactive, hands-on activities for participants to understand and practice systems thinking concepts, including:\n\nLearning and applying the 14 Habits of a Systems Thinker in a variety of contexts.\nUnderstanding the causal interdependencies that influence the behavior of complex systems.\nIdentifying mental models that may influence behavior and actions.\nDiscovering concrete strategies to impact systems.\nPracticing problem solving, decision making, and communication within groups that are made up of diverse perspectives working toward a common goal.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t"},
{"Category": "Technology, STEM", "End Date": "", "Name": "MassCUE Fall Conference", "Graduate Credit": "", "URL": "http://www.masscue.org/event/conference-fall-2018/", "Location": "Foxborough, MA", "Organization": "MassCUE & M.A.S.S.", "Start Date": "Thursday, October 18, 2018", "Emily: 👍": "", "Description": "We are pleased to announce the MassCUE and M.A.S.S. 2018 Annual Technology Conference,co-sponsored by the Massachusetts Computer Using Educators (MassCUE) and the Massachusetts Association of School Superintendents (M.A.S.S.).\n\nBoth organizations recognize the benefits of a collaborative partnership that focuses on the collective interests of our school districts.  We will be providing educators from across the Commonwealth and New England with exciting ways to enhance teaching and learning with technology.\n\n"},
{"Category": "Counseling, Health", "End Date": "10/21", "Name": "Mindfulness Retreat for Parents and Youth-Serving Professionals", "Graduate Credit": "", "URL": "https://ibme.info/register/adults/adult-mindfulness-retreat-garrison/", "Location": "Garrison, NY", "Organization": "Garrison Institute & iBme", "Start Date": "Friday, October 19, 2018", "Emily: 👍": "", "Description": "Please join us for the first iBme adult mindfulness retreat at Garrison Institute for parents/guardians, teachers, and youth-serving professionals.\n\nOn this retreat we will explore mindfulness, through formal meditation periods and relational mindfulness activities. Together, we will develop our skills of focused concentration, introspection, compassion, and insight. The emerging science of mindfulness suggests that mindfulness can help build emotional resilience, inner strength and well-being. Retreat practice helps us develop the flexibility to be present, kind, and skillful whether we are alone or interacting with others.\n\nEach day will primarily be held in silence and will include sitting and walking meditation, small group activities, movement and free time. Please come prepared to participate in all aspects of the retreat with curiosity and a willingness to engage with challenge."},
{"Category": "Religion, Leadership", "End Date": "Wednesday, October 24, 2018", "Name": "2018 NCEA Catholic Leadership Summit", "Graduate Credit": "", "URL": "https://www.cvent.com/events/2018-ncea-catholic-leadership-summit/registration-fe23e6abec074a0aadc2ba2256784329.aspx?fqp=true", "Location": "Jacksonville, FL", "Organization": "National Catholic Educational Association (NCEA) ", "Start Date": "Saturday, October 20, 2018", "Emily: 👍": "", "Description": ""},
{"Category": "Online Learning, STEM, Technology", "End Date": "Wednesday, October 24, 2018", "Name": "iNACOL Symposium", "Graduate Credit": "", "URL": "http://www.inacol.org/symposium/", "Location": "Nashville, TN  ", "Organization": "International Association for K-12 Online Learning (iNACOL)", "Start Date": "Sunday, October 21, 2018", "Emily: 👍": "", "Description": "iNACOL’s annual conference is the industry’s leading event for K-12 competency-based, blended and online learning. Experts, practitioners, educators, policymakers, and researchers gather and work to transform education.\n\nAttendees will find unprecedented networking opportunities and gain access to expertise, analysis, and trends in competency-based, blended and online education. Through thought-provoking sessions and information sharing, these leaders shape the future of education. The symposium includes more than 200 sessions, each with a specific track to guide attendees toward sessions that fit their unique professional learning needs."},
{"Category": "Technology, STEM", "End Date": "Monday, November 19, 2018", "Name": "Computational Thinking: Creating Problem Solvers – Online", "Graduate Credit": "", "URL": "http://www.masscue.org/event/computationalthinking/?event_date=2018-10-22", "Location": "Online", "Organization": "MassCUE", "Start Date": "Monday, October 22, 2018", "Emily: 👍": "", "Description": "Mold the students of today into the problem solvers and critical thinkers of tomorrow. This course provides a snapshot of the Massachusetts Digital Literacy and Computer Science Frameworks Computational Thinking strand and its related standards. It will supply you with a variety of creative ways to weave these standards into your teaching. We will use elements of technology and social media throughout the workshop to integrate key computational thinking concepts into students’ daily lives."},
{"Category": "Technology, STEM", "End Date": "Monday, November 19, 2018", "Name": "Using Web 2.0 Tools to Motivate and Manage Students in collaboration with EDCO", "Graduate Credit": "", "URL": "http://www.masscue.org/event/web20/?event_date=2018-10-22", "Location": "Online", "Organization": "MassCUE", "Start Date": "Monday, October 22, 2018", "Emily: 👍": "", "Description": "Learn how to use a variety of simple, yet powerful, Web 2.0 tools that will help you manage student behavior as well as motivate students, focus their attention on learning, and do it in fun and engaging ways!  Many resources discussed in this course integrate with Google Apps for Education and/or Chrome.  "},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars -Brutus I – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-brutus-i-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, October 24, 2018", "Emily: 👍": "", "Description": "Focus Document\nBrutus I, 1787\n\nComplementary Documents\nObjections to the Constitution, George Mason, 1787\nCentinel I, 1787\n\nScholars\nDr. John Moser, Ashland University\nDr. William Allen, Dean and Professor Emeritus, Michigan State University\nDr. Todd Estes, Oakland University"},
{"Category": "Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Diversity, Equity & Inclusion", "Graduate Credit": "", "URL": "https://www.aisne.org/events/signature-conferences/diversity-equity-inclusion", "Location": "Norwood, MA", "Organization": "Association of Independent Schools New England (AISNE)", "Start Date": "Wednesday, October 24, 2018", "Emily: 👍": "", "Description": "with Robin DiAngelo and Darnell Moore\n\nRobin has been a consultant and trainer for over 20 years on issues of racial and social justice. Learn More\n\nDarnell's advocacy centers on marginal identity, youth development and other social justice issues in the U.S. and abroad. Learn More\n\nBreakout Sessions include:\nWhite Fragility\nTransgender Student and Family Experiences\nImplicit Bias in Hiring Practices\nTeaching Black Panther\nSupporting the Needs of Today's International Students\nand much more"},
{"Category": "Leadership, Pedagogy, School Design", "End Date": "Wednesday, November 21, 2018", "Name": "The Principal's Center at Harvard University: Certificate in School Management and Leadership (CSML)", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/certificate-school-management-and-leadership-leading-change", "Location": "Cambridge, MA", "Organization": "Harvard University Graduate School of Education", "Start Date": "Wednesday, October 24, 2018", "Emily: 👍": "", "Description": "The Certificate in School Management and Leadership (CSML) is designed to provide preK-12 school leaders at all stages of their careers with frameworks, skills, and knowledge to drive change and to lead high-performing schools.\n\nAn innovative collaboration between the Harvard Graduate School of Education (HGSE) and Harvard Business School (HBS), the program integrates distinctive capabilities from both schools, combining expertise in managing teams and organizations with a commitment to school and instructional leadership.\n\nCSML Overview\nCSML will comprise four distinct yet interrelated courses, which may be taken individually or completed together to earn a comprehensive certificate. Together, these courses address topics most vital to leading successful schools. These four courses are:\n\nLeading Change\nLeading Schools\nLeading People\nLeading Learning\n---\n\nFounded in 1981, The Principals' Center at the Harvard Graduate School of Education provides aspiring and experienced school leaders from across the country and around the world with exemplary professional development to meet personal and professional challenges. The Principals' Center has dedicated itself to the support, development and improvement of school principals and other school leaders who influence the character and quality of a school.\n\nBased on the premise that school leaders significantly influence best practice, The Principals' Center offers a variety of professional development programs designed to strengthen your leadership skills for greater impact.\n\nNo matter where you are from, you will connect with peers who face similar challenges and build a lasting professional network that will help support you throughout your career. Our institutes provide you with the time you need to reflect, refocus and recharge.\n\nYou will leave inspired, with new ideas and frameworks that you can put into practice the day you get back to your school. Enroll today and join our community of learners."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Teaching about Contested International Issues: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/teaching-contested-international-issues-choices-approach/", "Location": "Dearborn, MI", "Organization": "Brown University", "Start Date": "Friday, October 26, 2018", "Emily: 👍": "", "Description": "Our workshops are completely interactive, so be ready to be engaged and inspired!\n\nParticipants will be introduced to Choices Program’s award-winning resources and approach to teaching about contested international issues.\n\nTeachers will be immersed in Middle East: Questions for U.S. Policy and China on the World Stage: Weighing the U.S. Response (provided). We will discuss ways to adapt these units to specific classroom goals, learn about Choices digital editions, and look at other opportunities for you and your students to engage in additional content on the Middle East and China.\n\nParticipants will also have the opportunity to network with colleagues in social studies education from across the state.\n\nHosted by the College of Education, Health, and Human Services, and the Hub for Teaching and Learning, at the University of Michigan-Dearborn."},
{"Category": "Leadership, Innovation, School Design", "End Date": "Tuesday, October 30, 2018", "Name": "DESIGN STUDIO: Human Centered Design for Admissions Professionals", "Graduate Credit": "", "URL": "http://www.leadershipanddesign.org/design-studio-designing-for-admissions-and-enrollment-management.html", "Location": "Baltimore, MD", "Organization": "Leadership + Design", "Start Date": "Monday, October 29, 2018", "Emily: 👍": "", "Description": "Welcome to the Admissions Design Studio, a collaboration between Leadership +Design and AISAP  where we will explore the essential question: How might we design more human centered experiences for our admissions processes?\nAdmissions and enrollment management are inherently deeply human processes.  While managing data - applicant and yield numbers, test scores, and demographic statistics - is part of the job, the real work is about human connection.  As we seek to build relationships with prospective and current families and students, especially new generations of millennials and Gen Z, developing a deep understanding of their world views and evolving needs will ensure our admissions processes resonate with mission aligned audiences.\nHuman Centered Design (also known as Design Thinking) is a set of habits, mindsets and skill sets that you can learn and practice that will allow you and your team to be better listeners, experience designers, empathetic problem solvers, and leaders. Over the course of two-days we will learn and practice design elements.  As schools seek greater diversity, equity and inclusion, design thinking can expand the ways we connect with a broader constituency."},
{"Category": "Diversity/Equity/Inclusion, Pedagogy, Leadership", "End Date": "", "Name": "Leading Learning Conference - Annual Conference 2018", "Graduate Credit": "", "URL": "https://www.vais.org/RelId/627185/ProgramID/296/ISvars/default/Program_Search.htm", "Location": "Richmond, VA", "Organization": "Virginia Association of Independent Schools (VAIS)", "Start Date": "Monday, October 29, 2018", "Emily: 👍": "", "Description": "Better Together\nThe theme for the 2018 VAIS Leading Learning Conference (LLC) is Better Together. In an age of lightning fast social media, file-sharing, email, and texts, we have innumerable opportunities to connect every day, and yet, in education, we sometimes feel isolated in our classrooms and offices, and in our schools. Instead of isolation, we wish for connection, cohesion and community, because we know that we are better together than we are apart. Community is essential to education--we learn from one other, we cheer each other on toward success, and we thrive by including others.  This year the VAIS Professional Development Advisory Commission (PDAC) sought proposals that inspire students, teachers, administrators, and schools to connect anew. Sessions should challenge PK-12 teachers and academic administrators to share a variety of models and strategies, skills, resources and tools, opportunities, and ideas that support connectivity and community at all levels. Some potential themes for presentations include, but are not limited to:\nInclusion, in the classroom, school or curricula;\nInnovative technologies connecting students locally and internationally;\nCommunity-building in the classroom, the school and beyond;\nMentoring programs for new teachers and/or younger students;\nIdea-sharing among educators and administrators;\nLeveraging community resources, tangible and intangible\nJoin us and be a part of this amazingly energizing day!  Immerse yourself in learning something new, network with your colleagues, make some new friends, challenge yourself, and have FUN!  Because, it is far better to be together in learning.\n"},
{"Category": "Leadership", "End Date": "", "Name": "AISNE signature conference: Governance", "Graduate Credit": "", "URL": "https://www.aisne.org/events/signature-conferences/governance", "Location": "Norwood, MA", "Organization": "Association of Independent Schools New England (AISNE)", "Start Date": "Thursday, November 1, 2018", "Emily: 👍": "", "Description": "Courageous Leadership: Building Boards for the Future\n\nGovernance is an acquired skill - no one is born a perfect trustee. It takes practice and adjustment to know how to best serve your school community. And today's independent schools are facing a multitude of new opportunities and challenges, such as:\n\nHigh stakes strategic planning endeavors\nLeadership shifts and their resulting community-wide transitions\nIncreased demands for successful fundraising efforts & philanthropic advocacy\nSharpened focus on risk management\nEnlightened appreciation for what it means to be truly inclusive and supportive\nThis conference is a place for board members and senior school leadership to consider what the practice of great governance looks like, in service to our schools, our students and our society. It's a time to come together to share and learn, recognizing the support and power within your community of AISNE peer member schools."},
{"Category": "STEM, Math", "End Date": "Saturday, November 3, 2018", "Name": "National Council of Teachers of Mathematics Regional Conferences", "Graduate Credit": "", "URL": "http://www.nctm.org/Conferences-and-Professional-Development/Regional-Conferences-and-Expositions/", "Location": "Kansas City, MO", "Organization": "National Council of Teachers of Mathematics", "Start Date": "Thursday, November 1, 2018", "Emily: 👍": "", "Description": "Join us to connect face-to-face with your peers in education and to focus on the learning and resources that promote the mathematical habits of mind that will lead your students to college and career success.\n\nWhether you're a classroom teacher, math coach, administrator, math teacher educator, teacher-in-training, or math specialist, there's something for you at the NCTM Regional Conferences & Expositions."},
{"Category": "Literature, Humanities", "End Date": "", "Name": "Writer as Reader: Discovering New Ways into the Text", "Graduate Credit": "", "URL": "http://writingandthinking.org/programs/november/", "Location": "Annandale-on-Hudson, NY", "Organization": "The Bard College Institute for Writing & Thinking ", "Start Date": "Friday, November 2, 2018", "Emily: 👍": "", "Description": "Among the key criteria for English/Language Arts is a focus on the close reading of texts—preparing students to read more carefully, grasp the meaning in more complex texts, and to infer meaning from what they read. IWT’s “Writer as Reader” workshops model writing practices that support close reading and Common Core standards in all subjects, and invite secondary and college teachers to consider “writing to read” as a central classroom practice, one that shows rather than tells students how writing clarifies meaning in literary, historical, and nonfiction texts. These techniques are the starting point for each workshop.\n\nIWT workshops also invite readers to find their own ways into a text. Working with diverse writing-to-read strategies, workshop participants discover what they bring to the text, what is noticeable in the text and what is inferred, and what questions the text poses.\n \nThis year we will include sessions on novels, poetry, nonfiction, historical documents, STEM texts, and other media. As educators have come to expect, these workshops focus on putting texts into conversations with other texts, with historical events, and digital media.  The “Writer as Reader” workshops also model writing and reading activities that can focus class discussion, help students engage with difficult material, and emphasize the social character of all learning.\n "},
{"Category": "Leadership, School Design", "End Date": "Sunday, November 4, 2018", "Name": "ASCD Conference on Educational Leadership", "Graduate Credit": "", "URL": "http://www.ascd.org/conference-on-educational-leadership.aspx", "Location": "Nashville, TN", "Organization": "Association for Supervision and Curriculum Development (ASCD)", "Start Date": "Friday, November 2, 2018", "Emily: 👍": "", "Description": "The 2018 ASCD Conference on Educational Leadership is focused on three aspects of effective leadership:\n\nInstructional Leadership\n\n2018 ASCD Conference on Educational LeadershipEnsuring that every child has the necessary tools to succeed requires a spectrum of leadership abilities. Gain the instructional skills that support student achievement, such as effectively using professional teams and utilizing differentiation.\n\nLeveraging Resources\n\nNew opportunities abound—will you be ready to take advantage of them? Learn how you can develop a compelling vision for your school, your team, and your future. Gain insights into how to transform cultures and practices to meet your students' changing needs. Explore how to create partnerships to achieve your goals.\n\nLeading and Supporting Students and Adults\n\nTeam and relationship building is key to your schools' success. See how you can engage students, parents, community officials, and business leaders. Discover proven and innovative ways to build a culture of recruiting and nurturing talent, providing meaning feedback, and identify untapped leadership ability."},
{"Category": "Leadership, Innovation", "End Date": "Wednesday, November 7, 2018", "Name": "Leadership + Design Santa Fe Seminar", "Graduate Credit": "", "URL": "http://www.leadershipanddesign.org/santa-fe-seminar.html", "Location": "Santa Fe, New Mexico", "Organization": "Leadership + Design", "Start Date": "Sunday, November 4, 2018", "Emily: 👍": "", "Description": "The most successful leaders take time away from tasks and the busyness of their daily lives to ask and answer important questions, to share their stories with others, and to envision the future. This place-based learning experience, held in the ideal setting of Santa Fe, NM, will provide time and space for school leaders to engage in spirited dialogue with like-minded colleagues,  to write, and to explore these and other questions:\n\nWhy have I chosen the path of leading in schools?\nHow might I lead more intentionally and from a place that is most authentic to who I am?\nHow might I deepen the relationships with my colleagues, partners, and collaborators?\nHow do I want others to experience my leadership?\nHow might I sustain and even enhance my capacity to lead effectively, joyfully and passionately over my career?\nPast participants have expressed feeling renewed, rejuvenated, and armed with a new readiness to tackle leadership challenges with increased self-awareness."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Teaching about Contested International Issues: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/teaching-contested-international-issues-chicago/", "Location": "Chicago, IL", "Organization": "Brown University", "Start Date": "Monday, November 5, 2018", "Emily: 👍": "", "Description": "Our workshops are completely interactive, so be ready to be engaged and inspired!\nParticipants will be introduced to the Choices Program’s award-winning resources and approach to teaching about contested issues and exploring multiple perspectives.\n\nTeachers will be immersed in the Immigration and U.S. Policy Debate unit and will examine parts of the Climate Change and Questions of Justice unit. Both units are provided. Participants will discuss ways to adapt these units to specific classroom goals.\n\nParticipants will learn about Choices digital editions and other opportunities for you and your students to engage in content on Immigration and Climate Change issues. You will also have the opportunity to network with colleagues in social studies education from across the state."},
{"Category": "Diversity/Equity/Inclusion, Counseling", "End Date": "Sunday, November 18, 2018", "Name": "Ensuring Success for All: Tools and Practices for Inclusive Schools", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/ensuring-success-all-tools-and-practices-inclusive-schools", "Location": "Online", "Organization": "Harvard Graduate School of Education", "Start Date": "Monday, November 5, 2018", "Emily: 👍": "", "Description": "Understand how educators create inclusive school settings that make success possible for all students.\n\nOverview\nWhy is it important to have inclusive schools? How can students, teachers, and school leaders view this diversity as beneficial for their own learning and the school as a whole?\n\nEnsuring Success for All is an online professional development program for teachers and administrators in K-12 settings. Based upon the research of HGSE Professor Thomas Hehir, a leading international expert on educating students with disabilities, the workshop explores why inclusion matters and how schools can treat diversity as an asset. Participants will explore current research on creating inclusive classrooms as well as the Universal Design for Learning (UDL) framework. They will look at examples of UDL in practice, including tools that can be leveraged to identify barriers to learning and ensure success for all students.\n\nProgram Details\nThis two-week online workshop includes a mix of self-paced learning, group discussion, and job-embedded application. Activities include:\n\nVideo lectures from Professor Hehir\nResearch summaries and assigned readings\nSelf-assessment and reflection prompts\nFacilitated cohort discussions\nJob-embedded practice where you will apply the concepts and techniques learned*\nA core part of the HGSE experience is cohort learning, and this curriculum is designed to create a community of practice for participants to learn with and from each other.\n\nThe online workshop will require a total of 5-7 hours of work. Participants who complete all individual assessments and contribute to group discussions will receive a certificate indicating completion of five clock hours of instruction.\n\n*Note: all content is self-paced, including group discussions. Facilitators will moderate discussion boards throughout the two-week program."},
{"Category": "Global Studies, Pedagogy", "End Date": "Sunday, November 18, 2018", "Name": "Educating Global Citizens", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/educating-global-citizens", "Location": "Online", "Organization": "Harvard Graduate School of Education", "Start Date": "Monday, November 5, 2018", "Emily: 👍": "", "Description": "Based upon the work of Professor Fernando Reimers and the Think Tank on Global Education, the program provides strategies for promoting global competence in classrooms and schools.\n\nOverview\nHow can we prepare our students to be engaged global citizens? What is global competence and how can we cultivate it in our students? How can we make the case for global education in schools?\n\nEducating Global Citizens, an online professional development program for K-12 teachers, instructional coaches, and school leaders, begins with an introduction to global education. Professor Reimers and other specialists then focus the conversation on global competence, what it is and why it is important. Participants will identify barriers to global education in their context and will learn from examples of schools already incorporating global competence in K-12 systems. Finally, participants will explore strategies for advancing global education, building a toolkit to inform their future work.\n\nThe program is a mix of self-paced learning, facilitated group discussion, and job-embedded learning that will help educators understand, advocate for, and implement strategies for global competence with their students. Participants will learn tools and tips from the online lessons that they can weave directly into practice in their classrooms or schools.\n\nProgram Details\nThis two-week online workshop includes a mix of self-paced learning, group discussion, and job-embedded application. Activities include:\n\nVideo lectures from from Fernando Reimers and other experts on global education\nResearch summaries and assigned readings\nSelf-assessment and reflection prompts\nFacilitated cohort discussions\nJob-embedded practice, where you will apply the concepts and techniques learned*\nA core part of the HGSE experience is cohort learning, and this curriculum is designed to create a community of practice for participants to learn with and from each other.\n\nThe online workshop will require a total of 5-7 hours of work. Participants who complete all individual assessments and contribute to group discussions will receive a certificate indicating completion of five clock hours of instruction."},
{"Category": "Leadership, Pedagogy, School Design, Counseling", "End Date": "", "Name": "Advisory is Essential 201", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Adv201", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Tuesday, November 6, 2018", "Emily: 👍": "", "Description": "Already have a program in place that needs a tune-up?\n\nOur advanced, 1-day session provides strategies to strengthen and sustain your existing advisory program, as well as to hone your facilitation skills. Participants will:\n\nObserve Wildwood advisories\n\nFocus on applying current Advisory research and best practices\n\nApply Advisory and classroom facilitation protocols to strengthen their existing programs"},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Frederick Douglass vs. William Lloyd Garrison – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-frederick-douglass-vs-william-lloyd-garrison/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, November 10, 2018", "Emily: 👍": "", "Description": "How should the abolition movement look? How should opponents of slavery view the Declaration of Independence, the Constitution, and American government as a whole? Two former allies charted different intellectual courses in response to these questions, as each worked to end the blight that slavery was on the America of their times.\n\nSuggested Readings (go to website for links): \nDocuments and Debates, Vol. 1: Ch. 12, “The Peculiar Institution: Positive Good or Pernicious Sin?” documents A, B, C, D, E, and F\nTo the Public, 1831, William Lloyd Garrison\nOn the Constitution and the Union, 1832, William Lloyd Garrison\nDeclaration of Sentiments Adopted by the Peace Convention, 1838, William Lloyd Garrison\nAddress to the Slaves of the United States, 1843, William Lloyd Garrison\nThe American Union, 1845, William Lloyd Garrison\nThe Constitution and Slavery, 1849, Frederick Douglass\n\nScholars\nChristopher Burkett, Ashland University\nPeter Myers, University of Wisconsin Eau-Claire\nLucas Morel, Washington and Lee University"},
{"Category": "STEM, Technology, Innovation", "End Date": "", "Name": "Brave New Worlds: Augmented and Virtual Reality in Teaching and Learning", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Brave", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Tuesday, November 13, 2018", "Emily: 👍": "", "Description": "Isn't it time you gave it a try?\nThis half-day workshop immerses participants in Augmented Reality and Virtual Reality (AR/VR) learning environments: What’s available, examples of student work, and how to bring it to one’s own practice—across the curriculum.\n\nParticipants will experience the AR/VR platforms of Metaverse, Google Expeditions, and ARkit,\nTry devices like The Oculus Rift, HoloLens, and more.\nNo experience with AR/VR necessary—just a healthy curiosity.\n\nFor grades K-12"},
{"Category": "STEM, Technology", "End Date": "Friday, November 16, 2018", "Name": "CETPA Annual Conference", "Graduate Credit": "", "URL": "http://cetpa.net/CETPA/Events/2018_Conference_Information/CETPA/Events/2018_Annual_Conference/2018_Exhibitors_Show.aspx?hkey=9d871fc5-fe89-4b53-a9f9-cd16da6c1b49", "Location": "Pasadena, CA", "Organization": "The California Educational Technology Professionals Association (CETPA)", "Start Date": "Tuesday, November 13, 2018", "Emily: 👍": "", "Description": "CETPA is the only association in California focusing on the needs of the IT Professionals working in schools. \n\nAttendees of this conference support all facets of IT including CTOs and Directors of Technology, Network Managers and Engineers, Data Base Administrators, Support, and Technicians.  We also attract the Classroom Teacher, Administrators, and District and County Superintendents. All of these groups converge to share ideas and information and find out the latest, best technology tools to help improve teaching, learning, and administration. In addition, we have an impressive list of exhibitors and vendors providing the latest products and services.  Anyone interested in the effective use of technology in schools is welcome!"},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Bill of Rights – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-bill-of-rights-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, November 14, 2018", "Emily: 👍": "", "Description": "Focus Document\nBill of Rights, 1791\n\nComplementary Documents\nVirginia Declaration of Rights, 1776\nSpeech on Amendments to the Constitution, James Madison, 1789\n\nScholars\nDr. John Moser, Ashland University\nDr. Jeff Sikkenga, Ashland University\nDr. Adam Seagrave, University of Missouri"},
{"Category": "STEM, Science, Math, Technology", "End Date": "", "Name": "Massachusetts STEM Summit", "Graduate Credit": "", "URL": "http://mass-stem-summit.org/", "Location": "Worcester, MA", "Organization": "Massachusetts Business Roundtable, the Massachusetts STEM Advisory Council, and the UMass Donahue Institute", "Start Date": "Wednesday, November 14, 2018", "Emily: 👍": "", "Description": "The annual Massachusetts STEM Summit promotes Science, Technology, Engineering and Math education and workforce development from early childhood through adulthood. The theme for this year’s Summit – Progress Through Partnership – celebrates the rich tradition of creative collaboration that has been the hallmark of the Commonwealth’s powerful STEM movement since its earliest inception.\n\nThe Summit itself, hosted and organized for 14 years by a strong education-business-government partnership, exemplifies the power of strategic, purposeful, cross-sector collaboration. Over the years, the Summit has presented countless examples of initiatives in which partners from diverse sectors have come together to leverage each other’s complementary strengths, expertise, and resources. These cooperative efforts have yielded innovative, dynamic, and effective STEM programs for in-school and out-of-school education, and workforce development. Whether large or small, statewide or local, public or private, partnerships of diverse stakeholders remain crucial to the state’s continued STEM success. Throughout this year’s Summit - through talks, presentations and exhibits - we look to showcase many more of these unique partnerships and their exciting, cutting-edge programs, and collaborations."},
{"Category": "Pedagogy, Leadership", "End Date": "", "Name": "Student-Teacher Synergy: A Key Driver of Exceptional, Innovative Schools", "Graduate Credit": "", "URL": "https://www.aisne.org/events/workshops/nov-2018-student-teacher-synergy", "Location": "TBD", "Organization": "Association of Independent Schools New England (AISNE)", "Start Date": "Thursday, November 15, 2018", "Emily: 👍": "", "Description": "Registration & Breakfast: 8:15 - 9:00 a.m.\nWorkshop begins: 9:00 a.m.\n\nWe often know what it's going to take to improve our schools and make them exceptional; yet we still need to get better at convincing ourselves and other stakeholders to get on board. Jennifer Gonzalez will share lessons from change management theory and tools to help you:\nMeeting evolving student needs\nStrengthen student-teacher partnerships\nBuild the support and momentum necessary to advance tangible innovations within your school\nLeverage the latest related technologies and practices\nIn this session, participants learn techniques and have an opportunity to practice them. This high-energy workshop is a great way to build staff morale while learning valuable classroom techniques.\nFacilitated by: Jennifer Gonzalez"},
{"Category": "Leadership, Pedagogy, School Design, Counseling", "End Date": "Friday, November 16, 2018", "Name": "Advisory is Essential 101", "Graduate Credit": "", "URL": "http://www.wildwood.org/page.cfm?p=1627#Adv101", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Thursday, November 15, 2018", "Emily: 👍": "", "Description": "Just starting out? Want a complete program re-design?\n\nChoose this in-depth, 2-day session to create an advisory program that fits your school—public, charter, or private—and leave with a plan to succeed. Participants will: Observe Wildwood middle and high school advisories; analyze current research on advisory and best practices; learn from Wildwood advisors and students; practice advisory and classroom facilitation protocols; generate a plan to implement your program.\n\n"},
{"Category": "Humanities, Literature, Writing", "End Date": "Sunday, November 18, 2018", "Name": "National Council of Teachers of English Annual Convention", "Graduate Credit": "", "URL": "http://convention.ncte.org/", "Location": "Houston, TX", "Organization": "National Council of Teachers of English", "Start Date": "Thursday, November 15, 2018", "Emily: 👍": "", "Description": "\"Raising Student Voice\""},
{"Category": "STEM, Science", "End Date": "Saturday, November 17, 2018", "Name": "National Science Teachers Association (NSTA) Area Conference: \"Science Education: A National Priority\"", "Graduate Credit": "", "URL": "http://www.nsta.org/conferences/area2.aspx", "Location": "National Harbor, MD", "Organization": "National Science Teachers Association (NSTA)", "Start Date": "Thursday, November 15, 2018", "Emily: 👍": "", "Description": "NSTA conferences offer the latest in science content, teaching strategy, and research to enhance and expand your professional growth. Take advantage of this unique opportunity to collaborate with science education leaders and your peers. Each year, NSTA hosts a national conference on science education (in the spring), three area conferences (in the fall), and a STEM Forum & Expo."},
{"Category": "Counseling, Health, Pedagogy, STEM, Technology, Science", "End Date": "Sunday, November 18, 2018", "Name": "Reaching for Greatness: Unleash Potential, Passions, and Creative Talents in Students with Cognitive Science", "Graduate Credit": "", "URL": "https://www.learningandthebrain.com/education-conferences", "Location": "Boston, MA", "Organization": "Learning & The Brain", "Start Date": "Friday, November 16, 2018", "Emily: 👍": "", "Description": "Researchers in cognitive and psychological sciences are exploring the “Science of Human Greatness.” By studying child prodigies, savants, and great innovators like Benjamin Franklin and Albert Einstein, scientists are trying to answer the complex questions of human potential: What makes a person a “creative genius”? Is “greatness” the result of innate talents or practice? Research has found that passion, interest, genes, abilities, practice, persistence, and parent/teacher support all contribute to reaching full potential, and that everyone's inborn creativity and talents can be cultivated. Yet, many children's talents and passions are ignored in schools. Explore the science behind child potential, prodigies, gifted, and genius. Discover how you can unleash and nurture your own and your students' passions, interests, expertise, and creative talents, and find out how schools can help children and youth reach their full potential.\n\n\nLEARNING OBJECTIVES\nYou will gain knowledge about:\nThe science of human greatness, talents, and abilities\nWays schools can help students reach their full potential\nThe importance of promoting personal passions and interests\nWays to teach for wisdom, intelligence, creativity, and innovation\nHow the mistakes of great minds can motivate student learning\nThe link between learning disorders, autism, and creative genius\nUsing art, STEAM, and technology to engage children's interests\nThe human brain, abilities, genes, intelligence, and environment\nDeveloping the talents of the gifted children, prodigies, and savants\nInnate talents vs. deliberate practice in expert performance\nPersonalizing learning, reading, and writing"},
{"Category": "Language", "End Date": "Sunday, November 18, 2018", "Name": "Annual Convention and World Languages Expo", "Graduate Credit": "", "URL": "https://www.actfl.org/convention-expo", "Location": "New Orleans, LA", "Organization": "American Council on the Teaching of Foreign Language", "Start Date": "Friday, November 16, 2018", "Emily: 👍": "", "Description": "The ACTFL Annual Convention and World Languages Expo is an international event bringing together more than 7,000 language educators from all languages, levels, and assignments. Our goal is to provide a comprehensive professional development experience that will have an impact on language educators at all levels of teaching and in turn help their students to succeed in their language learning process. Come participate in the world’s most comprehensive language education meeting of the minds featuring more than 800 educational sessions in a variety of formats that focus on innovative programs, emerging trends that impact the language profession, and research-informed practices. "},
{"Category": "Humanities, Writing, Journalism", "End Date": "Monday, November 19, 2018", "Name": "JEA/NSPA National High School Journalism Convention", "Graduate Credit": "", "URL": "http://journalismconvention.org/", "Location": "Dallas, TX", "Organization": "Journalism Education Association and National Scholastic Press Association", "Start Date": "Friday, November 16, 2018", "Emily: 👍": "", "Description": "The National High School Journalism Convention is a semiannual gathering of high school journalists and advisers co-sponsored by the Journalism Education Association and the National Scholastic Press Association. With typical attendance of more than 4,000 delegates, the JEA/NSPA convention is the largest gathering of student journalists in the country.\nThe associations partner to prepare hundreds of practical and professional learning sessions, from high-profile keynotes to specific, problem-solving breakouts and hands-on workshops."},
{"Category": "Diversity/Equity/Inclusion, Leadership", "End Date": "12/1", "Name": "2018 People of Color Conference - Equitable Schools and Inclusive Communities: Harmony, Discord, and the Notes in Between", "Graduate Credit": "", "URL": "http://pocc.nais.org/#", "Location": "Nashville, TN", "Organization": "National Association of Independent Schools (NAIS)", "Start Date": "Wednesday, November 28, 2018", "Emily: 👍": "", "Description": "The NAIS People of Color Conference is the flagship of the National Association of Independent Schools' commitment to equity and justice in teaching and learning. The mission of the conference is to provide a safe space for leadership and professional development and networking for people of color and allies of all backgrounds in independent schools. PoCC equips educators at every level, from teachers to trustees, with knowledge, skills, and experiences to improve and enhance the interracial, interethnic, and intercultural climate in their schools, as well as the attending academic, social-emotional, and workplace performance outcomes for students and adults alike."},
{"Category": "STEM, Math", "End Date": "Friday, November 30, 2018", "Name": "National Council of Teachers of Mathematics Regional Conferences", "Graduate Credit": "", "URL": "http://www.nctm.org/Conferences-and-Professional-Development/Regional-Conferences-and-Expositions/", "Location": "Seattle, WA", "Organization": "National Council of Teachers of Mathematics", "Start Date": "Wednesday, November 28, 2018", "Emily: 👍": "", "Description": "Join us to connect face-to-face with your peers in education and to focus on the learning and resources that promote the mathematical habits of mind that will lead your students to college and career success.\n\nWhether you're a classroom teacher, math coach, administrator, math teacher educator, teacher-in-training, or math specialist, there's something for you at the NCTM Regional Conferences & Expositions."},
{"Category": "STEM, Science", "End Date": "Saturday, December 1, 2018", "Name": "National Science Teachers Association (NSTA) Area Conference: \"Energize Science: Educate and Engage\"", "Graduate Credit": "", "URL": "http://www.nsta.org/conferences/area3.aspx", "Location": "Charlotte, NC", "Organization": "National Science Teachers Association (NSTA)", "Start Date": "Thursday, November 29, 2018", "Emily: 👍": "", "Description": "NSTA conferences offer the latest in science content, teaching strategy, and research to enhance and expand your professional growth. Take advantage of this unique opportunity to collaborate with science education leaders and your peers. Each year, NSTA hosts a national conference on science education (in the spring), three area conferences (in the fall), and a STEM Forum & Expo."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "Sunday, December 2, 2018", "Name": "Competing Visions of Human Rights: Questions for U.S. Policy", "Graduate Credit": "", "URL": "http://www.choices.edu/event/competing-visions-human-rights-questions-u-s-policy/", "Location": "Chicago, IL", "Organization": "Brown University", "Start Date": "Friday, November 30, 2018", "Emily: 👍": "", "Description": "The session provides an introduction to the Choices approach for teaching about Human Rights issues around the world, and the U.S. response to Human Rights violations. Participants will conduct activities from the Choices unit on Human Rights (provided) and will discuss ways to implement the unit and accompanying videos in their classroom."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "It’s More than Maps: Incorporating Choices’ Geography Series into Classrooms", "Graduate Credit": "", "URL": "http://www.choices.edu/event/maps-incorporating-choices-geography-series-classrooms/", "Location": "Chicago, IL", "Organization": "Brown University", "Start Date": "Friday, November 30, 2018", "Emily: 👍": "", "Description": "From Afghanistan to the Rohingya, explore Choices’ Geography Series and experience inquiry-based lessons from the Brazil, Immigration, and Nigeria units. Additional geography-related resources provided."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "Thursday, December 6, 2018", "Name": "98th Annual NCSS Conference", "Graduate Credit": "", "URL": "https://www.socialstudies.org/conference", "Location": "Chicago, IL", "Organization": "National Council for the Social Studies", "Start Date": "Friday, November 30, 2018", "Emily: 👍": "", "Description": "All of Chicago's history, culture, and traditions will be on display at the 98th NCSS Annual Conference.  NCSS returns to the city for its first appearance in 15 years for the world's largest and most comprehensive social studies professional development conference.  Join more than 3,000 of your social studies colleagues to share the most current knowledge, ideas, research and expertise in social studies education, and experience all that Chicago has to offer."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Abraham Lincoln vs. Stephen A. Douglas – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-abraham-lincoln-vs-stephen-a-douglas-great-american-debates/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, December 1, 2018", "Emily: 👍": "", "Description": "The seven Lincoln-Douglas debates are, arguably, the most famous literal debates in American history, with the two men going into depth on subjects of both immediate and enduring importance in American politics and law.\n\nSuggested Readings\nHouse Divided Speech, June 1858, Abraham Lincoln\nHomecoming Speech at Chicago, July 1858, Stephen A. Douglas\nThe Lincoln-Douglas Debates: First Debate, 21 August 1858, Ottawa, IL\n\nScholars\nChristopher Burkett, Ashland University\nJason Stevens, Ashland University"},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Power Session: Nigeria: History, Identity, and Change", "Graduate Credit": "", "URL": "http://www.choices.edu/event/power-session-nigeria-history-identity-change/", "Location": "Chicago, IL", "Organization": "Brown University", "Start Date": "Saturday, December 1, 2018", "Emily: 👍": "", "Description": "The session provides a short introduction to the newest Choices unit, Nigeria: History, Identity, and Change. Participants will conduct one activity from the unit and will discuss ways to implement the unit and accompanying videos into their classroom."},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Engaging Students in International Issues: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/washington-2018/", "Location": "Washington, DC", "Organization": "Brown University", "Start Date": "Tuesday, December 4, 2018", "Emily: 👍": "", "Description": "Our workshops are interactive, so be ready to be engaged and inspired!\n\nParticipants will be completely immersed in United Nations: Challenges and Change, and will examine parts of A New Nation. Both units are provided. Participants will discuss ways to adapt these units to specific classroom goals. The workshop will also highlight free resources on the Choices website.\n\nCo-Sponsored by DACOR, An Organization of Foreign Affairs Professionals"},
{"Category": "Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Workshop: Teaching Boys, Teaching Girls: Gender's Role in Learning", "Graduate Credit": "", "URL": "https://www.aisne.org/events", "Location": "Brookline, MA", "Organization": "Association of Independent Schools New England (AISNE)", "Start Date": "Wednesday, December 5, 2018", "Emily: 👍": "", "Description": "Presented by: Michael Thompson and Meg Stowe\n\nThis is a two-part workshop for teachers and leaders eager to dig deeply into the latest thinking about the role of gender in the classroom.\n\nParticipants will learn how to:\nChallenge restrictive stereotypes that hold students back\nLeverage data-driven best practices in the classroom\nRecognize unique strengths and developmental stages of girls and boys"},
{"Category": "Pedagogy, Leadership", "End Date": "Friday, December 7, 2018", "Name": "National Summit on Education Reform", "Graduate Credit": "", "URL": "http://www.excelined.org/national-summit/ ", "Location": "Washington, DC", "Organization": "The Foundation for Excellence in Education", "Start Date": "Wednesday, December 5, 2018", "Emily: 👍": "", "Description": "Organized by the Foundation for Excellence in Education (ExcelinEd), the summit is the nation’s premier gathering of education reformers. It provides state and local policymakers, education leaders and advocates with comprehensive information on evolving laws, new trends, successful policies and the latest innovations that are transforming education for the 21st century.\n\nLast year’s National Summit was attended by more than 900 education leaders from 45 states. General session speakers included 66th U.S. Secretary of State and ExcelinEd Board Member Dr. Condoleezza Rice, President of the American Enterprise Institute Dr. Arthur C. Brooks and 2013 TED Talk prize winner Dr. Sugata Mitra.\n\nTogether with a first-class lineup of notable keynote and general session speakers, strategy workshops cover a variety of topics that feature panels of policy experts, local education leaders and state legislative leaders. By learning what is working— and not working— in other states and school districts, attendees can return home better informed and prepared to implement policies that will advance the achievement of their students.\n"},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Engaging Students in International Issues: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/engaging-students-international-issues-choices-approach-mi-10-6/", "Location": "Waterford, MI", "Organization": "Brown University", "Start Date": "Thursday, December 6, 2018", "Emily: 👍": "", "Description": "Our workshops are completely interactive, so be ready to be engaged and inspired!\n\nParticipants will be introduced to the Choices Program’s award-winning resources and approach to teaching about contested issues and exploring multiple perspectives.\n\nTeachers will be immersed in Immigration and the U.S. Policy Debate unit and will examine parts of The U.S. Role in a Changing World unit (provided). We will discuss ways to adapt these units to specific classroom goals.\n\nParticipants will also have the opportunity to network with colleagues in social studies education from across the state.\n\nHosted by Oakland Schools"},
{"Category": "Counseling, Health, Pedagogy", "End Date": "", "Name": "Growing Up Mindful", "Graduate Credit": "", "URL": "https://www.learningandthebrain.com/Event-385/Growing-Up-Mindful/", "Location": "White Plains, NY", "Organization": "Learning & The Brain", "Start Date": "Thursday, December 6, 2018", "Emily: 👍": "", "Description": "Introducing mindfulness into the lives of our children and teenagers is perhaps the greatest gift we can offer. Mindfulness builds emotional intelligence, boosts happiness, increases curiosity and engagement, reduces anxiety and depression, soothes the pain of trauma, and helps kids (and adults) focus, learn,and make better choices. Join Dr. Christopher Willard in this one-day seminar on bringing mindfulness to children and teens in the classroom, clinic, and beyond. Dr. Willard will shave proven practices and share how to integrate these practices into your classroom and schools. You will examine the research behind mindfulness, including the latest from advances in the neurobiology of learning and emotions. You will learn how to harness the benefits of present-focused awareness for students, including at-risk youth and those with special needs. Discover ways to incorporate mindfulness into a broad range of activities, such as movement, music, games, writing, art, and more, for attention spans from 30 seconds to 30 minutes.\n\nThis seminar runs from 8:15 am to 2:30 pm at the Crowne Plaza White Plains - Downtown.\n\nLEARNING OBJECTIVES\nParticipants will be able to:\n \n• Discover ways to explain mindfulness to children and get them to buy into mindfulness practice and its benefits\n• Understand the neuroscience of mindfulness and the effects of mind-body interventions on the stress response\n• Practice simple, short, effective mindfulness practices to use in the classroom, practice, and with various children's activities\n• Explore new ways to engage kinds and increase their attention\n• Engage present-focused awareness to increase balance, calm, and resilience\n• Examine ways to integrate mindfulness systemically into your school, classtoom, or clinic\n \n \nWHO SHOULD ATTEND\nThis seminar is geared toward all levels of educators and clinicians who are interested in mindfulness including K-12 educators, special educators, school psychologists, and occupational and physical therapists."},
{"Category": "Pedagogy, Humanities, History, Global Studies, Sustainability, Science", "End Date": "", "Name": "Engaging Students in the Study of Climate Change: The Choices Approach", "Graduate Credit": "", "URL": "http://www.choices.edu/event/engaging-students-study-climate-change-choices-approach/", "Location": "Waterford, MI", "Organization": "Brown University", "Start Date": "Friday, December 7, 2018", "Emily: 👍": "", "Description": "Our workshops are completely interactive, so be ready to be engaged and inspired!\nParticipants will be introduced to the Choices Program’s award-winning resources and approach to teaching about contested issues and exploring multiple perspectives.\n\nTeachers will be immersed in Climate Change and Questions of Justice (provided.) We will discuss how this unit addresses the Next Generation Science Standards, and ways to adapt the unit to specific classroom goals. A review of free resources available from the Choices Program will also be provided.\n\nParticipants will learn about other opportunities to engage students in content on Climate Change and network with colleagues in science and social studies education from across the state.\n\nHosted by Oakland, MI Schools"},
{"Category": "Pedagogy, Science, Health, Counseling", "End Date": "", "Name": "Teaching the Teenage Brain: Aligning Your Classroom Practice With Adolescent Brain Development", "Graduate Credit": "", "URL": "https://www.learningandthebrain.com/Event-382/Teaching-the-Teenage-Brain/", "Location": "White Plains, NY", "Organization": "Learning & The Brain", "Start Date": "Friday, December 7, 2018", "Emily: 👍": "", "Description": "Why are teenagers so hard to understand? This lively and interactive seminar explores current brain research to explain cognitive and emotional developments in middle and high school students. Through the field of neuroscience, you will explore the development of neural networks and myelination to better understand teenage thinking and feeling. In the field of psychology, you will consider the importance of working memory, self-control, attention, and motivation – and their key differences in teenagers. These scientific explorations will inform your teaching practice and offer practical classroom strategies. The workshop will also consider research into sleep, the unique sleep needs and schedules of adolescents, and their implications for current school schedules. Finally, you investigate the surprising and often contradictory research into technology usage and video games that keep adolescents busy and (dis-)connected. You will leave with a deeper understanding of adolescent brains and minds, and ways to better serve them in school.\n\nThis seminar runs from 8:15 am to 2:30 pm at the Crowne Plaza White Plains - Downtown.\n\nLEARNING OBJECTIVES\nParticipants will be able to:\n \n• Explain the neural changes behind adolescent emotional development, especially the \"imbalance hypothesis\"\n• Outline the trajectory of teenage cognitive development, especially working memory, long-term memory, processing speed, and self-control\n• Realign teaching strategies, school policies, and schedules to fit with teenage brain development and learning\n• Enhance students' self-control with research-supported strategies\n• Explain the benefits and detriments of adolescent technology use, including academic technology, social media, and video games\n• Understand the limitations of scientific research, in order to use it most effectively in the classroom\n \n \nWHO SHOULD ATTEND\nThis seminar is applicable for 6-12 teachers of all disciplines, academic administrators, instructional leaders, learning specialists, and middle and high school counselors\n "},
{"Category": "Leadership", "End Date": "Tuesday, December 18, 2018", "Name": "NEASC Annual Meeting and Conference: Leading Change", "Graduate Credit": "", "URL": "https://www.neasc.org/annual-meeting", "Location": "Boston, MA", "Organization": "New England Association of Schools and Colleges (NEASC)", "Start Date": "Wednesday, December 12, 2018", "Emily: 👍": "", "Description": "This year's NEASC Annual Meeting and Conference will bring together some of the most prominent visionaries and thought leaders in education for a three-day conference on Leading Change. Join us in December to attend informative workshops, to hear outstanding keynote addresses, and to exchange ideas and resources with colleagues. A broad array of presentations for both Higher Education and K-12 learning communities will challenge you to develop new strategies for institutional improvement and transformation. "},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Letter to Roger Weightman – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-letter-to-roger-weightman-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, December 19, 2018", "Emily: 👍": "", "Description": "Focus Document\nLetter to Roger C. Weightman, Thomas Jefferson, 1826\n\nComplementary Documents\nDeclaration of Independence, 1776\nLetter to Henry Lee, Thomas Jefferson, 1825\n\nScholars\nDr. John Moser, Ashland University\nDr. Todd Estes, Oakland University\nDr. Rob McDonald, United States Military Academy"},
{"Category": "Humanities, Literature, Writing, Language, Pedagogy", "End Date": "Sunday, January 6, 2019", "Name": "MLA convention 2019", "Graduate Credit": "", "URL": "https://www.mla.org/Convention", "Location": "Chicago, IL", "Organization": "Modern Language Association (MLA)", "Start Date": "Thursday, January 3, 2019", "Emily: 👍": "", "Description": "The largest scholarly meeting in the humanities, the MLA convention brings together thousands of members to discuss new research, participate in workshops, and build their professional networks.The 2017 convention featured nearly 800 sessions on language, literature, writing, pedagogy, media studies, and much more. "},
{"Category": "Technology, STEM, Leadership, School Design, Pedagogy", "End Date": "", "Name": "MassCUE Datapalooza 2019", "Graduate Credit": "", "URL": "http://www.masscue.org/event/masscue-datapalooza-2019/", "Location": "Foxborough, MA", "Organization": "MassCUE", "Start Date": "Tuesday, January 8, 2019", "Emily: 👍": "", "Description": "The MassCUE Datapalooza event focuses on educators sharing best practices for using data in the classroom, school, or district. The event will start with a morning keynote followed by a series of presentations (55 minutes long) throughout the day. We are encouraging educators to attend this event in teams that consist of school and district administrators, technology directors, technology integration specialists, and classroom teachers or specialists. Presentations will demonstrate on how schools and/or districts effectively use data to improve teaching and learning."},
{"Category": "Literature, Writing, Humanities", "End Date": "Sunday, January 13, 2019", "Name": "Key West Literary Seminar 2018: Writers of the Caribbean", "Graduate Credit": "", "URL": "http://www.kwls.org/", "Location": "Key West, FL", "Organization": "Key West Literary Seminar (KWLS)", "Start Date": "Thursday, January 10, 2019", "Emily: 👍": "", "Description": "Our flagship program is the annual Seminar, a four-day event that explores a unique literary theme each January, where readers from around the world enjoy presentations by some of the best writers of our time. \n\nIn our Writers’ Workshop Program, also in January, writers of all levels meet in small groups with esteemed faculty (such as former Poet Laureate Billy Collins),  to share their work and explore the craft of writing. \n\nA Scholarship Program reduces fees for teachers and librarians, and recognizes the work of outstanding emerging writers. \n\nExclusive recordings from the Seminar over thirty years are available in the Audio Archive, while our online journal, Littoral, features news, essays, photographs, and other resources that document Key West’s rich literary history."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Secessionists vs. Unionists – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-secessionists-vs-unionists-great-american-debates/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, January 12, 2019", "Emily: 👍": "", "Description": "Waged in Congress, state governments, newspaper editorials, and within and between family and friends, the prelude to the Civil War was, in part, a debate over union vs. state, of a national identity vs. a local one, enflamed by the decades-old debate over slavery.\n\nScholars\nChristopher Burkett, Ashland University\nScott Yenor, Boise State University"},
{"Category": "STEM, Technology, Innovation", "End Date": "", "Name": "Brave New Worlds: Augmented and Virtual Reality in Teaching and Learning", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Brave", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Tuesday, January 15, 2019", "Emily: 👍": "", "Description": "Isn't it time you gave it a try?\nThis half-day workshop immerses participants in Augmented Reality and Virtual Reality (AR/VR) learning environments: What’s available, examples of student work, and how to bring it to one’s own practice—across the curriculum.\n\nParticipants will experience the AR/VR platforms of Metaverse, Google Expeditions, and ARkit,\nTry devices like The Oculus Rift, HoloLens, and more.\nNo experience with AR/VR necessary—just a healthy curiosity.\n\nFor grades K-12"},
{"Category": "", "End Date": "Saturday, January 19, 2019", "Name": "Key West Literary Seminar: Writers Workshop Program", "Graduate Credit": "", "URL": "http://www.kwls.org/", "Location": "Key West, FL", "Organization": "Key West Literary Seminar (KWLS)", "Start Date": "Tuesday, January 15, 2019", "Emily: 👍": "", "Description": "Our flagship program is the annual Seminar, a four-day event that explores a unique literary theme each January, where readers from around the world enjoy presentations by some of the best writers of our time. \n\nIn our Writers’ Workshop Program, also in January, writers of all levels meet in small groups with esteemed faculty (such as former Poet Laureate Billy Collins),  to share their work and explore the craft of writing. \n\nA Scholarship Program reduces fees for teachers and librarians, and recognizes the work of outstanding emerging writers. \n\nExclusive recordings from the Seminar over thirty years are available in the Audio Archive, while our online journal, Littoral, features news, essays, photographs, and other resources that document Key West’s rich literary history."},
{"Category": "Leadership, Pedagogy, School Design, Counseling", "End Date": "", "Name": "Advisory is Essential 201", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Adv201", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Thursday, January 17, 2019", "Emily: 👍": "", "Description": "Already have a program in place that needs a tune-up?\n\nOur advanced, 1-day session provides strategies to strengthen and sustain your existing advisory program, as well as to hone your facilitation skills. Participants will:\n\nObserve Wildwood advisories\n\nFocus on applying current Advisory research and best practices\n\nApply Advisory and classroom facilitation protocols to strengthen their existing programs"},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Speech on the Repeal of the Missouri Compromise – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-speech-on-the-repeal-of-the-missouri-compromise-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, January 23, 2019", "Emily: 👍": "", "Description": "Focus Document\nSpeech on the Repeal of the Missouri Compromise, Abraham Lincoln, 1854\n\nComplementary Documents\nHouse Divided Speech, Abraham Lincoln, 1858\nAddress at Cooper Institute, Abraham Lincoln, 1860\n\nScholars\nDr. John Moser, Ashland University\nDr. Lucas Morel, Washington and Lee University\nDr. Dan Monroe, Millikin University"},
{"Category": "STEM, Technology, Pedagogy, Leadership, Innovation", "End Date": "Saturday, January 26, 2019", "Name": "BETT", "Graduate Credit": "", "URL": "http://www.bettshow.com/", "Location": "London, England", "Organization": "Bett", "Start Date": "Wednesday, January 23, 2019", "Emily: 👍": "", "Description": "With over 30,000 attendees from all around the world and thousands of exhibitors demonstrating the latest in EdTech, BETT is the world’s largest EdTech conference. At Bett we believe in creating a better future by transforming education. Our mission is to bring together people, ideas, practices and technologies so that educators and learners can fulfil their potential.\n"},
{"Category": "Library", "End Date": "Tuesday, January 29, 2019", "Name": "ALA Midwinter Meeting 2019", "Graduate Credit": "", "URL": "http://2019.alamidwinter.org/", "Location": "Seattle, WA", "Organization": "American Library Association (ALA)", "Start Date": "Friday, January 25, 2019", "Emily: 👍": "", "Description": "2019 ALA Midwinter Meeting Highlights include:\n\nSymposium on the Future of Libraries and News You Can Use. (both included in your full-conference registration)!\n \nNew technologies, publications and services from expert organizations on the Exhibits Floor!\n \nAwards, announcements and 100s of authors!\n \nIn-depth learning and educational sessions!\n \nUnlimited connections with colleagues from all types of libraries!"},
{"Category": "Athletics, Health", "End Date": "Tuesday, January 29, 2019", "Name": "Athletic Directors Conference", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Nashville, TN", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Sunday, January 27, 2019", "Emily: 👍": "", "Description": "A professional development opportunity for new and experienced athletic directors from across the region. Learn alongside colleagues as you discuss leadership, communications, and best practices unique to the culture of an independent school athletic department. Take advantage of this focused workshop to discover solutions to current issues and stay informed on the latest trends. "},
{"Category": "Counseling", "End Date": "Tuesday, January 29, 2019", "Name": "Academic Support Conference", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Nashville, TN", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Sunday, January 27, 2019", "Emily: 👍": "", "Description": "A professional development opportunity for all those who offer academic support in an independent school. Classroom teachers, learning specialists, and directors of academic support are all invited to learn together at this new conference that will feature the latest research, curriculum, instructional strategies, and best practices for supporting all learners in an independent school. Network with others in the field to discover practical solutions and strategies to foster student success. "},
{"Category": "STEM, Technology", "End Date": "Wednesday, January 30, 2019", "Name": "The Future of Education Technology (FETC)", "Graduate Credit": "", "URL": "http://fetc.org/", "Location": "Orlando, FL", "Organization": "FETC", "Start Date": "Sunday, January 27, 2019", "Emily: 👍": "", "Description": "The Future of Education Technology Conference (FETC), the largest, national, independent education technology conference, annually attracts thousands of education and technology leaders from around the world. Delivering strategies and best practices for student success and schoolwide advancement, FETC is known as one of the nation’s premier education technology events! Recognized for its outstanding program year after year, FETC provides CTOs, CIOs, Innovation Directors, Special Ed/Pupil Services Directors, Early Childhood Directors, Media Specialists, Technologists, Administrators and other Educators, the opportunity to explore the most effective integration of technology across the curriculum — from preK-12 — through premium sessions, intensive workshops, various concurrent sessions, live demonstrations of several hundred hardware and software products, plus much more."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars -Imperialists vs. Non-Interventionists – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/21041/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, February 2, 2019", "Emily: 👍": "", "Description": "The Gilded Age and Progressive Era both coincided with the emergence, and debate over, America as an imperial power, The same leaders lauded for domestic reforms were those who worked hard to expand American power overseas, and they were confronted at home by groups and individuals who, for a variety of reasons, believed that America was not meant to take or maintain imperial possessions.\n\nScholars\nChristopher Burkett, Ashland University\nJennifer Keene, Chapman University\nGregory Schneider, Emporia State University"},
{"Category": "STEM, Technology", "End Date": "Friday, February 8, 2019", "Name": "TCEA Convention & Exposition", "Graduate Credit": "", "URL": "https://convention.tcea.org/", "Location": "San Antonio, TX", "Organization": "Texas Computer Education Association", "Start Date": "Monday, February 4, 2019", "Emily: 👍": "", "Description": "Hailed as the must-attend event of the year by passionate educators of all levels and specialties, this educational technology integration and best practices conference offers more than 900 presentations and workshops to build your teaching practice, 450 exhibiting companies to enhance your productivity and product knowledge, and numerous networking opportunities to extend your connections and grow your PLN for continuing collaborations.\n\nAt TCEA, you can choose from a broad range of sessions in varying presentation formats, all of which provide in-depth exploration and encourage creativity, sharing, and learning.\n\n"},
{"Category": "Pedagogy, Humanities, History, Global Studies", "End Date": "", "Name": "Teaching about the Civil War and Slavery", "Graduate Credit": "", "URL": "http://www.choices.edu/event/teaching-civil-war-slavery/", "Location": "Providence, RI", "Organization": "Brown University", "Start Date": "Thursday, February 7, 2019", "Emily: 👍": "", "Description": "Our workshops are participatory, so come ready to be engaged and inspired!\n\nParticipants will be be introduced to the Choices Program’s award-winning resources and approach to teaching about contested topics in U.S. History\n\nTeachers will be immersed in The Civil War and will examine parts of A New Nation.  Both curriculum units are provided. Participants will discuss ways to adapt these units to specific classroom goals. \n\nParticipants will have the opportunity to network with exemplary colleagues in social studies education from across the area. We will also share other opportunities at Brown University for you and your students to engage in innovate content on this time period in U.S. history. "},
{"Category": "Language", "End Date": "Saturday, February 9, 2019", "Name": "Strengthening World Language Education: Standards for Success", "Graduate Credit": "", "URL": "http://www.nectfl.org/conference/", "Location": "New York, NY", "Organization": "The Northeast Conference on the Teaching of Foreign Languages", "Start Date": "Thursday, February 7, 2019", "Emily: 👍": "", "Description": "For teachers, by teachers. NECTFL’s conferences are designed for all concerned with foreign language education, providing both outstanding professional development and the chance to interact with colleagues.  The conference attracts about 1,500 individuals who take advantage of a packed exhibit hall (over 100 companies) and schedule (over 200 sessions and workshops). "},
{"Category": "STEM, Technology", "End Date": "Tuesday, February 13, 2018", "Name": "Pennsylvania Education Technology Expo and Conference (PETE&C)", "Graduate Credit": "", "URL": "https://www.peteandc.org/", "Location": "Hershey, PA", "Organization": "PETE&C", "Start Date": "Sunday, February 10, 2019", "Emily: 👍": "", "Description": "EdTech conference, expo & student showcase"},
{"Category": "STEM, Technology", "End Date": "Thursday, February 14, 2019", "Name": "The Ohio Educational Technology Conference (OETC)", "Graduate Credit": "", "URL": "http://oetc.ohio.gov/", "Location": "Columbus, OH", "Organization": "The Ohio Educational Technology Conference (OETC)", "Start Date": "Tuesday, February 12, 2019", "Emily: 👍": "", "Description": "The Ohio Educational Technology Conference (OETC) is the premier P-20 state educational technology conference. Each year, more than 4,000 educational technology professionals and enthusiasts come together to explore the forefront of P-20 learning and innovation in Ohio.\n\nDesigned to cultivate partnerships, promote collaboration, deliver high-quality information, and make technology accessible and enjoyable for educators, the OETC is the must-attend conference of the year for P-20 teachers, curriculum and technology coordinators, administrators, higher education professors and administrators, and everyone who is interested in learning more about what’s happening in technology today.\n\nFor three full days, attendees can learn what’s new and look towards the future by exploring new technologies,  trying them out in a interactive atmosphere, and learning how to integrate them into the learning environment."},
{"Category": "Counseling, Health, Pedagogy", "End Date": "Sunday, February 17, 2019", "Name": "Educating with Empathy: Using the Science of Human Goodness to Promote Child Compassion, Cooperation, and Collaboration", "Graduate Credit": "", "URL": "https://www.learningandthebrain.com/Event-380/Educating-with-Empathy/", "Location": "San Francisco, CA", "Organization": "Learning & The Brain", "Start Date": "Friday, February 15, 2019", "Emily: 👍": "", "Description": "RAISING COMPASSIONATE, CARING CHILDREN IN A CHAOTIC WORLD\nNeuroscience and Social Psychological research has discovered that positive emotional behaviors (such as empathy, compassion, self-compassion, cooperation, collaboration, altruism, and kindness) are hardwired in the brain and are essential for human survival, especially in today’s caustic, chaotic world. Recent research has found that these skills can be taught and that they can significantly reduce behavior problems and bullying and enhance resilience, wellbeing, relationships, child cooperation, collaboration skills, and academic performance in schools. Discover the “Science of Human Goodness” and its findings on the importance of compassion, collaboration, and empathy, ways to teach and train these skills in children and teens, and why they are essential for academic and life success."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Roosevelt Corollary to the Monroe Doctrine – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-roosevelt-corollary-to-the-monroe-doctrine-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, February 20, 2019", "Emily: 👍": "", "Description": "Focus Document\nRoosevelt Corollary to the Monroe Doctrine, Theodore Roosevelt, 1904\n\nComplementary Documents\nMonroe Doctrine, James Monroe, 1823\nDollar Diplomacy, William Howard Taft, 1912\n\nScholars\nDr. John Moser, Ashland University\nDr. David Alvis, Wofford College\nDr. Sarah Burns, Rochester Institute of Technology\n"},
{"Category": "Pedagogy, School Design, Research", "End Date": "", "Name": "The Institute Model: Disruptive by Design", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#WISRD", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Saturday, February 23, 2019", "Emily: 👍": "", "Description": "Want to re-make your students' concept of school?\nThis provocative workshop is for middle and high school educators interested in disrupting the prevailing educational model by embedding authentic research and development work into students' classroom experiences. Participants will explore:\n\nWildwood’s pioneering R & D institutes The Wildwood Institute for STEM Research and Development (WISRD) and the Wildwood Institute for Social Good and Community Leadership\n\nTapping student interest and expertise to guide learning\n\nFostering student identification of real-world problems and solutions\n\nShifting their roles as educators toward facilitation and guidance of student learning\n\nFirst-hand insights from Wildwood student researchers and developers\n\nFor Grades 6-12"},
{"Category": "Pedagogy, Leadership, School Design, Diversity/Equity/Inclusion", "End Date": "Friday, March 1, 2019", "Name": "NAIS Annual Conference - Reimagining Independent Schools: Tearing Down Walls, Building Capacity, and Designing Our Future", "Graduate Credit": "", "URL": "http://annualconference.nais.org/Pages/default.aspx", "Location": "Long Beach, CA", "Organization": "The National Association of Independent Schools (NAIS)", "Start Date": "Wednesday, February 27, 2019", "Emily: 👍": "", "Description": "When independent school leaders—at every level and role—come together, we are at our best.\n \nJoin us at the 2019 NAIS Annual Conference, February 27–March 1, in Long Beach, California, to think more creatively, strategically, and collaboratively through the lens of a changing world and education landscape.\n \nWe’re reimagining our schools—physically and culturally—as we prepare for a new generation of different types of learners. We’re working harder to make our schools more diverse and inclusive, and we’re better connecting with millennial parents. Our schools are rethinking governance and strategy, and new financial and tuition models are being unveiled. The opportunities continue to support innovation and positive change.\n\nYou won’t want to miss exploring the connections that will surprise and delight across different formats. From visionary speakers to workshops that stretch your way of thinking, you’ll find inspiration at every step while networking with the interesting and impactful people who make up the independent school community. That’s the magic of the NAIS Annual Conference."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Election of 1932: FDR vs. Hoover – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-election-of-1932-fdr-vs-hoover-great-american-debates/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, March 2, 2019", "Emily: 👍": "", "Description": "In what seemed like the depths of economic and social depression, the incumbent president and his challenger not only debated the causes of the country’s problems and proposed various solutions, they also debated about the very nature of government in America, what it should and should not do, and how it should relate to its citizens and the states.\n\nScholars\nChristopher Burkett, Ashland University"},
{"Category": "STEM, Technology", "End Date": "Tuesday, March 5, 2019", "Name": "BrainStorm Educational Technology Conference", "Graduate Credit": "", "URL": "https://brainstormk20.com/wisconsindells/", "Location": "Wisconsin Dells, WI", "Organization": "Midwest Educational Technology Association (META)", "Start Date": "Sunday, March 3, 2019", "Emily: 👍": "", "Description": "The goal of the BrainStorm Conference is for K20 techs to network with their counterparts and connect with technology vendors who cater to the K20 community."},
{"Category": "Arts, Diversity/Equity/Inclusion, STEM, Technology, Pedagogy, Leadership, Innovation", "End Date": "Thursday, March 7, 2019", "Name": "SXSWedu", "Graduate Credit": "", "URL": "http://sxswedu.com/program", "Location": "Austin, TX", "Organization": "SXSW", "Start Date": "Monday, March 4, 2019", "Emily: 👍": "", "Description": "SXSWedu showcases four days of compelling sessions, in-depth workshops, engaging learning experiences, mentorship, film screenings, startup events, policy-centered discussions, business opportunities, networking and so much more!\n\nThe program is a combination of various elements, each designed to create a powerful and unique experience for your time at the event. Whether you are seeking skill development, a new perspective or opportunities to expand your professional network, there’s sure to be something at SXSWedu to support your goals."},
{"Category": "Technology, STEM, Leadership", "End Date": "", "Name": "MassCue and MASCD Leadership Conference: Lead Like A Pirate", "Graduate Credit": "", "URL": "http://www.masscue.org/event/spring-conference-2019/", "Location": "Worcester, MA", "Organization": "Massachusetts Computer Using Educators (MassCUE) & the Massachusetts affiliate of ASCD (MASCD)", "Start Date": "Tuesday, March 5, 2019", "Emily: 👍": "", "Description": "MassCUE (Massachusetts Computer Using Educators) and MASCD (the Massachusetts affiliate of ASCD) have joined forces to bring together classroom and educational leaders for a one-day event of powerful presentations, workshops, hands-on sessions, and informal gatherings to address the critical issues of education. Both organizations believe in the importance of excellent leadership skills for teachers and administrators."},
{"Category": "Leadership, School Design", "End Date": "Friday, March 8, 2019", "Name": "Scaling For Impact: Strategies to Enhance and Expand What Works in Education", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/scaling-impact-strategies-enhance-and-expand-what-works-education", "Location": "Cambridge, MA", "Organization": "Harvard University: Graduate School of Education, PreK-12 Professional Education Programs", "Start Date": "Wednesday, March 6, 2019", "Emily: 👍": "", "Description": "Overview\nSome of the most significant innovations in education over the past 20 years have come from visionary entrepreneurs, but while the field is dotted with small successes, there are few examples of long-standing, widespread implementation. Too often, promising products and services never become available at scale.\n\nScaling For Impact is designed for nonprofit education organizations that are ready to expand and extend their impact. Participants will explore barriers to growth, including increased demands on leadership teams, difficulties in accessing funds, and threats to quality and sustainability. They will look at the pros and cons of different paths to scale, such as brick-and-mortar versus online options, replication versus adaptation, collective impact models, and more. The program provides a rare opportunity for education entrepreneurs to connect with each other as they share successes and challenges and build a network for ongoing support.\n\nProgram Details\nThis three-day program is designed for education entrepreneurs with a proven program, product, or service. Harvard faculty will introduce different approaches to achieving impact at scale, drawing on case studies and experts from the field to illustrate successful scaling strategies. You will explore opportunities for assessing impact, organizing to execute, and sustaining a culture of success.\n\nTeams selected to participate will be expected to identify a problem of practice that they intend to work on during the program. Your team will have dedicated time to work with an experienced facilitator as you define your theory of social impact and develop an action plan that applies what you have learned to the practical challenges facing your organization.\n\nObjectives\nExplore effective strategies and leadership skills for scaling for impact and acquire tools and frameworks to help you determine if and how you will scale\nUnderstand the tensions and trade-offs associated with various scaling decisions\nLearn lessons from the field, including tripwires to avoid and opportunities to seize\nRefine your own theory of social impact and apply research and best practices to diagnose your scaling challenges\nDevelop specific next steps and clarify respective roles in this work\nBuild useful professional connections\n"},
{"Category": "Arts", "End Date": "Saturday, March 16, 2019", "Name": "NAEA National Convention\n", "Graduate Credit": "", "URL": "https://www.arteducators.org/events/national-convention", "Location": "Boston, MA", "Organization": "National Art Education Association", "Start Date": "Thursday, March 14, 2019", "Emily: 👍": "", "Description": "The NAEA National Convention is the largest gathering of visual arts educators in the world!\n\nThe NAEA National Convention is an annual event providing substantive professional development services that include the advancement of knowledge in all sessions, events, and activities for the purpose of improving visual arts instruction in American schools. As such, it is the world’s largest art education convention.\n\nThe three-day convention includes over 1,000 participatory workshops, panels, seminars for job-alike groups…research reports, discussions, exhibits, and tours…keynote addresses by world-acclaimed educators, artists, researchers, and scholars…with the opportunity to connect with your colleagues from all over the world. Each year, some 110-200 exhibitor booths displaying the latest art textbooks, high-tech software, prints, slides, curriculum materials, equipment, and programs, as well as the latest studio and art history media are made available for examination and review by art educator delegates.\n\nIt is a professional development opportunity to update oneself on the vista of state-of-the-art materials to advance visual art instruction in local art programs. All sessions and events are 100 percent content-oriented and substantively based. "},
{"Category": "Pedagogy, Leadership, Diversity/Equity/Inclusion, Global Studies, Counseling", "End Date": "Monday, March 18, 2019", "Name": "ASCD Empower19", "Graduate Credit": "", "URL": "http://empower.ascd.org/Default.aspx", "Location": "Chicago, IL", "Organization": "Association for Supervision and Curriculum Development (ASCD)", "Start Date": "Saturday, March 16, 2019", "Emily: 👍": "", "Description": "This year, we invite you to join us in the Windy City and challenge you to explore new perspectives in education. Educators from around the world will embark on this transformational event. Get the pieces you need and SYNTHESIZE the learning in your classrooms, districts, and communities. Come equipped to learn, share knowledge, and gain tools to lead students into the future. Are you ready?"},
{"Category": "STEM, Technology", "End Date": "Friday, March 22, 2019", "Name": "Society for Information Technology and Teacher Education (SITE) Conference", "Graduate Credit": "", "URL": "http://site.aace.org/conf/", "Location": "Las Vegas, NV", "Organization": "Society for Information Technology and Teacher Education (SITE)", "Start Date": "Monday, March 18, 2019", "Emily: 👍": "", "Description": "SITE 2019 in Las Vegas, Nevada, is the 30th annual conference of the Society for Information Technology and Teacher Education. This society represents individual teacher educators and affiliated organizations of teacher educators in all disciplines, who are interested in the creation and dissemination of knowledge about the use of information technology in teacher education and faculty/staff development.\n\nSITE is a society of the Association for the Advancement of Computing in Education (AACE)."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Fourteen Points – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-fourteen-points-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, March 20, 2019", "Emily: 👍": "", "Description": "Focus Document\n“Fourteen Points” Message, Woodrow Wilson, 1918\n\nComplementary Documents\nFederalist 6, Alexander Hamilton, 1787\nThe Senate and the League of Nations, Congressional Record, 1919\n\nScholars\nDr. John Moser, Ashland University\nDr. Jennifer Keene, Chapman University\nDr. David Krugler, University of Wisconsin – Platteville"},
{"Category": "STEM, Technology", "End Date": "Friday, March 22, 2019", "Name": "MACUL Conference", "Graduate Credit": "", "URL": "https://maculconference.org/", "Location": "Grand Rapids, MI", "Organization": "Michigan Association for Computer Users in Learning", "Start Date": "Wednesday, March 20, 2019", "Emily: 👍": "", "Description": "The annual Michigan Association for Computer Users in Learning (MACUL) Conference is March 20-22, 2019 at the Cobo Center in Detroit, MI.\n\nIt is one of the Midwest’s largest educational technology conferences with 5000+ educators from across Michigan, the region, and Canada.\n\nThe first day offers in-depth, focused workshops with the following two days of conference featuring 300+ sessions. \n\nThe MACUL conference gives attendees an opportunity to explore new tools, discover the latest trends, gain valuable resources and network with like-minded educators."},
{"Category": "Leadership, Innovation, School Design, Humanities, History", "End Date": "Thursday, March 21, 2019", "Name": "DESIGN STUDIO: Designing for Student Civic Engagement", "Graduate Credit": "", "URL": "http://www.leadershipanddesign.org/design-studio-designing-for-student-civic-engagement.html", "Location": "Washington, DC", "Organization": "Leadership + Design", "Start Date": "Wednesday, March 20, 2019", "Emily: 👍": "", "Description": "When was the last time you had a chance to put students and their teachers alongside one another as learners, co-designers, and change agents?\n\nWe are living through an exciting moment of increased student civic engagement, as groups of youth have begun to raise their voices in service of causes that are important to them.  That engagement takes many forms, ranging from organizing protests to developing local partnerships in order to make change in their communities. Young people are searching for more authentic opportunities to get involved, beyond the obligatory community service hours or service learning programs that many schools require of their students.  As teaching and learning evolves to emphasize real-world, impact-driven projects, schools and colleges are searching for ways to engage students in the community in authentic and meaningful ways.  While a good deal of recent activity has been student-led, student civic engagement can be particularly powerful when it is guided by a caring and committed adult or sponsor who can serve as a coach. \n\nWe are partnering with Episcopal High School in Washington D.C. to offer Designing for Student Civic Engagement, a two-day workshop for the adult and student leaders (high school or college-aged) who are working to make change in some capacity, and who would like to learn and practice some skills and frameworks to help guide and organize their work, both with each other and in the community.  Meant for teams made up of 1-2 school leaders who work directly with student leaders AND 2-3 of those student leaders with whom they work, Designing for Student Civic Engagement will provide a boost of effectiveness and purpose as we explore the habits, mindsets, and tools of Design Thinking, particularly as they apply to civic engagement and social change.  Participants will practice strategies for conducting empathy-based research, defining the problem they are hoping to solve, and will learn to collaborate to develop creative solutions alongside members of their community. We’ll also dig into the interpersonal side of civic engagement: what do we do when we experience conflict? How can we better work together as a team?  Teams will return to their school with a new set of tools they can immediately apply in their civic engagement work.\n\nUsing Busboys and Poets as inspirational space and our home base, teams will take a deep dive into a real-world design challenge posed by a community partner, challenging them to dive into the U Street Corridor neighborhood of D.C.  Our design challenge will give student leaders (and those coaching them) a chance to learn and practice some strategies for making connections in a local community, uncovering real human needs, and learning to design solutions with rather than for others.  During our time together, we'll also include opportunities for student and adult/sponsor participants to reflect and discuss the work separately from one another, as students learn to take leadership and sponsors learn to serve as a guide on the side.\n"},
{"Category": "Leadership, Library", "End Date": "Saturday, March 23, 2019", "Name": "Library Leadership in a Digital Age", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/library-leadership-digital-age", "Location": "Cambridge, MA", "Organization": "Harvard University: Graduate School of Education, PreK-12 Professional Education Programs", "Start Date": "Thursday, March 21, 2019", "Emily: 👍": "", "Description": "Gain insight and practical knowledge to reimagine the role of your library in a time of rapid technological change.\n\nOverview\nTechnology and new learning modalities are fundamentally redefining how individuals access information and, thus, the role of the library. Library leaders must stay a step ahead of this change, asking: What will learning look like in the next decade? What support will community members need to access quality information, and what role can libraries play as digital media take on a larger role in society?\n\nLibrary Leadership in a Digital Age offers library leaders a chance to reimagine their work in the context of a changing information landscape. Participants will gather with policymakers and experts to examine how new technologies are redefining learning and to develop practical strategies for leading libraries during this uncertain and dynamic time.\n\nProgram Details\nDuring this three-day program, you will explore the changes occurring in the field of knowledge management and consider the implications for libraries and library leadership. In interactive presentations, panel question-and-answer sessions, and small group discussions, you will dive into big questions, such as: Is tomorrow’s library a physical place, a set of information services, or something else? How can libraries become the architects and shepherds of intellectual communities? You will also have opportunities to share insights and practical ideas with your peers and time to set goals for how you will adapt to and embrace the opportunities ahead.\n\nObjectives\nUnderstand the role of libraries in the digital age\nBecome a more effective library leader in a rapidly changing institutional context\nConsider the strengths and weaknesses, opportunities and limitations, and promises and pitfalls of new digital media, resources, and opportunities\nExamine new design and delivery options for library resources and services"},
{"Category": "Humanities, History", "End Date": "Sunday, March 24, 2019", "Name": "Liberty and the Declaration of Independence", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/libertyfund/", "Location": "Philadelphia, PA", "Organization": "Ashbrook Center at Ashland University and Liberty Fund", "Start Date": "Friday, March 22, 2019", "Emily: 👍": "X", "Description": ""},
{"Category": "STEM, Technology", "End Date": "Thursday, March 28, 2019", "Name": "Learning Solutions Conference & Expo", "Graduate Credit": "", "URL": "https://www.elearningguild.com/lscon/content/5555/learning-solutions-2019-conference--expo--home", "Location": "Orlando, FL", "Organization": "ELearning Guild", "Start Date": "Tuesday, March 26, 2019", "Emily: 👍": "", "Description": "Learning Solutions Conference & Expo provides real solutions to the learning and development challenges you encounter today. We are expanding the program to deepen your understanding of learning technologies across the globe. Join us March 27 – 29 to connect with your peers, develop practical skills, and gain knowledge that will provide you with new energy and ideas to advance your career."},
{"Category": "Pedagogy, Leadership", "End Date": "Friday, March 29, 2019", "Name": "Deeper Learning: 7th Annual Conference", "Graduate Credit": "", "URL": "https://hthgse.edu/professional-education/institutes/", "Location": "San Diego, CA", "Organization": "High Tech High", "Start Date": "Wednesday, March 27, 2019", "Emily: 👍": "", "Description": "Deeper Learning 2019 is the premier international event for educators pursuing deeper learning in schools. In 2010, the William and Flora Hewlett Foundation convened a group of leaders from some of the leading organizations in deeper learning. The Deeper Learning conference came from this community’s desire to bring the teachers and school leaders from those organizations along with others from across the country to do what the most successful learners do: work together to find inspirational and implementable solutions to authentic problems facing educators today. This conference aims to connect educators who are implementing deeper learning in their schools, generate and better support deeper learning ideas in classrooms and help educators reflect on their own practic"},
{"Category": "STEM, Technology, Science, Math, Leadership", "End Date": "Saturday, March 30, 2019", "Name": "Building Bridges within the STEM Community and Beyond", "Graduate Credit": "", "URL": "https://www.iteea.org/Activities/Conference.aspx", "Location": "Kansas City, MO", "Organization": "International Technology and Engineering Educators Association (ITEEA)", "Start Date": "Wednesday, March 27, 2019", "Emily: 👍": "", "Description": "The annual ITEEA conference provides an unparalleled opportunity for technology and engineering educators to gain comprehensive professional development and networking experiences. ITEEA members pay a reduced rate to attend and can choose from dozens of interest sessions, workshops, and social events. This is a unique opportunity to learn from and share with other technology and engineering STEM education professionals in a variety of formats."},
{"Category": "STEM, Technology", "End Date": "Friday, March 29, 2019", "Name": "Nebraska Educational Technology Association (NETA) Conference", "Graduate Credit": "", "URL": "http://netasite.org/?page_id=4330", "Location": "Omaha, NE", "Organization": "Nebraska Educational Technology Association (NETA)", "Start Date": "Wednesday, March 27, 2019", "Emily: 👍": "", "Description": "Over 200+ featured, breakout, and interactive educational technology sessions from which to choose on Thursday and Friday\nNumerous hands-on workshops designed to give you a more in-depth experience\nNationally recognized Speakers\nAdmittance to an Innovation Lab\nPlaygrounds where YOU can personally experience the Newest Technologies\nOpportunity to meet and interact with Over 100 Exhibitors\nNetworking Opportunities to Expand YOUR Professional Learning Network to Continue Learning Throughout the Year\nYOU will learn about technology in education and how you can implement it directly into your school/classrooms starting NOW!\n\nYOU have the opportunity to share what YOU learn with YOUR staff members- YOU can be the change agent!"},
{"Category": "Humanities, Literature, Arts, Library", "End Date": "Saturday, March 30, 2019", "Name": "Association of Writers & Writing Programs Conference and Bookfair", "Graduate Credit": "", "URL": "https://www.awpwriter.org/awp_conference/overview", "Location": "Portland, OR", "Organization": "Association of Writers & Writing Programs (AWP)", "Start Date": "Wednesday, March 27, 2019", "Emily: 👍": "", "Description": "The AWP Conference & Bookfair is an essential annual destination for writers, teachers, students, editors, and publishers. Each year more than 12,000 attendees join our community for four days of insightful dialogue, networking, and unrivaled access to the organizations and opinion-makers that matter most in contemporary literature. The conference features over 2,000 presenters and 550 readings, panels, and craft lectures. The bookfair hosted over 800 presses, journals, and literary organizations from around the world. AWP’s is now the largest literary conference in North America. Join us in Tampa, FL, in 2018 to celebrate the best of what contemporary literature has to offer."},
{"Category": "Diversity/Equity/Inclusion, Gender Studies, Global Studies, Leadership, Humanities, History, Literature, Counseling", "End Date": "", "Name": "Women's Leadership Conference: The Business of People Empowered by Empathy", "Graduate Credit": "", "URL": "https://www.baypathconference.com/", "Location": "Longmeadow, MA", "Organization": "Bay Path University", "Start Date": "Friday, March 29, 2019", "Emily: 👍": "", "Description": "Over the past 23 years, the WLC has brought some of the world’s most renowned scientists, artists, journalists, activists, and authors to our region in an effort to spark our curiosity for life stories, new subject matter, and new ideas."},
{"Category": "Technology, STEM", "End Date": "Thursday, April 4, 2019", "Name": "COSN 2018 ANNUAL CONFERENCE: DESIGNING LEARNING IN THE 4TH INDUSTRIAL REVOLUTION", "Graduate Credit": "", "URL": "https://cosnconference.org/", "Location": "Portland, OR", "Organization": "Consortium for School Networking", "Start Date": "Monday, April 1, 2019", "Emily: 👍": "", "Description": "About the Event\nToday’s kindergarten class will graduate in 2030 after experiencing a world of rapid technological change. What will the world look like as the class of 2030 leaves our education systems? How do we prepare them now for success in that world? The CoSN 2019 Conference: Envision 2030: Leadership for Learning, will explore how we provide the class of 2030 with the skills they will need for success. We will focus on the role technology leaders play in envisioning, shaping and leading the school system transformation to support student needs. Come and continue the conversations started at CoSN 2018; Exponential Change: Designing Learning in the 4th Industrial Revolution.\n\nWho Should Attend?\nThe CoSN Annual Conference includes 3 plenary sessions, dozens of breakout sessions, additional workshops, and pre- and post- conference events designed to maximize professional development for your entire school district team. Our conference environment enables a personalized and authentic learning environment with an emphasis on peer-to-peer sharing and networking. Content at a CoSN Conference is rooted in this team-oriented approach, so we encourage you to bring your school district team."},
{"Category": "STEM, Math, Research", "End Date": "Saturday, April 6, 2019", "Name": "National Council of Teachers of Mathematics Research Conference", "Graduate Credit": "", "URL": "http://www.nctm.org/annual/", "Location": "San Diego, CA", "Organization": "National Council of Teachers of Mathematics", "Start Date": "Wednesday, April 3, 2019", "Emily: 👍": "", "Description": "Join thousands of your mathematics education peers at the premier math education event of the year! Network and exchange ideas, engage with innovation in the field, and discover new learning practices that will drive student success.\n\nThe latest teaching trends and topics will include:\n\nAssessment: Eliciting and Using Student Thinking \nBuilding on Students’ Strengths: Practices That Challenge, Engage, and Empower \nProfessionalism & Advocacy \nBeyond the Classroom Walls: Empowerment, Access, and Equity \nCreating Inclusive Classrooms: Meeting the Needs of Each and Every Student \nBuilding Mathematical Knowledge for Teaching \nEnhancing Mathematical Thinking through Reading, Writing, Speaking, and Listening \nFor the Love and Joy of Mathematics"},
{"Category": "Leadership, School Design, Technology, Pedagogy, Online Learning", "End Date": "Saturday, April 6, 2019", "Name": "Blended and Personalized Learning Conference", "Graduate Credit": "", "URL": "http://blendedlearningconference.com/", "Location": "Providence, RI", "Organization": "Highlander Institute and Christensen Institute ", "Start Date": "Thursday, April 4, 2019", "Emily: 👍": "", "Description": "From Thursday, April 4 to Saturday, April 6 the Highlander Institute, the Christensen Institute, and the Learning Accelerator will showcase the best classroom, school, and district implementers from across the nation at our 2019 Blended & Personalized Learning Conference in Providence RI.\n\nUnlike many conferences throughout the year, this event is a chance for educators and leaders to discuss blended learning as it exists today on the ground - both in terms of the day-to-day implementation in blended classrooms, and the strategies and systems that have effectively supported replication and scale across schools and districts."},
{"Category": "Leadership, School Design", "End Date": "Friday, April 5, 2019", "Name": "Yale School of Management Education Leadership Conference", "Graduate Credit": "", "URL": "http://yaleeducationconference.com/", "Location": "New Haven, CT", "Organization": "Yale University", "Start Date": "Thursday, April 4, 2019", "Emily: 👍": "", "Description": "From its modest beginnings in 2007, The Yale School of Management Education Leadership Conference has grown to be a nationally recognized forum for education reform. The ELC is an annual two-day conference focused on convening the nation's leaders in education reform. Through panels, networking, conversations, and workshops, our speakers, attendees, presenters, and keynotes create a community that helps build urgency in working toward student success and system-wide progress. \n\nThe ELC is sponsored and run by the Yale School of Management Education Club. The conference is fully planned and managed by students at SOM.\n\nThe Yale School of Management Education Leadership Conference exists to create a forum for leaders in education reform. We seek to create a constructive dialogue about how leadership skills applied to the education sector can be used to solve the most pressing and complex challenges in public education. "},
{"Category": "Humanities, History", "End Date": "Sunday, April 7, 2019", "Name": "Presidents and the Constitution: Thomas Jefferson", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/libertyfund/", "Location": "Charlottesville, VA", "Organization": "Ashbrook Center at Ashland University and Liberty Fund", "Start Date": "Friday, April 5, 2019", "Emily: 👍": "X", "Description": ""},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - MLK vs. Malcolm X – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-mlk-vs-malcolm-x-great-american-debates/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, April 6, 2019", "Emily: 👍": "", "Description": "Dr. Martin Luther King, jr. and Malcolm X were the two most prominent Civil Rights leaders of the 1950s and 60s, who for most of their public lives had two very different views on a way forward regarding race relations in America.\n\n\nScholars\nChristopher Burkett, Ashland University\nPeter Myers, University of Wisconsin Eau-Claire\nLucas Morel, Washington and Lee University"},
{"Category": "Arts, STEM, Technology, Pedagogy, Leadership, Diversity/Equity/Inclusion, Innovation", "End Date": "Wednesday, April 10, 2019", "Name": "ASU + GSV Summit", "Graduate Credit": "", "URL": "http://asugsvsummit.com/", "Location": "San Diego, CA", "Organization": "Arizona State University & Global Silicon Valley", "Start Date": "Monday, April 8, 2019", "Emily: 👍": "", "Description": "Forbes magazine says this is “the can’t miss education innovation event.” The best and brightest minds in business, entrepreneurship, higher education, and education innovation converge for three days to transform the way you think about innovations in learning."},
{"Category": "Leadership, Pedagogy, School Design, Counseling", "End Date": "Wednesday, April 10, 2019", "Name": "Advisory is Essential 101", "Graduate Credit": "", "URL": "http://www.wildwood.org/page.cfm?p=1627#Adv101", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Tuesday, April 9, 2019", "Emily: 👍": "", "Description": "Just starting out? Want a complete program re-design?\n\nChoose this in-depth, 2-day session to create an advisory program that fits your school—public, charter, or private—and leave with a plan to succeed. Participants will: Observe Wildwood middle and high school advisories; analyze current research on advisory and best practices; learn from Wildwood advisors and students; practice advisory and classroom facilitation protocols; generate a plan to implement your program.\n\n"},
{"Category": "STEM, Science", "End Date": "Sunday, April 14, 2019", "Name": "National Science Teachers Association Annual Conference: Sun, Surf & Science", "Graduate Credit": "", "URL": "http://s6.goeshow.com/nsta/national/2019/", "Location": "St. Louis, MO", "Organization": "National Science Teachers Association", "Start Date": "Thursday, April 11, 2019", "Emily: 👍": "", "Description": "National conferences draw 9,000–12,000 attendees and may feature as many as 1,200 sessions and 400 exhibits. Many workshops, courses, featured speakers, exhibitors, presentations, and educational trips!"},
{"Category": "Humanities, History, Global Studies, Diversity/Equity/Inclusion, Gender Studies", "End Date": "Sunday, April 14, 2019", "Name": " From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom", "Graduate Credit": "", "URL": "https://clpp.hampshire.edu/conference/2019-conference", "Location": "Amherst, MA", "Organization": "Civil Liberties and Public Policy (CLPP) and Hampshire College", "Start Date": "Friday, April 12, 2019", "Emily: 👍": "", "Description": "From Abortion Rights to Social Justice: Building the Movement for Reproductive Freedom is the conference where CLPP invites people who are completely new to reproductive and social justice to learn alongside those who have shaped, shaken up, and laid new ground for our movements for years. We are students, activists, researchers, scholars, advocates, and justice-seekers. We come together. We vision. We share our successes and challenges. We hold each other accountable. We share our experiences. \n \nWith lifelong activists, newly inspired justice-seekers, veteran CLPP conference goers, and first-timers, the conference home that we are creating is approaching its 40th year. We celebrate our strength because we survive and share our resources so that we continue to thrive.  We come together to share power and build new skills. We come together to build the movement for reproductive freedom. We come home.\n \nOur communities are strong and resilient. The reproductive justice movement was birthed by women of color who said, We can’t experience our power without abortion, without support for our families, without celebrating our choices to parent or not to parent, and without justice. At the annual CLPP conference, we join together to celebrate this strong legacy of justice-making and to build our movements.\n \nAt the conference, we strive to create a space where those at the frontlines of our struggles for justice are centered and our lived experiences are valued. Our vision is to create a home for the visible leadership of those most impacted by reproductive injustices: women of color, trans women, LGBTQ people, those who have been incarcerated, poor and working class people, youth, students, people with disabilities, immigrants, indigenous people, and others who are most acutely affected by reproductive, environmental, and social injustices. \n \nWe come together to listen and learn, to hold space to respond to the traumas inflicted upon our communities. We know that coming home is not always comfortable. We interrogate our discomfort. We expand our conversations about race and racism—about white supremacy—affirming that Black Lives Matter is central to achieving reproductive justice. \n \nWe know that coming home is hard work. At the CLPP conference, we center our desires for justice, and we hold back the tide. We vision for ourselves, our communities, our environments, and our society. \n \nWe celebrate the ways that we are creating the world that we want to live in. We tell our stories of abortions that we wanted, that we didn’t want, that we had to fight for, and that we could not live without. We celebrate our creations—our art, our stories, our families, our communities. We tell stories of the children and families we have had to fight to create. We celebrate through story, and we envision a world where each of us experiences power, pleasure, and autonomy.\n \nCome home to the CLPP conference to be inspired. Come to the conference to recalibrate for action. Come to celebrate the beauty and resilience of our movements. Reconnect with old friends, meet new strategic partners and mentors. Come create space with your communities and with new communities—to build a vision centering diverse histories, identities, experiences and narratives. We don’t all come to the CLPP conference as leaders, but we all take back new stories and skills to empower our communities.  \n \nWe hope you will share both your experiences and your desire to learn with us on April 7-9, 2017. Join us to find out how your work, your communities, and the issues you care about are part of the movement we are building for reproductive freedom."},
{"Category": "Technology, STEM", "End Date": "Wednesday, April 17, 2019", "Name": "ATLIS Annual Conference", "Graduate Credit": "", "URL": "http://www.theatlis.org/", "Location": "Dallas, TX", "Organization": "Association of Technology Leaders in Independent Schools (ATLIS)", "Start Date": "Sunday, April 14, 2019", "Emily: 👍": "", "Description": "The Association of Technology Leaders in Independent Schools will hold its annual gathering of IT and Edtech independent school leaders on April 14-17, 2019, in Dallas, TX. Our conference theme is \"Deep in the Heart of TECHness.\" This convergence of independent school technology professionals is the only conference focused solely on the independent school technology community. One attendee at the past conference called it “the most relevant, most important conference I attend all year.” \n\n"},
{"Category": "Leadership", "End Date": "Tuesday, April 16, 2019", "Name": "Leadership Retreat", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "New Orleans, LA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Monday, April 15, 2019", "Emily: 👍": "", "Description": "Different from the whirlwind of conference breakout sessions, this boutique program offers administrative leaders time to focus on personal growth, leadership abilities, and relationship development surrounded by colleagues who face similar hurdles and aspire to reach common goals. Whether a new administrator or a seasoned veteran, this retreat provides an opportunity to step back from day-to-day demands and focus on cultivating individual strengths and leadership skills."},
{"Category": "Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "DESIGN STUDIO:  EQUITY AND INCLUSION", "Graduate Credit": "", "URL": "http://www.leadershipanddesign.org/design-studio-equity-and-inclusion-action-lab.html", "Location": "Seattle, WA", "Organization": "Leadership + Design", "Start Date": "Friday, April 19, 2019", "Emily: 👍": "", "Description": "This one-day event in Seattle, WA will focus on putting the work of equity and inclusion into action.   Put simply, there is no higher purpose than making our schools safe, inclusive and equitable for all students, teachers, staff, parents and administrators.    Often the debate surrounding this topic has taken center-stage in our schools or community at the expense of actually changing our communities for the better.  Whether you are looking to design something concrete like a program, process or protocol or something big like a culture, vision or purpose, this one-day studio will help you get going.   This Action-Lab environment is designed for teams ready to put their ideas into practice, and each participant or team will leave with an idea ready to be implemented at the end of the day.   Bring a team and build a big idea or come alone and build a spark to be ignited back in your community.\n\nUsing a Design-Thinking process, teams and/or individuals will collaborate to build out ideas, prototype them, and test and apply feedback.  By the end of the day, participants will have a roadmap for next steps, and they will have a group of collaborators ready to help them.  Examples of problems that might be designed around at this event are:    \nHow might we engage our community around the topic of white privilege and what impact it is having on the culture of the school? \nHow might we build an event that engages our parents and faculty in a discussion about race, power and privilege?\nHow might we re-design how we hire so as to attract a diverse set of candidates for our faculty, staff and administrative positions?\nHow might we change our curriculum to be inclusive of the community it is serving? \nHow might we build a culture of risk and trust, so that as future issues of race, inclusion and equity surface, they are not seen as \"hot topics\" but rather vital to the health of the organization?\nHow might we build activities, content and experiences into our advisory program to foster a more equitable and inclusive culture?     \n"},
{"Category": "Religion, Leadership", "End Date": "Thursday, April 25, 2019", "Name": "National Catholic Educational Association (NCEA) Conference", "Graduate Credit": "", "URL": "https://www.ncea.org/NCEA/Learn/Events/Event_Display.aspx?EventKey=NCEA%202019&WebsiteKey=60819b28-9432-4c46-a76a-a2e20ac11cfd", "Location": "Chicago, IL", "Organization": "National Catholic Educational Association (NCEA) ", "Start Date": "Tuesday, April 23, 2019", "Emily: 👍": "", "Description": "Catholic and faith-based K-16 ed leadership development. \n\nThe NCEA Convention & Expo is the largest private education association gathering in the world. Those participating represent all aspects of Catholic school and faith-based education. The Convention is a time to celebrate, to acquire new knowledge, and to renew your spirit."},
{"Category": "Leadership, Pedagogy, School Design, Counseling", "End Date": "", "Name": "Advisory is Essential 201", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Adv201", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Tuesday, April 23, 2019", "Emily: 👍": "", "Description": "Already have a program in place that needs a tune-up?\n\nOur advanced, 1-day session provides strategies to strengthen and sustain your existing advisory program, as well as to hone your facilitation skills. Participants will:\n\nObserve Wildwood advisories\n\nFocus on applying current Advisory research and best practices\n\nApply Advisory and classroom facilitation protocols to strengthen their existing programs"},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - 1944 State of the Union – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-1944-state-of-the-union-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, April 24, 2019", "Emily: 👍": "", "Description": "Focus Document\n1944 State of the Union Address, Franklin D. Roosevelt, 1944\n\nComplementary Documents\nFirst Inaugural Address, FDR, 1933\nSecond Inaugural Address, FDR, 1937\n\nScholars\nDr. John Moser, Ashland University\nDr. Eric Pullin, Carthage College\nDr. Alonzo Hamby, Professor Emeritus, Ohio University"},
{"Category": "Counseling, Literature, Humanities, Writing", "End Date": "", "Name": "Bard Institute for Writing and Teaching Annual Conference", "Graduate Credit": "", "URL": "http://writingandthinking.org/programs/april/", "Location": "Annandale-on-Hudson, NY", "Organization": "The Bard College Institute for Writing & Thinking", "Start Date": "Friday, April 26, 2019", "Emily: 👍": "", "Description": "Why Write? Reimagining High School and College Essays\n“Every essay …creates a working ethos of attempting – to the utmost – the improbable.”   \nJoan Retallack\n\nEssay writing is often a struggle for many students, with the transition from high school to college-level expectations proving to be one of the most academically challenging shifts. Expectations for high school papers – whether the five-paragraph “theme” or the three-point AP model – do not, typically, meet traditional standards for college writing.  Questions of audience, various styles of argumentation, the uses of evidence – and even such basic requirements as a thesis rather than a topic sentence or disciplinary-specific citation-styles – can radically diverge from what students have been accustomed to in grades 8-12.  How can high school teachers, who often feel as if they are “straddling the line” between providing the basics of reading comprehension and preparing students for the more complex thinking required by college courses – help bridge these gaps? \n\nThis year’s annual conference provides teachers and professors with an opportunity to reconsider how the modes of writing that students learn in high school can be utilized in college. In Habits of the Creative Mind (2016), Ann Jurecic and Richard E. Miller propose that “the best writing is curiosity driven and is carried forward by creative acts of connective thinking.” This kind of writing stands in direct contrast to the more typical “recipe-based approach” that results in formulaic prose. How do we encourage students of all levels to see “writing as an act of thinking”?\n\nAs Paul Connolly, IWT’s founding director, said in an interview in 1983, “most students seem to be going through the motion of writing. They're not attached to it. Their writing tends to be perfunctory and it tends to be thoughtless.\" How do we encourage imaginative thinking and the valuing of the writing process, while also fulfilling the demands of standardized testing and state standards? How might writing-based practices for deepening critical analysis better prepare high school students for college? What classroom practices can address such specific needs as, how do we engage students as readers and writers while asking them to conform to the particular demands of form, style, and content?  \n\nThis year’s conference will address these questions from theoretical and practical standpoints.  Together, we will write to explore how the essay is approached in both high school and college; with particular attention to the “high school essay” that is part of the college application process. We will look to IWT’s signature writing-based teaching practices for new ways to use informal and formal writing to foster community, help students respond productively to intellectual challenges, and smooth the transition from one set of skills to another – with a minimum anxiety. Finally, we hope this conference day will offer us the chance to be both teachers and writers, remembering the creativity and curiosity that writing provokes.\n "},
{"Category": "Diversity/Equity/Inclusion, Leadership, Student Life, Counseling, Human Resources, Global Studies, Humanities", "End Date": "Tuesday, April 30, 2019", "Name": "TABS-NAIS Global Symposium", "Graduate Credit": "", "URL": "http://www.global-symposium.org/ ", "Location": "Newport, RI", "Organization": "National Association of Independent Schools (NAIS) and The Association of Boarding Schools (TABS)", "Start Date": "Sunday, April 28, 2019", "Emily: 👍": "", "Description": "As boarding and day schools have internationalized, teachers and administrators have encountered new complexities in nearly every aspect of schooling— from admission, parent communications, and classroom pedagogy, to college advising, constituency relations, and development. At the same time, a pioneering spirit has taken hold in a number of schools, with many educators seeking to enlarge the vision of \"preparatory\" schools to include preparation for global citizenship in a world increasingly interconnected economically, environmentally, culturally, and politically.\n\nThe Global Symposium will bring together school leaders, educators, and experts to learn from each other and to explore current practice and promising ways forward."},
{"Category": "STEM, Technology", "End Date": "Friday, May 3, 2019", "Name": "Connect: Canada's Learning & Technology Conference", "Graduate Credit": "", "URL": "http://www.canconnected.com/", "Location": "Niagara Falls, Ontario, Canada", "Organization": "Connect", "Start Date": "Tuesday, April 30, 2019", "Emily: 👍": "", "Description": "CONNECT is Canada’s largest education technology conference. We have attracted over 2000 participants, plus countless Exhibitors and Sponsors that came together under one roof to share best practices and expand our horizons of education technology in an ever increasing global and digital economy.\n\nThis community of passionate educators, leaders, chief information officers, directors of education, IT experts, business managers and government sector institutions are committed to gathering once a year to learn, debate and exchange ideas, network and be inspired through a smorgasbord of world class speakers, presenters, exhibits and seminars. It is the only event in Canada that brings together the complete life-cycle of learning, from kindergarten to Higher Education, libraries and workplace learning.\n\nOur mission is to connect all sectors in order to help raise the standards of 21st century teaching, training and learning in education."},
{"Category": "Pedagogy", "End Date": "", "Name": "The Swiss Army Teacher: Versatile Facilitation With Protocols", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Facilitators16", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Thursday, May 2, 2019", "Emily: 👍": "", "Description": "Want some new tools for your classroom practice?\nVersatility is the theme of this hands-on workshop. Participants will practice and reflect upon a variety of multi-use protocols to help them meaningfully facilitate student learning. Whether your goal is to increase student engagement, implement Common Core State Standards, or simply enliven your craft, you'll leave with new skills, ready to use in class the next day. Practice protocols to help facilitate your students' abilities to:\n\n\"Mine\" texts for deeper meaning\n\nMore respectfully converse with each other\n\nAsk good questions\n\nGenerate strong ideas\n\nThoughtfully reflect on their learning\n\nIdentify and build upon successes\n\nFor Grades 6-12"},
{"Category": "Counseling, Health, Pedagogy", "End Date": "Sunday, May 5, 2019", "Name": "Schooling Social Minds: Using Brain/Social Science to Teach Social Skills, Social Thinking, and Learning in the Digital Age", "Graduate Credit": "", "URL": "https://www.learningandthebrain.com/Event-381/Schooling-Social-Minds/", "Location": "New York, NY", "Organization": "Learning & The Brain", "Start Date": "Friday, May 3, 2019", "Emily: 👍": "", "Description": "RAISE SOCIAL SKILLS AND OVERCOME SOCIAL ANXIETY IN A SOCIAL MEDIA AGE\nChildren and teens today are spending more time texting, playing video games, and on social media than ever before. NYU Psychology Professor Adam Alter and others have discovered that today's school children between the ages 8-18 now spend a third of their lives on social media, leading to rising rates of depression, media addiction, social isolation, and reduced social skills. Additionally, brain and social psychologists have found that the brain is wired for learning through social interaction and social thinking, and that those with social anxiety, autism and the socially awkward are being left behind. Discover the \"Science of Social Minds\" and why our brains are wired for physical connections, ways to improve social skills and friendships, overcome social anxiety and media addiction; and how to teach to and appreciate those who are socially different."},
{"Category": "Humanities, Literature, Writing, Arts", "End Date": "Sunday, May 5, 2019", "Name": "Mass Poetry Festival", "Graduate Credit": "", "URL": "http://www.masspoetry.org/aboutthefestival/", "Location": "Salem, MA", "Organization": "Mass Poetry", "Start Date": "Friday, May 3, 2019", "Emily: 👍": "", "Description": "During the first weekend of May, Salem becomes the epicenter of contemporary American poetry, offering rare opportunities to hear the nation’s best poets read and discuss their work in intimate and engaging forums.\n\nThe Massachusetts Poetry Festival showcases nearly 100 poetry readings and workshops, a small press and literary fair, panels, poetry slams, visual arts, and open-air performances. Panel topics range broadly from the state of poetry, poetry and gender, book publishing, and modernism in contemporary art, to the Common Threads Reading, where contemporary poets with Massachusetts ties discuss their literary connections. More than 150 local and nationally known poets engage with thousands of New Englanders each year.\n\nMass Poetry supports poets and poetry in Massachusetts. We help to broaden the audience of poetry readers, bring poetry to readers of all ages and transform people’s lives through inspiring verse.\n"},
{"Category": "Language", "End Date": "Saturday, May 11, 2019", "Name": "The National Chinese Language Conference (NCLC)", "Graduate Credit": "", "URL": "http://asiasociety.org/national-chinese-language-conference", "Location": "San Diego, CA", "Organization": "Asia Society & The College Board", "Start Date": "Thursday, May 9, 2019", "Emily: 👍": "", "Description": "The National Chinese Language Conference (NCLC) provides a high–profile platform for sharing new ideas and best practices in the fields of Chinese language teaching and learning, Chinese arts and culture, and U.S.–China educational exchange. The tenth annual NCLC is organized by Asia Society and the College Board and will be held in Houston, TX, April 6-8, 2017. The conference will focus on:\n\nbuilding and sustaining quality Chinese programs at all levels of K–12 and higher education;\ncutting-edge approaches to teaching that incorporate culture, technology and collaborations; and\nbest practices in the classroom leading to high levels of language proficiency and cultural competency."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - The Great Society vs. Modern Conservatism – Great American Debates", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-the-great-society-vs-modern-conservatism-great-american-debates/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Saturday, May 11, 2019", "Emily: 👍": "", "Description": "Lyndon Johnson’s ‘Great Society’ package of programs, seen by many as a logical extension of New Deal and Progressive policies, shaped a great deal of the late 20th Century domestic political landscape in America. It also could be said to have given birth to its opposition, in the form of modern American conservatism.\n\nScholars\nChristopher Burkett, Ashland University"},
{"Category": "Leadership, Pedagogy, School Design, Diversity/Equity/Inclusion, Counseling", "End Date": "Thursday, May 16, 2019", "Name": "Race, Equity, and Leadership in Schools", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/race-equity-and-leadership-schools", "Location": "Cambridge, MA", "Organization": "Harvard Graduate School of Education", "Start Date": "Monday, May 13, 2019", "Emily: 👍": "", "Description": "Develop the skills and historical understanding to lead courageous conversations about race, power, and equity in your school community.\n\n“Without courage we cannot practice any other virtue with consistency. We can’t be kind, true, merciful, generous, or honest.” ― Maya Angelou\n\nOverview\nLeading inclusive schools, where all students are afforded opportunities to achieve, requires an understanding of the intersections of race, power, and privilege and calls for leaders who have the courage and capacity to engage in thoughtful conversation and action in their school communities.\n\nRace, Equity, and Leadership in Schools, a program of The Principals’ Center, offers an historical and cultural context for understanding how inequality plays out in schools and provides educators with the skills and confidence to lead more excellent, equitable schools. Participants will learn to recognize structures that perpetuate inequality, address assumptions about how people learn, and create opportunities for more children to succeed.\n\nProgram Details\nIn this four-day institute, you will gather with educators from across the country to explore the role of racism in creating and sustaining educational inequity. You will investigate the importance of personal and group accountability in addressing inequity, and practices for increasing community engagement and promoting open dialogue. You will return home ready to implement concrete strategies for building a more inclusive school community where all children can achieve at high levels."},
{"Category": "History, Humanities", "End Date": "", "Name": "Teaching American History: Online Webinars - Great Society Speech – Documents in Detail", "Graduate Credit": "", "URL": "http://teachingamericanhistory.org/event/webinar-great-society-speech-documents-in-detail/", "Location": "Online", "Organization": "Ashbrook Center at Ashland University", "Start Date": "Wednesday, May 15, 2019", "Emily: 👍": "", "Description": "Focus Document\n“Great Society” Speech, Lyndon Johnson, 1964\n\nComplementary Documents\nSpecial Message to Congress Proposing a Nationwide War on the Sources of Poverty, Lyndon Johnson, 1964\n“A Time for Choosing,” Ronald Reagan, 1964\n\nScholars\nDr. John Moser, Ashland University\nDr. Greg Schneider, Emporia State University\nDr. Abbylin Sellers, Azusa Pacific University"},
{"Category": "STEM, Technology, Innovation", "End Date": "Monday, May 20, 2019", "Name": "Maker Faire - Bay Area", "Graduate Credit": "", "URL": "http://makerfaire.com/bay-area/", "Location": "San Mateo, CA", "Organization": "Maker Media", "Start Date": "Friday, May 17, 2019", "Emily: 👍": "", "Description": "We call it the Greatest Show (& Tell) on Earth. Maker Faire is part science fair, part county fair, and part something entirely new! As a celebration of the Maker Movement, it’s a family-friendly showcase of invention, creativity, and resourcefulness. Faire gathers together tech enthusiasts, crafters, educators, tinkerers, food artisans, hobbyists, engineers, science clubs, artists, students, and commercial exhibitors. Makers come to show their creations and share their learnings. Attendees flock to Maker Faire to glimpse the future and find the inspiration to become Makers themselves."},
{"Category": "Pedagogy, School Design", "End Date": "", "Name": "Beyond Final Exams: Authentic Year-End Assessments", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Beyond", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Thursday, May 30, 2019", "Emily: 👍": "", "Description": "Want to see authentic capstone assessments in action?\nSee Wildwood students’ end-of-year Gateway and Exhibition Presentations demonstrating their academic and personal growth and take away ideas to implement similar authentic assessments for your students. Participants will:\n\nAttend 8th, 10th, and 12th grade presentations\n\nEngage in Q & A with student presenters\n\nAnalyze the elements and design of Wildwood's capstone projects\n\nIdentify ways to design and implement capstone projects at your school\n\n\nFor Grades 6-12"},
{"Category": "Pedagogy, School Design, STEM, Technology", "End Date": "Friday, May 31, 2019", "Name": "Emerging Learning Design 2019: Generation Emerging", "Graduate Credit": "", "URL": "http://eld.montclair.edu/events/eldc/eldc19/", "Location": "Montclair, NJ", "Organization": "Education Learning Design & Montclair University", "Start Date": "Thursday, May 30, 2019", "Emily: 👍": "", "Description": "The ELD conference is meant to engage individuals in lively discussion whilst offering a welcoming platform in which they can express their ideas on pedagogy. Previous ELD conferences have proved to exceed individuals expectations, but don’t just take our word for it! "},
{"Category": "STEM, Technology", "End Date": "Thursday, June 13, 2019", "Name": "InnEdCO", "Graduate Credit": "", "URL": "http://innedco.org/", "Location": "Keystone, CO", "Organization": "Innovation Education Colorado", "Start Date": "Monday, June 10, 2019", "Emily: 👍": "", "Description": "InnEdCO organizes the premier statewide conference helping teachers integrate technological tools with 21st Century skills, including technology and information literacy standards, into all content areas. InnEdCO is organized and managed by a governing board of nine volunteers. Its major objective is to organize a four-day, hands-on, technology-focused conference each summer that models and promotes the use of technology integration into the classroom. Last year’s conference highlighted 100+ different workshops, featured speaker sessions, and round-tables with more than 170 different presenters and co-presenters, primarily classroom teachers"},
{"Category": "Counseling", "End Date": "Tuesday, June 11, 2019", "Name": "Independent School Counselors Conference", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Atlanta, GA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Monday, June 10, 2019", "Emily: 👍": "", "Description": "Join school counselors from independent schools across the region for this informational and inspirational CEU opportunity. Grow your professional network and make contacts to call on for support throughout the year. Discuss the latest research and learn new ideas to implement at your school. Trending topic presentations and roundtable conversations will offer practical tips, best practices, and proven strategies you can immediately put into practice."},
{"Category": "History, Humanities", "End Date": "Saturday, June 15, 2019", "Name": "George Washington Teacher Institute Summer Residential Programs - Leadership and Legacy: Lessons from George Washington", "Graduate Credit": "", "URL": "http://www.mountvernon.org/education/for-teachers/teaching-institutes-professional-development/residential-programs/summer-residential-programs/", "Location": "Mount Vernon, VA", "Organization": "Mount Vernon Ladies' Association of the Union", "Start Date": "Tuesday, June 11, 2019", "Emily: 👍": "", "Description": "A 5-day immersive professional development designed to support K-12 educators teach about the life, leadership, and legacy of George Washington and the 18th-century world in which he lived. Each program includes these signature elements:\n\nIn-depth content and primary source analysis.\nImmersive 18th-century experiences with historical interpreters and subject matter experts.\nLively debate and engaged collaboration with visiting scholars, fellow participants, and Mount Vernon staff.\nClassroom applicability including technology integration.\nConnections between historical events and contemporary student experiences."},
{"Category": "Leadership", "End Date": "Friday, June 14, 2019", "Name": "Institute for New Heads", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Atlanta, GA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Wednesday, June 12, 2019", "Emily: 👍": "", "Description": "An informative program preparing administrators for a successful transition to new headship. This institute offers an opportunity to build a supportive network and gain valuable leadership skills. Learn from experienced heads as you acquire the tools needed to be an effective leader including: best practices for working with the board, personnel, and parents; developing a strategic plan; issues related to budgeting, finance, and fundraising; and managing the media. "},
{"Category": "Leadership", "End Date": "Friday, June 14, 2019", "Name": "Institute for Strategic Leadership", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Atlanta, GA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Wednesday, June 12, 2019", "Emily: 👍": "", "Description": "Examine the nature of strategic leadership and explore a path for continual growth. Open to heads and administrators. Particularly helpful to those considering headship in the future. Especially useful for leadership teams to attend together. Featuring Keith Evans and David Mahler."},
{"Category": "Leadership, School Design", "End Date": "Saturday, June 22, 2019", "Name": "National Institute for Urban School Leaders", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/national-institute-urban-school-leaders", "Location": "Cambridge, MA", "Organization": "Harvard Graduate School of Education", "Start Date": "Monday, June 17, 2019", "Emily: 👍": "", "Description": "In today's environment of high-stakes accountability and limited resources, urban educators must be able to address urgent challenges on multiple fronts. Urban school leaders are on the front line of this work, and research points to the important role they play in creating the conditions to improve student achievement.\n\nThe National Institute for Urban School Leaders, a program of The Principals’ Center, examines best practices and research-based techniques in urban schools. The program provides an in-depth exploration of the leadership skills needed to set high expectations for all and to accelerate learning across classrooms.\n\nProgram Details\nDuring this six-day institute, you will work with our expert faculty and leaders from across the country to examine successful practices in urban schools, placing those practices within a broader context of race, class, culture, and social justice. You will focus on strategies for improving instruction in diverse environments and for building student and community buy-in. You will return home prepared to transform your school’s learning landscape and generate better outcomes for all students."},
{"Category": "History, Humanities", "End Date": "Saturday, June 22, 2019", "Name": "George Washington Teacher Institute Summer Residential Programs: Slavery in George Washington's World", "Graduate Credit": "", "URL": "http://www.mountvernon.org/education/for-teachers/teaching-institutes-professional-development/residential-programs/summer-residential-programs/", "Location": "Mount Vernon, VA", "Organization": "Mount Vernon Ladies' Association of the Union", "Start Date": "Tuesday, June 18, 2019", "Emily: 👍": "", "Description": "A 5-day immersive professional development designed to support K-12 educators teach about the life, leadership, and legacy of George Washington and the 18th-century world in which he lived. Each program includes these signature elements:\n\nIn-depth content and primary source analysis.\nImmersive 18th-century experiences with historical interpreters and subject matter experts.\nLively debate and engaged collaboration with visiting scholars, fellow participants, and Mount Vernon staff.\nClassroom applicability including technology integration.\nConnections between historical events and contemporary student experiences."},
{"Category": "Pedagogy, School Design, Leadership", "End Date": "Thursday, June 20, 2019", "Name": "Project Based Learning (PBL) World", "Graduate Credit": "", "URL": "http://www.pblworld.org/events/pbl-world-2018/event-summary-de6b1584040f4956a4bb587a2900a89e.aspx", "Location": "Napa Valley, CA", "Organization": "Buck Institute for Education", "Start Date": "Tuesday, June 18, 2019", "Emily: 👍": "", "Description": "The Premier Project Based Learning Conference\n \nPBL World is the premier conference for Project Based Learning. Each year, we bring together dedicated K-12 teachers, instructional coaches, and school and district leaders who want to connect with each other and learn more about PBL. \nPBL World is not like other conferences that have a variety of short sessions by many different presenters—it's an institute, where participants go through a continuous multi-day experience. \nWe believe PBL transforms students - and PBL World transforms educators!"},
{"Category": "Leadership", "End Date": "Friday, June 21, 2019", "Name": "Dean of Students Symposium", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Clearwater Beach, FL", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Wednesday, June 19, 2019", "Emily: 👍": "", "Description": "Develop a network of peers, discuss best practices on current issues, and gather practical ideas from colleagues. Learn from experienced deans and work with focused groups to share specific challenges and solutions for middle and upper school students."},
{"Category": "Leadership", "End Date": "Friday, June 21, 2019", "Name": "Division Heads Conference", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Clearwater Beach, FL", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Wednesday, June 19, 2019", "Emily: 👍": "", "Description": "Designed for those who lead from the middle, this program offers networking, skill building, and resources for division heads at all grade levels and years of experience. Learn together in small groups, discover new strategies, and celebrate successes around topics such as curriculum, assessment, scheduling, working with faculty, and communicating with parents.  "},
{"Category": "Leadership", "End Date": "Friday, June 21, 2019", "Name": "Administrative Leadership Institute", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Clearwater Beach, FL", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Wednesday, June 19, 2019", "Emily: 👍": "", "Description": "This workshop helps develop your leadership style and expand your management skills. Gain a new perspective on what it means to be a leader in an independent school with practical techniques and real-life solutions. Featuring Rob Evans and Michael Thompson. "},
{"Category": "Pedagogy", "End Date": "Monday, June 24, 2019", "Name": "Institute for New Teachers", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Nashville, TN", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Saturday, June 22, 2019", "Emily: 👍": "", "Description": "This interactive experience will equip new teachers with the skills and understanding to guide and support their early years. Participants will present two sample lessons to a small peer group. Guided by an experienced educator, lessons will be recorded and reviewed in the small group setting. Discussion will focus on strengths and opportunities observed during the lesson. New teachers will learn best practices for lesson development, parent communication, and classroom management. They will address anticipated challenges and difficult conversations through real-life scenarios and role play. "},
{"Category": "Technology, STEM", "End Date": "Wednesday, June 26, 2019", "Name": "ISTE Conference & Expo", "Graduate Credit": "", "URL": "https://conference.iste.org/2019/", "Location": "Philadelphia, PA", "Organization": "International Society for Technology in Education (ISTE)", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "Over 1,000 sessions and 15,000 educators. This is the most comprehensive educational technology conference in the world. For more than three decades, educators and education leaders have gathered at the ISTE conference to engage in hands-on learning, exchange ideas and network with like-minded thinkers seeking to transform learning and teaching.You’re pushing the boundaries of education by harnessing the power of technology to advance learning and teaching. Connect with other innovative educators and take your own skills to the next level by participating in the world’s largest and most comprehensive ed tech meeting of the minds. "},
{"Category": "Math, STEM, Technology", "End Date": "Friday, June 28, 2019", "Name": "Anja S. Greer Conference on Mathematics and Technology", "Graduate Credit": "", "URL": "https://www.exeter.edu/programs-educators/summer-conference-general-information/anja-s-greer-conference-mathematics-and", "Location": "Exeter, NH", "Organization": "Phillips Exeter Academy", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "Join us for the 35th annual conference. The primary emphasis of the conference is mathematics focusing on the impact and applications of technology in the classroom and the role of technology in today's and tomorrow's mathematics curricula.\n\n"},
{"Category": "Science", "End Date": "Friday, June 28, 2019", "Name": "Biology Institute at Exeter", "Graduate Credit": "", "URL": "https://www.exeter.edu/programs-educators/summer-conference-general-information/biology-institute", "Location": "Exeter, NH", "Organization": "Phillips Exeter Academy", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "Join us for the Biology Institute at Exeter! Spend a week immersed in biology and enjoy learning the latest biology teaching techniques in a state-of-the-art science education facility at Phillips Exeter Academy. This one-week conference is geared towards secondary school Biology/Life Science and Environmental Science teachers. The institute includes a week-long course focused on pedagogy in the Biology classroom. Also included are 4 Advanced Biology Technique seminars, two half-day and one all-day field trips."},
{"Category": "Writing, Journalism, Humanities, Literature", "End Date": "Friday, June 28, 2019", "Name": "Columbia Scholastic Press Association Summer Journalism Workshop", "Graduate Credit": "", "URL": "http://cspa.columbia.edu/conventions-and-workshops/summer-journalism-workshop", "Location": "New York, NY", "Organization": "Columbia University", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "Join CSPA in New York City this summer as print and digital secondary school student journalists and advisers descend on their Ivy League campus.\n\nTake part in a learning experience like no other, where you will improve your skills, rethink your publishing strategies and take your media game to the next level - all while in \"the media capital of the world\".\n\nThe Columbia Scholastic Press Association invites print and online staffs to its 37th annual Summer Journalism Workshop, held on the historic campus of Columbia University in the City of New York.\n\nEach student or adviser participant will be required to register for a particular class sequence, focusing on either writing, editing, management or advanced design.\n\nRegistration for this five-day intensive program is limited to 175 participants"},
{"Category": "Literature, Humanities, Global Studies, Writing, Arts, Science, Sustainability", "End Date": "Friday, June 28, 2019", "Name": "Environmental Literature Institute at Exeter", "Graduate Credit": "", "URL": "https://www.exeter.edu/programs-educators/summer-conference-general-information/environmental-literature-institute-exeter", "Location": "Exeter, NH", "Organization": "Phillips Exeter Academy", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "This week-long teacher training institute aims to cultivate a community of educators interested in environmentally-focused teaching and learning. Throughout the week, we will emphasize how the methods and approaches of disciplines in the humanities, including English, Language Arts, Foreign Language Study, History, and Philosophy, can enhance environmental learning. The various workshops, speakers, and events will offer rich ideas for teachers in all disciplines, including the natural and social sciences."},
{"Category": "Diversity/Equity/Inclusion, Humanities, Student Life, Counseling, Leadership", "End Date": "Friday, June 28, 2019", "Name": "Exeter Diversity Institute", "Graduate Credit": "", "URL": "https://www.exeter.edu/programs-educators/summer-conference-general-information/exeter-diversity-institute", "Location": "Exeter, NH", "Organization": "Phillips Exeter Academy", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "Are you struggling with how to engage students in discussions about race, class, gender, sexuality, and other aspects of identity?\n\nHow about privilege, power, inequity and injustice?\n\nAre you looking for materials and strategies that will help you incorporate concepts related to equity, diversity, and inclusion in your classroom or school?\n\nThe Exeter Diversity Institute (EDI) extends the Harkness principles of collaborative, student centered learning, and enables educators to help students learn about themselves as they are learning about others. Additionally, you will learn skills and acquire resources to have engaging dialogues with your students and colleagues; dialogues that offer academically rigorous, and personally challenging, yet potentially transformative experiences."},
{"Category": "Humanities, Literature, History, Pedagogy", "End Date": "Friday, June 28, 2019", "Name": "Exeter Humanities Institute", "Graduate Credit": "", "URL": "https://www.exeter.edu/programs-educators/summer-conference-general-information/exeter-humanities-institute", "Location": "Exeter, NH", "Organization": "Phillips Exeter Academy", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "The Exeter Humanities Institute is a conference primarily for secondary school English and History teachers. It is designed to explore the use of student-centered, discussion-based education that is loosely described as the Harkness pedagogy.\n\nMorning sessions will utilize essays on a common humanities topic to explore issues in leading discussions. Afternoons are spent in focus groups or in the Academy library doing research on teaching materials for participants to use in their home schools.\n\nThe selection of a core topic is intended to provide common content in the humanities as well as a focus for class discussions. The topics are broadly defined to encourage interdisciplinary exchanges."},
{"Category": "Humanities, Literature, Writing, Arts", "End Date": "Friday, June 28, 2019", "Name": "Writers' Workshop at Exeter", "Graduate Credit": "", "URL": "https://www.exeter.edu/programs-educators/summer-conference-general-information/writers-workshop", "Location": "Exeter, NH", "Organization": "Phillips Exeter Academy", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "We all have stories to tell and words to share. What is so often missing is the time and space to do so. The Writers’ Workshop at Exeter seeks to give you that time and space. You will spend a week developing your writing on the very campus that has inspired such writers as John Irving, George Plimpton, Roxane Gay, Ilya Kaminsky, and Paul Yoon. Novice and experienced writers alike will spend a week workshopping their writing, generating new work, attending readings, and discussing literature in a supportive and generous Harkness setting. Working with writers and teachers from around the world, participants gain professional development experience while indulging their own creativity.\n\nThe conference is limited to 26 attendees."},
{"Category": "STEM, Technology, Science, Innovation", "End Date": "Friday, July 12, 2019", "Name": "Wolfram Summer School", "Graduate Credit": "", "URL": "http://education.wolfram.com/summer/?source=nav", "Location": "Waltham, MA", "Organization": "Wolfram Research & Bentley University", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "A unique educational and career opportunity to learn and do projects at the frontiers of science, technology, and innovation. Learn how to apply Wolfram's unique approach to creating ideas and turning them into research, products, and companies."},
{"Category": "Leadership, Pedagogy, School Design", "End Date": "Saturday, June 29, 2019", "Name": "The Principal's Center at Harvard University: Improving Schools: The Art of Leadership", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/improving-schools-art-leadership", "Location": "Cambridge, MA", "Organization": "Harvard University ", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "Expand your repertoire of management skills, explore new ways to accelerate teacher and student learning, and deepen your sense of efficacy as a school leader.\n\nOverview\nLeading successful schools requires an extensive set of technical and adaptive leadership skills, but the often competing demands of the job can make it difficult to find time to reflect, learn, and grow. We’ll help you create that space.\n\nThe second program within The Principals’ Center leadership development series, Improving Schools: The Art of Leadership provides time for early-career school leaders to reflect on their practice, expand their skills, and become more effective leaders of instructional change. A research-based curriculum equips leaders with tools for effective supervision and evaluation, approaches to solving common leadership challenges, and proven strategies for accelerating learning in every classroom.\n\nWho Should Attend\nPrincipals or school leaders with five or fewer years of experience in their roles (including assistant principals, teacher leaders, instructional leaders, and curriculum specialists)\n---\n\nFounded in 1981, The Principals' Center at the Harvard Graduate School of Education provides aspiring and experienced school leaders from across the country and around the world with exemplary professional development to meet personal and professional challenges. The Principals' Center has dedicated itself to the support, development and improvement of school principals and other school leaders who influence the character and quality of a school.\n\nBased on the premise that school leaders significantly influence best practice, The Principals' Center offers a variety of professional development programs designed to strengthen your leadership skills for greater impact.\n\nNo matter where you are from, you will connect with peers who face similar challenges and build a lasting professional network that will help support you throughout your career. Our institutes provide you with the time you need to reflect, refocus and recharge.\n\nYou will leave inspired, with new ideas and frameworks that you can put into practice the day you get back to your school. Enroll today and join our community of learners."},
{"Category": "Leadership, School Design", "End Date": "Saturday, June 29, 2019", "Name": "Improving Schools: The Art of Leadership", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/program/improving-schools-art-leadership", "Location": "Cambridge, MA", "Organization": "Harvard Graduate School of Education", "Start Date": "Sunday, June 23, 2019", "Emily: 👍": "", "Description": "Expand your repertoire of management skills, explore new ways to accelerate teacher and student learning, and deepen your sense of efficacy as a school leader.\n\nOverview\nLeading successful schools requires an extensive set of technical and adaptive leadership skills, but the often competing demands of the job can make it difficult to find time to reflect, learn, and grow. We’ll help you create that space.\n\nThe second program within The Principals’ Center leadership development series, Improving Schools: The Art of Leadership provides time for early-career school leaders to reflect on their practice, expand their skills, and become more effective leaders of instructional change. A research-based curriculum equips leaders with tools for effective supervision and evaluation, approaches to solving common leadership challenges, and proven strategies for accelerating learning in every classroom.\n\nProgram Details\nDuring this six-day institute, you will have an opportunity to step back, evaluate your efforts, explore successful school improvement models, and practice research-based techniques that will make you a more effective manager of innovation and change."},
{"Category": "Leadership, Gender Studies, Diversity/Equity/Inclusion", "End Date": "Thursday, June 27, 2019", "Name": "Wonder Women!", "Graduate Credit": "", "URL": "http://www.leadershipanddesign.org/wonder-women.html", "Location": "Oakland, CA", "Organization": "Leadership + Design", "Start Date": "Monday, June 24, 2019", "Emily: 👍": "", "Description": "Join  Leadership+Design for an experiential learning adventure for fearless women leaders. This is not your typical conference for women leading in schools. This is an opportunity for bold and daring women to come together for four days to build their leadership capacity; foster honest introspection; and practice the habits, mindsets, and skill sets of successful leaders.\n\nThrough spirited conversation and active participation in an experiential learning laboratory, participants will have the unique opportunity to deepen their understanding of their own signature leadership presence and how they can lead with their authentic voice and style.  They'll also have an opportunity to work collaboratively on a real-world design challenge to help move the needle on equity in school leadership.\n\nExpect to be challenged.  Expect to be pushed.  Expect to step out of your comfort zone."},
{"Category": "Writing, Literature, Humanities, Arts", "End Date": "Friday, July 19, 2019", "Name": "Connecticut Writing Project Summer Institute", "Graduate Credit": "X", "URL": "http://cwp.uconn.edu/summer-institute/", "Location": "Storrs, CT", "Organization": "University of Connecticut and the Connecticut Writers Project", "Start Date": "Monday, June 24, 2019", "Emily: 👍": "", "Description": "“ . . . where teachers come to improve their writing in order to improve the writing of their students.”\n\nEvery year since 1982, the CWP has invited outstanding teachers from all disciplines and levels of instruction to participate in a Summer Invitational Institute on the Storrs campus. This Summer Institute provides teachers with the opportunity to study current composition theories, to share their expertise, and to compile their own original writing portfolio.\n\nDuring the summer institute you will write every day, participate in peer response groups, revise your writing, share your knowledge and insights with other teachers, conduct graduate-level research, build leadership skills, and grow as teachers and writers.\n\nAll participants will receive a $500 Aetna Fellowship or the option to earn six graduate credits in English.\n"},
{"Category": "Leadership", "End Date": "Friday, June 28, 2019", "Name": "Institute for Heads", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Clearwater Beach, FL", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Tuesday, June 25, 2019", "Emily: 👍": "", "Description": "This energizing and nurturing retreat offers an opportunity for thoughtful dialogue and engagement with other heads on key issues facing heads of school and their spouses. The number of participants is limited to foster connections and allow for contributions from all attendees. Featuring Rob Evans and Michael Thompson. "},
{"Category": "", "End Date": "Thursday, June 27, 2019", "Name": "ISACS LEADERSHIP ACADEMY: THE BUSINESS OF LEADING SCHOOLS ", "Graduate Credit": "", "URL": "http://www.isacs.org/page/472115_Conferences_and_Workshops.asp?event=440", "Location": "Chicago, IL", "Organization": "The Independent School Association of the Central States (ISACS) & Northwestern University's Kellogg School", "Start Date": "Tuesday, June 25, 2019", "Emily: 👍": "", "Description": "\n"},
{"Category": "Leadership, Diversity/Equity/Inclusion, Human Resources, Counseling", "End Date": "Tuesday, July 2, 2019", "Name": "American School Counselor Association Annual Conference", "Graduate Credit": "", "URL": "https://www.ascaconferences.org/", "Location": "Boston, MA", "Organization": "American School Counselor Association", "Start Date": "Saturday, June 29, 2019", "Emily: 👍": "", "Description": "Join more than 2,000 school counseling professionals for four days of inspirational keynote sessions, informative breakout sessions, in-depth looks at hot topics in the school counseling profession and networking opportunities galore.\n\nCan't make it to the ASCA Annual Conference in person? You can still register as a virtual conference attendee."},
{"Category": "Pedagogy, Leadership, Charter School", "End Date": "Wednesday, July 3, 2019", "Name": "National Charter Schools Conference", "Graduate Credit": "", "URL": "http://ncsc.publiccharters.org/", "Location": "Las Vegas, NV", "Organization": "National Alliance of Public Charter Schools", "Start Date": "Sunday, June 30, 2019", "Emily: 👍": "", "Description": "The National Charter Schools Conference delivers exceptional learning and networking opportunities for every participant. With inspirational keynote speakers, more than 130 engaging breakout sessions and unique networking events, this national event has something for everyone."},
{"Category": "Leadership, Pedagogy, School Design, Diversity/Equity/Inclusion", "End Date": "Saturday, July 13, 2019", "Name": "The Principal's Center at Harvard University: Leadership: An Evolving Vision", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/node/416791", "Location": "Cambridge, MA", "Organization": "Harvard University ", "Start Date": "Sunday, July 7, 2019", "Emily: 👍": "", "Description": "» Experienced school leaders with 5+ years of leadership experience.\nReflect, stretch, and strengthen your leadership skills, examine challenges to raising student achievement, and work with experts in school leadership to master effective strategies for building successful schools.\n\n---\n\nFounded in 1981, The Principals' Center at the Harvard Graduate School of Education provides aspiring and experienced school leaders from across the country and around the world with exemplary professional development to meet personal and professional challenges. The Principals' Center has dedicated itself to the support, development and improvement of school principals and other school leaders who influence the character and quality of a school.\n\nBased on the premise that school leaders significantly influence best practice, The Principals' Center offers a variety of professional development programs designed to strengthen your leadership skills for greater impact.\n\nNo matter where you are from, you will connect with peers who face similar challenges and build a lasting professional network that will help support you throughout your career. Our institutes provide you with the time you need to reflect, refocus and recharge.\n\nYou will leave inspired, with new ideas and frameworks that you can put into practice the day you get back to your school. Enroll today and join our community of learners."},
{"Category": "STEM, Technology, Science, Pedagogy", "End Date": "Wednesday, July 10, 2019", "Name": "Computer Science Teachers Association Annual Conference", "Graduate Credit": "", "URL": "https://www.csteachers.org/page/2019conference", "Location": "Phoenix, AZ", "Organization": "Computer Science Teachers Association", "Start Date": "Sunday, July 7, 2019", "Emily: 👍": "", "Description": "CSTA 2019 is a professional development opportunity for computer science and information technology educators working in, or within the K-12 arena who need practical, classroom-focused information to help them prepare their students for the future. Conference content is peer reviewed and peer or industry led, making it relevant to today's classroom needs. We expanded our conference to span three days, with two days of workshops, more industry-specific sessions, more exhibitors, along with multiple networking opportunities.\n\nWe call it a conference but it's not like most conferences. The main goal is to provide quality information/assistance--professional development--for computer science teachers and others who wish to include computing in their teaching. We also want to build a community of computing teachers and we want you to be part of it. "},
{"Category": "Pedagogy", "End Date": "Wednesday, July 10, 2019", "Name": "Institute for New Teachers", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Atlanta, GA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Monday, July 8, 2019", "Emily: 👍": "", "Description": "This interactive experience will equip new teachers with the skills and understanding to guide and support their early years. Participants will present two sample lessons to a small peer group. Guided by an experienced educator, lessons will be recorded and reviewed in the small group setting. Discussion will focus on strengths and opportunities observed during the lesson. New teachers will learn best practices for lesson development, parent communication, and classroom management. They will address anticipated challenges and difficult conversations through real-life scenarios and role play. "},
{"Category": "History, Humanities, Gender Studies", "End Date": "Saturday, July 13, 2019", "Name": "George Washington Teacher Institute Summer Residential Programs: Martha Washington and the Women of the 18th Century", "Graduate Credit": "", "URL": "http://www.mountvernon.org/education/for-teachers/teaching-institutes-professional-development/residential-programs/summer-residential-programs/", "Location": "Mount Vernon, VA", "Organization": "Mount Vernon Ladies' Association of the Union", "Start Date": "Tuesday, July 9, 2019", "Emily: 👍": "", "Description": "A 5-day immersive professional development designed to support K-12 educators teach about the life, leadership, and legacy of George Washington and the 18th-century world in which he lived. Each program includes these signature elements:\n\nIn-depth content and primary source analysis.\nImmersive 18th-century experiences with historical interpreters and subject matter experts.\nLively debate and engaged collaboration with visiting scholars, fellow participants, and Mount Vernon staff.\nClassroom applicability including technology integration.\nConnections between historical events and contemporary student experiences."},
{"Category": "STEM, Technology, Pedagogy", "End Date": "Thursday, July 11, 2019", "Name": "Instructurecarn (Instructurecon)", "Graduate Credit": "", "URL": "https://www.canvaslms.com/news/instructurecon/", "Location": "Long Beach, CA", "Organization": "Canvas", "Start Date": "Tuesday, July 9, 2019", "Emily: 👍": "", "Description": "COME ONE, COME ALL! THE GREATEST EDTECH CONFERENCE ON EARTH IS ABOUT TO BEGIN! It’s educational! It’s technological! It’s pedagogical! Come and witness extraordinary feats of LMS innovation! See mystifying marvels of teaching and learning! You’ll gasp. You’ll gape. You’ll shake your head in utter amazement. Step right up and register to attend!"},
{"Category": "STEM, Technology, Innovation", "End Date": "", "Name": "Learning with Innovative Technology Conference", "Graduate Credit": "", "URL": "https://www.esc.edu/graduate-studies/lit/", "Location": "Saratoga Springs, NY", "Organization": "SUNY Empire State College & the Saratoga Springs City School District", "Start Date": "Friday, July 12, 2019", "Emily: 👍": "", "Description": "Join us for this FREE conference on using technologies in education. SUNY Empire State College and the Saratoga Springs City School District will host its annual Learning with Innovative Technology (LIT) Conference at the Saratoga Springs Maple Avenue Middle School, 515 Maple Avenue, Saratoga Springs, NY 12866.\n\nThis conference is designed for educators of all types, including K-12 teachers, higher-education faculty and students, technologists, librarians and anyone else interested in the use of technologies in education. The conference is packed with presentations from other educators, like you, who have something to share in the field. You'll walk away from this conference with new and fresh ideas to bring back to your school and classroom. Professional development certificates will be awarded to those interested.\n\n"},
{"Category": "STEM, Technology, School Design, Leadership, Pedagogy, Global Studies, Innovation, History, Humanities, Math, Science, Literature", "End Date": "Tuesday, July 16, 2019", "Name": "Building Learning Communities (BLC) Pre-Conference Master Classes", "Graduate Credit": "", "URL": "https://novemberlearning.com/education-conference/#", "Location": "Boston, MA", "Organization": "November Learning", "Start Date": "Sunday, July 14, 2019", "Emily: 👍": "", "Description": "These workshops provide intensive, hands-on opportunities for exploring leading-edge teaching and learning skills and strategies. Space is limited, so book early! Participants may register for these workshops without registering for the main summer conference session.\n\nSee website for specific workshop offerings."},
{"Category": "Pedagogy", "End Date": "Wednesday, July 17, 2019", "Name": "Institute for New Teachers", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Charlotte, NC", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Monday, July 15, 2019", "Emily: 👍": "", "Description": "This interactive experience will equip new teachers with the skills and understanding to guide and support their early years. Participants will present two sample lessons to a small peer group. Guided by an experienced educator, lessons will be recorded and reviewed in the small group setting. Discussion will focus on strengths and opportunities observed during the lesson. New teachers will learn best practices for lesson development, parent communication, and classroom management. They will address anticipated challenges and difficult conversations through real-life scenarios and role play. "},
{"Category": "History, Humanities", "End Date": "Saturday, July 20, 2019", "Name": "George Washington Teacher Institute Summer Residential Programs - First in Business: George Washington, Mount Vernon, and the New Nation", "Graduate Credit": "", "URL": "http://www.mountvernon.org/education/for-teachers/teaching-institutes-professional-development/residential-programs/summer-residential-programs/", "Location": "Mount Vernon, VA", "Organization": "Mount Vernon Ladies' Association of the Union", "Start Date": "Tuesday, July 16, 2019", "Emily: 👍": "", "Description": "A 5-day immersive professional development designed to support K-12 educators teach about the life, leadership, and legacy of George Washington and the 18th-century world in which he lived. Each program includes these signature elements:\n\nIn-depth content and primary source analysis.\nImmersive 18th-century experiences with historical interpreters and subject matter experts.\nLively debate and engaged collaboration with visiting scholars, fellow participants, and Mount Vernon staff.\nClassroom applicability including technology integration.\nConnections between historical events and contemporary student experiences."},
{"Category": "STEM, Technology, School Design, Leadership, Pedagogy, Global Studies, Innovation, History, Humanities, Math, Science, Literature", "End Date": "Friday, July 19, 2019", "Name": "Building Learning Communities (BLC)", "Graduate Credit": "", "URL": "https://novemberlearning.com/education-conference/#", "Location": "Boston, MA", "Organization": "November Learning", "Start Date": "Wednesday, July 17, 2019", "Emily: 👍": "", "Description": "Join colleagues from around the world who care deeply about bringing the best innovative and practical learning resources to our students. Our education conference will provide you with inspiration, practical skills and expand your professional network with educators from around the world.\n\nIf you have a hand in education — whatever your interest, ability or setting — BLC has something for you. In 2015, BLC drew more than 800 participants, representing countless K-12 and college roles, along with thought leaders from around the world. This year’s event will offer a choice of over 100 pre-conference master classes and main conference sessions, feature world-renowned keynote speakers, and showcase services and solutions."},
{"Category": "Pedagogy", "End Date": "Friday, July 19, 2019", "Name": "Institute for New Teachers: Public to Private", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Charlotte, NC", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Thursday, July 18, 2019", "Emily: 👍": "", "Description": "This program is designed for experienced public school teachers who are making the move to an independent school. Participants should have at least three years of teaching experience in a public school setting. Topics include the unique culture of an independent school, working and communicating within the school community, navigating HR/legal issues, and balancing new responsibilities with a healthy home life."},
{"Category": "Leadership, School Design", "End Date": "Saturday, July 20, 2019", "Name": "National Principals Conference (NPC)", "Graduate Credit": "", "URL": "http://www.principalsconference.org/", "Location": "Boston, MA", "Organization": "National Association of Elementary School Principals and National Association of Secondary School Principals", "Start Date": "Thursday, July 18, 2019", "Emily: 👍": "", "Description": "With innovative programming that will address the specific needs and challenges of school leaders, this conference is your chance to join your peers to mold the course of student success."},
{"Category": "Leadership, Technology, STEM, Online Learning", "End Date": "Thursday, July 25, 2019", "Name": "BbWORLD 17", "Graduate Credit": "", "URL": "http://bbworld.com/", "Location": "Austin, TX", "Organization": "Blackboard", "Start Date": "Tuesday, July 23, 2019", "Emily: 👍": "", "Description": "BbWorld is where great minds in education come together to exchange ideas, share best practices, and address today’s toughest educational challenges. Join us for three days of informative sessions and non-stop networking."},
{"Category": "STEM, Science, Math", "End Date": "Friday, July 26, 2019", "Name": "8th Annual STEM Forum & Expo", "Graduate Credit": "", "URL": "http://s6.goeshow.com/nsta/stem/2019/", "Location": "San Francisco, CA", "Organization": "National Science Teachers Association", "Start Date": "Wednesday, July 24, 2019", "Emily: 👍": "", "Description": "The 8th Annual STEM Forum & Expo, hosted by NSTA, is a unique, focused event that brings together (informal and formal) educators and representatives from exhibiting companies who are interested in, and who have tools and resources to share that will ensure successful implementation of STEM education into our schools and communities. It is intended to provide resources for educators and organizations seeking to learn more about STEM education, associated outreach programs, partnerships, schools, and curricula"},
{"Category": "History, Humanities", "End Date": "Saturday, August 3, 2019", "Name": "George Washington Teacher Institute Summer Residential Programs - Washington at War: From Soldier to Commander in Chief", "Graduate Credit": "", "URL": "http://www.mountvernon.org/education/for-teachers/teaching-institutes-professional-development/residential-programs/summer-residential-programs/", "Location": "Mount Vernon, VA", "Organization": "Mount Vernon Ladies' Association of the Union", "Start Date": "Tuesday, July 30, 2019", "Emily: 👍": "", "Description": "A 5-day immersive professional development designed to support K-12 educators teach about the life, leadership, and legacy of George Washington and the 18th-century world in which he lived. Each program includes these signature elements:\n\nIn-depth content and primary source analysis.\nImmersive 18th-century experiences with historical interpreters and subject matter experts.\nLively debate and engaged collaboration with visiting scholars, fellow participants, and Mount Vernon staff.\nClassroom applicability including technology integration.\nConnections between historical events and contemporary student experiences."},
{"Category": "Math, STEM", "End Date": "Saturday, August 3, 2019", "Name": "MAA MathFest 2019", "Graduate Credit": "", "URL": "https://www.maa.org/meetings/mathfest", "Location": "Cincinnati, OH", "Organization": "Mathematical Association of America", "Start Date": "Wednesday, July 31, 2019", "Emily: 👍": "", "Description": "MAA MathFest draws mathematicians from all over the world to celebrate mathematics and build connections. The annual summertime meeting features numerous sessions devoted to all aspects of mathematical education and the latest in mathematical research. MAA MathFest continues to bring new and upcoming mathematicians into the community: last year 23 percent of attendees were graduate and undergraduate students, and more than 30 percent were first-time attendees."},
{"Category": "History, Humanities", "End Date": "Saturday, August 10, 2019", "Name": "George Washington Teacher Institute Summer Residential Programs - The Great Experiment: George Washington and the Founding of the U.S. Government", "Graduate Credit": "", "URL": "http://www.mountvernon.org/education/for-teachers/teaching-institutes-professional-development/residential-programs/summer-residential-programs/", "Location": "Mount Vernon, VA", "Organization": "Mount Vernon Ladies' Association of the Union", "Start Date": "Tuesday, August 6, 2019", "Emily: 👍": "", "Description": "A 5-day immersive professional development designed to support K-12 educators teach about the life, leadership, and legacy of George Washington and the 18th-century world in which he lived. Each program includes these signature elements:\n\nIn-depth content and primary source analysis.\nImmersive 18th-century experiences with historical interpreters and subject matter experts.\nLively debate and engaged collaboration with visiting scholars, fellow participants, and Mount Vernon staff.\nClassroom applicability including technology integration.\nConnections between historical events and contemporary student experiences."},
{"Category": "Online Learning, STEM, Technology", "End Date": "Thursday, August 8, 2019", "Name": "Distance Teaching & Learning Conference", "Graduate Credit": "", "URL": "https://dtlconference.wisc.edu/ ", "Location": "Madison, WI", "Organization": "University of Wisconsin-Madison", "Start Date": "Tuesday, August 6, 2019", "Emily: 👍": "", "Description": "With more than 130 sessions—featured talks, problem-solving sessions, discussions, demos, hands-on mini-workshops, and so much more—plus abundant opportunities for networking, this is one conference where online education professionals will surely be inspired, engaged, and informed"},
{"Category": "Leadership", "End Date": "", "Name": "Board/Head Retreat", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Atlanta, GA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Sunday, October 27, 2019", "Emily: 👍": "", "Description": "Designed to strengthen the communication and partnership between the head of school and members of the board, this program offers the opportunity to collaborate on current challenges and identify common goals for the success of the school. "},
{"Category": "Leadership, School Design", "End Date": "Tuesday, October 29, 2019", "Name": "SAIS Annual Conference", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Atlanta, GA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Sunday, October 27, 2019", "Emily: 👍": "", "Description": "An informative, innovative, and comprehensive opportunity for independent school leaders to gather and discover proven strategies and emerging trends. Join us and over 300 colleagues from across the Southeast as we delve into hot topics and relevant issues. Attend sessions that fill in gaps in your experience, converse with leaders from schools with a similar size and budget, and learn from top-notch speakers. "},
{"Category": "Library", "End Date": "Saturday, November 16, 2019", "Name": "American Association of School Librarians Annual Conference & Exhibition", "Graduate Credit": "", "URL": "http://www.ala.org/aasl/conferences/national", "Location": "Louisville, KY", "Organization": "American Association of School Librarians (a division of the ALA)", "Start Date": "Thursday, November 14, 2019", "Emily: 👍": "", "Description": "The AASL National Conference & Exhibition is the the only national conference devoted solely to the needs of school librarians. The conference is held every two years and coordinated by a member-committee composed of association leaders from across the nation. While it is the primary continuing education activity of the division and a leading professional development event for school librarians, the AASL national conference is also an excellent educational and business forum for the entire library community. "},
{"Category": "STEM, Technology", "End Date": "Wednesday, February 26, 2020", "Name": "Pennsylvania Education Technology Expo and Conference (PETE&C)", "Graduate Credit": "", "URL": "https://www.peteandc.org/", "Location": "Pittsburgh, PA", "Organization": "PETE&C", "Start Date": "Sunday, February 23, 2020", "Emily: 👍": "", "Description": "EdTech conference, expo & student showcase"},
{"Category": "Leadership, School Design", "End Date": "Tuesday, October 20, 2020", "Name": "SAIS Annual Conference", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Nashville, TN", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Sunday, October 18, 2020", "Emily: 👍": "", "Description": "An informative, innovative, and comprehensive opportunity for independent school leaders to gather and discover proven strategies and emerging trends. Join us and over 300 colleagues from across the Southeast as we delve into hot topics and relevant issues. Attend sessions that fill in gaps in your experience, converse with leaders from schools with a similar size and budget, and learn from top-notch speakers. "},
{"Category": "STEM, Technology", "End Date": "Wednesday, February 10, 2021", "Name": "Pennsylvania Education Technology Expo and Conference (PETE&C)", "Graduate Credit": "", "URL": "https://www.peteandc.org/", "Location": "Hershey, PA", "Organization": "PETE&C", "Start Date": "Sunday, February 7, 2021", "Emily: 👍": "", "Description": "EdTech conference, expo & student showcase"},
{"Category": "Humanities, Literature, Arts, Library", "End Date": "Saturday, March 6, 2021", "Name": "Association of Writers & Writing Programs Conference and Bookfair", "Graduate Credit": "", "URL": "https://www.awpwriter.org/awp_conference/overview", "Location": "Kansas City, MO", "Organization": "Association of Writers & Writing Programs (AWP)", "Start Date": "Wednesday, March 3, 2021", "Emily: 👍": "", "Description": "The AWP Conference & Bookfair is an essential annual destination for writers, teachers, students, editors, and publishers. Each year more than 12,000 attendees join our community for four days of insightful dialogue, networking, and unrivaled access to the organizations and opinion-makers that matter most in contemporary literature. The conference features over 2,000 presenters and 550 readings, panels, and craft lectures. The bookfair hosted over 800 presses, journals, and literary organizations from around the world. AWP’s is now the largest literary conference in North America. Join us in Tampa, FL, in 2018 to celebrate the best of what contemporary literature has to offer."},
{"Category": "Leadership, School Design", "End Date": "Tuesday, October 19, 2021", "Name": "SAIS Annual Conference", "Graduate Credit": "", "URL": "https://www.sais.org/page/2019Calendar", "Location": "Atlanta, GA", "Organization": "SAIS (Serving and Accrediting Independent Schools)", "Start Date": "Sunday, October 17, 2021", "Emily: 👍": "", "Description": "An informative, innovative, and comprehensive opportunity for independent school leaders to gather and discover proven strategies and emerging trends. Join us and over 300 colleagues from across the Southeast as we delve into hot topics and relevant issues. Attend sessions that fill in gaps in your experience, converse with leaders from schools with a similar size and budget, and learn from top-notch speakers. "},
{"Category": "Library", "End Date": "Sunday, October 24, 2021", "Name": "American Association of School Librarians Annual Conference & Exhibition", "Graduate Credit": "", "URL": "http://www.ala.org/aasl/conferences/national", "Location": "Salt Lake City, UT", "Organization": "American Association of School Librarians (a division of the ALA)", "Start Date": "Thursday, October 21, 2021", "Emily: 👍": "", "Description": "The AASL National Conference & Exhibition is the the only national conference devoted solely to the needs of school librarians. The conference is held every two years and coordinated by a member-committee composed of association leaders from across the nation. While it is the primary continuing education activity of the division and a leading professional development event for school librarians, the AASL national conference is also an excellent educational and business forum for the entire library community. "},
{"Category": "Humanities, Literature, Arts, Library", "End Date": "Saturday, March 26, 2022", "Name": "Association of Writers & Writing Programs Conference and Bookfair", "Graduate Credit": "", "URL": "https://www.awpwriter.org/awp_conference/overview", "Location": "Philadelphia, PA", "Organization": "Association of Writers & Writing Programs (AWP)", "Start Date": "Wednesday, March 23, 2022", "Emily: 👍": "", "Description": "The AWP Conference & Bookfair is an essential annual destination for writers, teachers, students, editors, and publishers. Each year more than 12,000 attendees join our community for four days of insightful dialogue, networking, and unrivaled access to the organizations and opinion-makers that matter most in contemporary literature. The conference features over 2,000 presenters and 550 readings, panels, and craft lectures. The bookfair hosted over 800 presses, journals, and literary organizations from around the world. AWP’s is now the largest literary conference in North America. Join us in Tampa, FL, in 2018 to celebrate the best of what contemporary literature has to offer."},
{"Category": "Religion, Leadership, STEM, Technology, Arts", "End Date": "Wednesday, June 19, 2019", "Name": "2019 NCEA New Directions STREAM 3.0 Conference", "Graduate Credit": "", "URL": "https://www.ncea.org/NCEA/Learn/Events/Event_Display.aspx?EventKey=STREAM3.0&WebsiteKey=60819b28-9432-4c46-a76a-a2e20ac11cfd", "Location": "Parsippany, NJ", "Organization": "National Catholic Educational Association (NCEA) ", "Start Date": "Sunday, June 17, 2029", "Emily: 👍": "", "Description": "The conference will provide a top-level education to teachers, school leaders, and diocesan leaders. Since STREAM's (Science, Technology, Religion, Engineering, Arts and Mathematics) inception in 2014, research has shown that robust STEM programs are a priority for today's prospective Catholic school parent. Attendees will learn how to effectively facilitate the design and delivery of a comprehensive STREAM program which not only emphasizes a robust STEM program but ensures the intentional integration of the faith and the arts. Ongoing advances in understanding the impact of neuroscience on student learning will be explored. Updated STREAM education indicators will be presented. The conference is designed to be collaborative and provide for sharing information and best practices. The meeting consists of professional development sessions, inspirational keynotes, and networking opportunities."},
{"Category": "History, Humanities, Research", "End Date": "", "Name": "The Life Guard Teacher Fellowship Program ", "Graduate Credit": "", "URL": "http://www.mountvernon.org/education/for-teachers/teaching-institutes-professional-development/the-life-guard-teacher-fellowship-program/", "Location": "Mount Vernon, VA", "Organization": "Fred W. Smith National Library", "Start Date": "Flexible", "Emily: 👍": "", "Description": "The Life Guard Teacher Fellowship Program began in 2013 to support the creation of classroom materials and teacher resources about the life, legacy, and leadership of George Washington. Fellows work closely with the staff at the Fred W. Smith National Library for the Study of George Washington as they research and produce work to be distributed to a national audience.\n\nThe Life Guard Teacher Fellowships will support the creation or dramatic transformation of curriculum materials, lesson plans, website content, interpretive tools, or other education resources to support a 21st-century classroom’s needs. The subject of said materials must relate to teaching about George Washington and the founding era. Four to six fellowships will be awarded during the 2017-18 cycle. \n\nSuccessful applications will demonstrate knowledge of curriculum connections to George Washington and the founding era; the ability to integrate the material with national and state-based models for student assessment and standards; and will make use of Mount Vernon’s existing online and onsite expertise and resources. The proposed project should show both creativity and practicality so that it pushes innovation and also can be adopted in a variety of classroom environments.  \n\nFellowships awarded are for one to three weeks of consecutive or non-consecutive study between June 2017 and August 2018.\n\nSelected fellows will work with Mount Vernon staff to schedule dates for residency. Reimbursement for one round trip to the Washington Library, housing, and a $1000 stipend for each week of research at the Library are also included in the Fellowship. "},
{"Category": "Leadership, Pedagogy, School Design", "End Date": "", "Name": "Critical Friends Group™ (CFG®) New Coaches Training", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#CFG", "Location": "Your School", "Organization": "Wildwood School", "Start Date": "N/A", "Emily: 👍": "", "Description": "Customized On-site Training Only (12 participant minimum)\n\nReady to develop peer-to-peer coaching at your school?\nThis five-day workshop provides educators with research-based tools for developing a collaborative culture that fosters professional learning communities and improves student achievement. Beginning Coaches Training offers an opportunity to learn the fundamentals of CFG coaching by experiencing them firsthand. Participants also meet and work with like-minded professionals engaged in similar work across the country.\n\n\nBy the end of the workshop, participants will:\n\nBe CFG coaches certified by The National School Reform Faculty\nEmbrace adult learning in service of student achievement\nKnow how to “mine” a text for maximum meaning\nUnderstand how to match protocols to particular examples of student and adult work\nKnow how to give and receive productive feedback on professional practice\nDevelop CFG facilitation skills\nHave several strategies for increasing adult learning by examining student and adult work\nDevelop skills to create equitable opportunities for all students\nHave a plan for starting a CFG at their school or district\n"},
{"Category": "Library", "End Date": "", "Name": "American Library Association Online Learning Offerings", "Graduate Credit": "", "URL": "http://www.ala.org/onlinelearning/unit/aasl", "Location": "Online", "Organization": "American Library Association / American Association of School Librarians", "Start Date": "N/A", "Emily: 👍": "", "Description": "Tons of free online webinars that you can watch on-demand, along with a large number of eCourses. Examples include: \n-From 0 to 60: Implement E-books in Your Library Program in 4 Weeks\n-Making Your Library Epic: Creating Innovative Spaces for Student Learning\n-Best Apps for Teaching & Learning: Transform Teaching and Learning with Digital Tools"},
{"Category": "Arts, Humanities, History, Literature, Writing, Math, Science, STEM, Language, Pedagogy", "End Date": "", "Name": "Annenberg Learner: Online teacher resources and professional development across the curriculum\n", "Graduate Credit": "X", "URL": "http://www.learner.org/workshops/workshop_list.html", "Location": "Online", "Organization": "Annenberg Learner & Annenberg Foundation", "Start Date": "N/A", "Emily: 👍": "X", "Description": "Annenberg Learner funds and distributes more than 100 multimedia courses and workshops to help teachers keep current on the content they teach. Professional development resources provide teachers with research on the most effective teaching strategies along with their connection to national education content standards, and examples of these principles applied in real classrooms. The video components are paired with extensive Web sites that include online texts, course and workshop guides, and extensive background information to enhance the learning experience. Using these resources, teachers can learn from experts, other teachers, and even students who reveal their unique interpretations of the content.\n\nTeachers also can earn graduate education credit using these resources through Colorado State University for a low tuition fee. We also make the resources available at no cost to individual learners through our Web site, Learner.org. \n\nWorkshops cover a wide range of disciplines and grade levels. There are MANY offerings, for example: \n\nArts\n-Art Through Time: A Global View\n\nEducation Theory and Issues\n-Neuroscience & the Classroom: Making Connections\n-Principles for Principals\n-Reading & Writing in the Disciplines\n\nHistory and Social Studies\n-The Economics Classroom: A Workshop for Grade 9-12 Teachers\n-Primary Sources: Workshops in American History\n-Making Civics Real: A Workshop for Teachers\n\nLiterature and Language Arts\n-Developing Writers: A Workshop for High School Teachers\n-The Expanding Canon: Teaching Multicultural Literature in High School\n-Teaching Foreign Languages \n\nMathematics\n-Private Universe Project in Mathematics\n-Insights Into Algebra 1: Teaching for Learning\n-Assessment in Math and Science: What's the Point?\n\nScience\n-The Habitable Planet: A Systems Approach to Environmental Science\n-Chemistry: Challenges and Solutions\n-Physics for the 21st Century\n-Rediscovering Biology: Molecular to Global Perspectives\n\n"},
{"Category": "Science, Math, STEM, Global Studies, Language, Humanities, History, Arts, Literature, Writing, Leadership", "End Date": "", "Name": "AP Online Professional Development Options", "Graduate Credit": "", "URL": "http://apcentral.collegeboard.com/apc/public/professional_development/online_pd/index.html", "Location": "Online", "Organization": "College Board", "Start Date": "N/A", "Emily: 👍": "", "Description": "Numerous free online options for both new and experienced teachers.\n\nOptions include: \n-Close Reading of Challenging Primary Sources\n-Writing About Art\n-Teaching and Assessing AP European History\n-Historical Thinking Skills and Rubrics\n-Teaching and Assessing AP Calculus AB and BC\n-Quantitative Methods, Part 1: An Introduction to Descriptive Statistics\n-World Languages and Cultures: Interactive Online Modules"},
{"Category": "Pedagogy, Leadership, School Design", "End Date": "", "Name": "Authentic Education Workshops", "Graduate Credit": "", "URL": "http://www.authenticeducation.org/services/workshops.lasso", "Location": "Your School", "Organization": "Authentic Education (Grant Wiggins)", "Start Date": "N/A", "Emily: 👍": "", "Description": "At Authentic Education, we honor our belief in the individuality of schools by customizing all services to meet the specific needs of our clients.\n\nOur workshops are interactive, combining multimedia presentation with hands-on activities, intriguing dialogue, and opportunities to apply powerful principles and tools to your particular circumstances. We provide a comprehensive set of proven worksheets, examples, and other materials for use during and long after the workshop.\n\nGo to the website to learn about the most popular workshops (such as an introduction to Learning by Design) and the services most commonly requested of us by schools throughout the world. If nothing here suits your particular needs, please call us.\n"},
{"Category": "Leadership, Technology, STEM, Online Learning", "End Date": "", "Name": "BbWORLD K-12 Live: The Digital Program", "Graduate Credit": "", "URL": "http://bbworld.com/bbworldlive/k12/", "Location": "Online", "Organization": "Blackboard", "Start Date": "N/A", "Emily: 👍": "", "Description": "There are some digital sessions from the BbWorld conference available online for viewing on demand. \n\nThis year we’re presenting content for the entire K-12 community, from communications professionals to teachers. Don’t miss out on a chance to hear from peers and Blackboard experts about the topics that matter most to you, including community engagement, educational accessibility, and personalized learning."},
{"Category": "Global Studies, Humanities, Pedagogy, Leadership, Diversity/Equity/Inclusion", "End Date": "", "Name": "GLOBALED.TV: A Webinar Series", "Graduate Credit": "", "URL": "http://www.globaled.tv/archive.html", "Location": "Online", "Organization": "Global Education Conference Network, the Learning Revolution and Know My World", "Start Date": "N/A", "Emily: 👍": "", "Description": "GlobalEd TV is a free inclusive and  comprehensive webinar series which spotlights theories and best practices related to multiculturalism in schools and organizations all over the world. This 5 part series is designed to inform educators, students and parents about the role of cultural and global competence in  education. Hosted twice a month by the Global Education Conference Network, the Learning Revolution and Know My World, participants will be included in global conversations with featured experts , practitioners and organizations in the field, with the goal of exploring the impact of global education. Through themed sessions, interviews, dynamic examples, Q&A, and practical exercises, each one-hour segment will provide participants with the knowledge and skills to bring global competence to their schools and communities.\n\nSeries took place in 2016 and is now available to watch on-demand."},
{"Category": "Technology, Leadership", "End Date": "", "Name": "Google Education Training Center", "Graduate Credit": "", "URL": "https://edutrainingcenter.withgoogle.com/", "Location": "Online", "Organization": "Google", "Start Date": "N/A", "Emily: 👍": "", "Description": "Free, online training to help you use Google Tools in your classroom. Also offers Device Training and a course to become a Trainer. "},
{"Category": "Global Studies, Humanities, History, Arts, Religion", "End Date": "", "Name": "Hemispheres: The International Outreach Consortium Webinars", "Graduate Credit": "", "URL": "http://liberalarts.utexas.edu/hemispheres/online/index.php", "Location": "Online", "Organization": "Hemispheres: The International Outreach Consortium at the University of Texas-Austin", "Start Date": "N/A", "Emily: 👍": "", "Description": "Hemispheres offers short webinars year round through the Adobe Connect platform. Adobe Connect is easy to use, as it requires you, the viewer, only to have a web browser -- there is no additional software to download or install! \n\nCheck the website for upcoming webinars, or view previous ones on-demand. \n\nExamples of Past Webinars:\n-Great Works, Great Ideas: a five-part webinar series exploring great ideas and great works of literature and architecture and the impact they've had on societies and cultures throughout the ages. Individual sessions include The Western Dome in Architecture: From the Pantheon to the Texas Capitol and The Qur'an, Art & Architecture) \n-South Asian Religions: a four-part webinar\n-Bridging the Human and Physical Experiences of Africa"},
{"Category": "Pedagogy, Leadership", "End Date": "", "Name": "High Tech High  Massive Open Online Courses (MOOCs)", "Graduate Credit": "", "URL": "http://gse.hightechhigh.org/moocs.php", "Location": "Online", "Organization": "High Tech High", "Start Date": "N/A", "Emily: 👍": "", "Description": "A number of MOOCs, ranging from \"How to Teach Us\" to \"Deeper Learning 101\" to \"School Creation.\" "},
{"Category": "Library, Humanities, Literature, History", "End Date": "", "Name": "Library of Congress Online Modules", "Graduate Credit": "", "URL": "http://www.loc.gov/teachers/professionaldevelopment/selfdirected/", "Location": "Online", "Organization": "Library of Congress", "Start Date": "N/A", "Emily: 👍": "", "Description": "Earn a certificate of completion by taking the Library's self-paced interactive modules. Each multimedia-rich program delivers approximately one hour of staff development.\n\nFree modules include:\n-Supporting Inquiry with Primary Sources\n-Analyzing Primary Sources: Maps\n-Analyzing Primary Sources: Photographs and Prints"},
{"Category": "Counseling", "End Date": "", "Name": "National Association for College Admission Counseling Online Webinars", "Graduate Credit": "", "URL": "https://www.nacacnet.org/professional-development/webinars/", "Location": "Online", "Organization": "National Association for College Admission Counseling", "Start Date": "N/A", "Emily: 👍": "", "Description": "Numerous webinars, ranging from \"Ethics and the Early FAFSA\" to \"What's your Story? Helping Students Write Their College Essays.\""},
{"Category": "Humanities, Literature, Writing", "End Date": "", "Name": "National Council of Teachers of English Online Learning", "Graduate Credit": "", "URL": "http://www.ncte.org/online-learning", "Location": "Online", "Organization": "National Council of Teachers of English", "Start Date": "N/A", "Emily: 👍": "", "Description": "Self-paced examinations, web seminars, and facilitated online courses"},
{"Category": "Financial, Leadership", "End Date": "", "Name": "SSS Training Webinars", "Graduate Credit": "", "URL": "https://sssbynais.org/webinars", "Location": "Online", "Organization": "School & Student Services (SSS) by NAIS", "Start Date": "N/A", "Emily: 👍": "", "Description": "SSS provides online learning events throughout the financial aid season. These include webinars such as: \"Trends in The Financial Aid Landscape,\" \"Making The Financial Aid Grant:  What’s The Right Number?\" and \"Spotlight on Taxes:  The 1040 and W2.\" These webinars are free to SSS Subscribers and are recorded for on-demand viewing as well."},
{"Category": "Pedagogy, Leadership, School Design, STEM, Science", "End Date": "", "Name": "Systems Thinking in Schools: Web Ed", "Graduate Credit": "", "URL": "http://www.watersfoundation.org/webed/", "Location": "Online", "Organization": "Waters Foundation", "Start Date": "N/A", "Emily: 👍": "", "Description": "These free, online learning modules allow both novices and those with some systems experience to explore systems thinking concepts and tools at their own pace."},
{"Category": "Pedagogy, Leadership, School Design, STEM, Science, Humanities", "End Date": "", "Name": "Systems Thinking Webinars", "Graduate Credit": "", "URL": "http://watersfoundation.org/professional-development-events/webinars/", "Location": "Online", "Organization": "Waters Foundation", "Start Date": "N/A", "Emily: 👍": "", "Description": "Anyone can view recordings of previous webinars on the website and access materials used during the session. \n\nA few examples of sessions: \n-A Systems Approach to Strategic Planning & School Improvement\n-Using Systems Tools to Analyze Nonfiction Text\n-Social Justice and Systems Thinking\n\nVisit the events calendar to register for upcoming webinars."},
{"Category": "Leadership, Pedagogy, Innovation", "End Date": "", "Name": "The Independent Curriculum Group Webinars", "Graduate Credit": "", "URL": "http://independentcurriculum.org/services/webinar-archive/", "Location": "Online", "Organization": "The Independent Curriculum Group", "Start Date": "N/A", "Emily: 👍": "", "Description": "Many free webinars, ranging from \"Teacher Orientation & Induction: Doing It Right\" to \"Moving to Competency-Based Learning\" to \"Shadowing Students: Your School’s User Experience.\" "},
{"Category": "Global Studies, Language, Humanities, History, Leadership", "End Date": "", "Name": "Webinars: Global Learning for Educators", "Graduate Credit": "", "URL": "http://asiasociety.org/education/webinars-global-learning-educators", "Location": "Online", "Organization": "Asia Society Center for Global Education", "Start Date": "N/A", "Emily: 👍": "", "Description": "You can view the Global Learning for Educators webinar series from 2012-2013. \n\nThe webinar offerings include: \n-Integrating International Perspectives into U.S. History – Resources for the Challenges Facing Today’s Teacher\n-What We Can Learn about Education from International Data\n-School Leadership in a Changing World\n-Students as Linguists and Diplomats: Eight Principles for Creative World Language Teaching\n\n"},
{"Category": "History, Humanities", "End Date": "", "Name": "Making Civics Real: A Workshop for Teachers", "Graduate Credit": "", "URL": "http://www.learner.org/resources/series177.html#", "Location": "Online", "Organization": "Annenberg Learner, State of the Art, National Council for the Social Studies, and the Center for Civic Education.", "Start Date": "N/A ", "Emily: 👍": "", "Description": "A free video workshop for high school teachers; 8 one-hour video programs, workshop guide, and Web site; graduate credit available.\n\nThis video workshop for the professional development of high school teachers illustrates a constructivist approach to the teaching of civics, with eight video programs, each dedicated to one teacher's multi-part lesson. Developed in collaboration with the National Council for the Social Studies and the Center for Civic Education, the video programs, Web site, and print guide provide the methodology for the effective teaching of civics, and include complete lesson plans of the lessons shown in the video. "},
{"Category": "Science, Math, Global Studies, Language, Humanities, History, Arts, Literature, Writing, Leadership", "End Date": "", "Name": "AP Central: Workshops", "Graduate Credit": "", "URL": "http://apcentral.collegeboard.com/InstitutesAndWorkshops", "Location": "Numerous", "Organization": "College Board", "Start Date": "Numerous", "Emily: 👍": "", "Description": "There are one- and two-day workshops perfect for all educator levels:\n\n-New AP teachers in the process of developing or refining an AP course.\n-Experienced AP teachers seeking to learn new strategies and share best practices.\n-K–12 teachers who want to be equipped with the Pre-AP strategies needed to engage students in high-level learning.\n-Administrators and AP Coordinators interested in establishing an AP program, building Vertical Teams, and organizing an exam administration.\n\nVisit the website for the complete catalogue of offerings, dates, and locations. "},
{"Category": "Humanities, History, Global Studies, Religion", "End Date": "", "Name": "Center for Contemporary Arab Studies at Georgetown University: K-14 Educational Outreach", "Graduate Credit": "", "URL": "https://ccas.georgetown.edu/outreach-events", "Location": "Washington, DC", "Organization": "Center for Contemporary Arab Studies at Georgetown University", "Start Date": "Numerous", "Emily: 👍": "", "Description": "As a U.S. Department of Education-sponsored National Resource Center on the Middle East and North Africa (NRC-MENA), the Center for Contemporary Arab Studies at Georgetown conducts workshops for educators throughout the year. The K-14 Education Outreach program focuses on the needs of K-14 educators in the District of Columbia, Maryland, Virginia, and beyond. The program helps teachers convey a nuanced and realistic view of Arabs and Islam to overcome stereotypes and shallow media presentations, supplementing the often inadequate treatment in curriculum and textbooks. In its fourth decade, CCAS has served thousands of educators through workshops and institutes, teaching units and background modules, resources from past workshops, a lending library, and curriculum development support. The program is supported by a Title VI grant from the Department of Education, the Center for Contemporary Arab Studies, and private sector grants.\n\nCheck website for upcoming offerings and to access resources from past workshops. "},
{"Category": "Pedagogy, Leadership, Personalized", "End Date": "", "Name": "Eagle Rock School & Professional Development Center", "Graduate Credit": "", "URL": "http://eaglerockschool.org/professional-development-center/", "Location": "Estes Park, CO or Your School", "Organization": "Eagle Rock School", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Host visiting educators, provide school visits, and facilitate school improvement. The Professional Development staffers here at Eagle Rock are organizational school change consultants. They work with schools and school districts and youth service organizations across the United States to help those entities create healthy, high-functioning learning environments with the aim to improve student engagement."},
{"Category": "Technology, STEM", "End Date": "", "Name": "Ed Tech Team / Google for Education", "Graduate Credit": "", "URL": "https://www.edtechteam.com/", "Location": "Numerous", "Organization": "EdTechTeam / Google for Education ", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Numerous opportunities! Summits, Bootcamps, Workshops, and Online Learning opportunities. EdTechTeam Summits featuring Google for Education are fast-paced, high-energy, conference-style events. Discover what’s possible, and how you can make it happen for your students."},
{"Category": "Un-Conference, Pedagogy, Leadership, Diversity/Equity/Inclusion, Innovation, Personalized", "End Date": "", "Name": "EdCamp", "Graduate Credit": "", "URL": "http://www.edcamp.org/?page_id=350%20?", "Location": "Numerous", "Organization": "The EdCamp Foundation", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Edcamps are organic, participant-driven professional learning experiences.\n\nTenets of Edcamp:\n-Free\n-Open to everyone\n-Created by participants on the day of the edcamp\n-Sessions facilitated by anyone - experience not experts\n-Reliant on the \"rule of two feet” that empowers everyone to find sessions that meet their needs\n-Vendor-free events​\n\nWhat began as an idea has transformed into a movement. Since the original Edcamp in 2010 there have been over 700 conferences around the world in 25 countries. In the first few months following that first session in Philadelphia, the Edcamp movement grew and flourished in a grassroots manner. Each Edcamp is independently organized and hosted, is free to participants, bringing together passionate educators for a day of learning and growth. The conferences are participant-driven with the sessions developed and facilitated by the teachers who are attending and leverage social media to involve remote attendees.\n\nBy adopting the un-conference protocol inspired by the Barcamp model, Edcamps provide access to high quality, personalized professional learning for all educators. Embracing the belief that fellow educators can be some of the most valuable professional development resources for their colleagues, the Edcamp movement has been recognized by countless organizations, including the United States Department of Education, the Bammy Awards for Education, the Association for Supervision and Curriculum Development (ASCD), the International Society for Technology in Education (ISTE), the TEDx program and the Bill & Melinda Gates Foundation."},
{"Category": "Humanities, Literature, History, Diversity/Equity/Inclusion", "End Date": "", "Name": "Facing History and Ourselves Webinars, Workshops, Courses and Seminars", "Graduate Credit": "", "URL": "https://www.facinghistory.org/professional-development ", "Location": "Numerous and Online", "Organization": "Facing History and Ourselves", "Start Date": "Numerous", "Emily: 👍": "", "Description": "By integrating the study of history, literature, and human behavior with ethical decision making and innovative teaching strategies, our program enables secondary school teachers to promote students’ historical understanding, critical thinking, and social-emotional learning. As students explore the complexities of history, and make connections to current events, they reflect on the choices they confront today and consider how they can make a difference.\n\nOur workshops are offered both in-person and online. In-person workshops last anywhere from 2 hours to 1-3 days, whereas online workshops typically last 3-5 days."},
{"Category": "Science, Math, STEM, Technology, Global Studies, Language, Humanities, History, Arts, Literature, Writing, Counseling, Diversity/Equity/Inclusion, Pedagogy, Leadership, Special Education", "End Date": "", "Name": "Framingham State University Online Courses for Teachers", "Graduate Credit": "X", "URL": "https://www.framingham.edu/academics/continuing-education/professional-development/courses-and-registration", "Location": "Online", "Organization": "Framingham State University", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Continuing Education at Framingham State University allows you to broaden your opportunities through a variety of credit and noncredit programs. \n\nSee website for complete catalogue of courses. \n\nExamples include: \n-Defining & Creating Professional Learning Communities\n-Using Technology to Help Students Demonstrate Understanding: Did They Really Get It? Web Tools to Help With Formative or Summative Assessment\n-Designing a Virtual Field Trip\n-Creating an Inclusive School-wide Environment\n-Preventing Eating Disorders\n-Integrating Mathematics, Writing & Literature\n"},
{"Category": "Technology, STEM", "End Date": "", "Name": "Global Summits featuring Google for Education", "Graduate Credit": "", "URL": "https://www.gafesummit.com/", "Location": "Numerous", "Organization": "EdTechTeam", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Each two-day high-intensity event focuses on deploying, integrating, and using Google Apps for Education (and other Google tools) to promote student learning in K-12 and higher education."},
{"Category": "Science, Sustainability, Global Studies, Research, History", "End Date": "", "Name": "Grosvenor Teacher Fellow Program: K-12 Geographic Education", "Graduate Credit": "", "URL": "http://nationalgeographic.org/education/programs/grosvenor-teacher-fellows", "Location": "Numerous", "Organization": "National Geographic", "Start Date": "Numerous", "Emily: 👍": "", "Description": " The program gives current K–12 classroom teachers and informal educators from the 50 U.S. states, Canada, the District of Columbia, and Puerto Rico the opportunity to extend Grosvenor’s legacy of excellence in geographic education. Exemplary educators are recognized for their commitment to geographic education and given the opportunity to travel aboard the Lindblad-National Geographic fleet. Through this experience, they bring new geographic awareness into their learning environments and communities.\n\nFellows are an integral part of the National Geographic community, working to further students’ understanding of the planet and empower them to generate solutions for a healthier and more sustainable future. To help ensure that the next generation is armed with geographic knowledge and global awareness, Fellows take on a two-year leadership commitment to support educators with National Geographic. Throughout their commitment, Fellows may be asked to conduct webinars, participate in meet-ups, and serve as a mentor to other educators. \n\nSelected educators will travel aboard the ships National Geographic Explorer, National Geographic Endeavour II, and National Geographic Sea Lion on expeditions to regions including the Arctic, British and Irish Isles, Canadian Maritimes, Iceland, the Galapagos, Antarctica and more. While aboard, Fellows will share the importance of geographic literacy with fellow travelers, develop activities to bring back to their classrooms, and have an adventure of a lifetime. Prior to the expedition, all 2017 Grosvenor Teacher Fellows will travel to Washington, D.C. (March 23–26, 2017) with all expenses covered to participate in a pre-voyage workshop sponsored by Lindblad Expeditions and National Geographic. "},
{"Category": "Leadership, Pedagogy, Innovation, STEM, Diversity/Equity/Inclusion, Personalized", "End Date": "", "Name": "High Tech High Workshops", "Graduate Credit": "", "URL": "http://gse.hightechhigh.org/workshops.php", "Location": "Your School", "Organization": "High Tech High", "Start Date": "Numerous", "Emily: 👍": "", "Description": "HTH teachers, school leaders and faculty from the Graduate School of Education are available to visit your school and facilitate professional development with faculty. We offer the following workshops, as well as personalized workshops based on the interests and needs of your school. All of our workshops are interactive and hands-on, model progressive teaching practicies and often use student work, video and other media to facilitate reflective conversations.\n-PROJECT BASED LEARNING 101\n-DESIGNING SCHOOLS FOR DEEPER LEARNING AND EQUITY \n-USING VIDEO TO INFORM PRACTICE AND GUIDE COLLEGIAL COACHING \n-IMPROVING THE QUALITY OF STUDENT WORK THROUGH CRITIQUE & REVISION\n-DEVELOPING AS A DEEPER LEARNING LEADER \n-UTILIZING PROTOCOLS TO STRUCTURE CONVERSATIONS ABOUT TEACHING AND LEARNING\n"},
{"Category": "Online Learning, STEM, Technology", "End Date": "", "Name": "iNACOL Webinars", "Graduate Credit": "", "URL": "http://www.inacol.org/events/", "Location": "Online", "Organization": "International Association for K-12 Online Learning (iNACOL)", "Start Date": "Numerous", "Emily: 👍": "", "Description": "All are invited to learn from education experts through webinar presentations. At no cost, you may view archived webinars or sign up to join upcoming presentations."},
{"Category": "Global Studies, Humanities, History", "End Date": "", "Name": "The National Consortium for Teaching About Asia", "Graduate Credit": "", "URL": "http://nctasia.org/programs/overview/", "Location": "Numerous", "Organization": "The National Consortium for Teaching about Asia", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Offers numerous online and face-to-face courses and workshops. \n\nNCTA offers educational programs in different delivery methods to accommodate the different needs, schedules and preferences of teachers. Whether in our online courses or more traditional classroom settings, participants interact with East Asia specialists, are introduced to extensive readings and other materials, and discuss effective strategies for bringing East Asia into their classrooms. "},
{"Category": "Humanities, Literature, Writing, Math, Science, STEM, Technology, Special Education", "End Date": "", "Name": "Lesley University's Online Degree and Certificate Programs", "Graduate Credit": "X", "URL": "http://www.lesley.edu/online-programs/graduate-education/", "Location": "Online", "Organization": "Lesley University", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Online Master of Education Programs:\n-Individually Designed Program for Educators  \n-Educational Technology\n-Language and Literacy\n-Mathematics Education\n-Science in Education\n-Curriculum and Instruction, Elementary Education -Generalist\n\nOnline Graduate Certificate Programs\n\n-Autism Spectrum Disorder: Allies and Advocates\n-Special Education  \n-Literacy for the Classroom Teacher (K-8)\n-Developing Systematic Language and Literacy Expertise K-8*\n-Teaching English to Speakers of Other Languages  \n-Mathematics Education\n-Science in Education \n-Emerging Technologies  \n-Navigating Our Digital World  \n-Online Teaching  \n\n"},
{"Category": "Science, Research", "End Date": "", "Name": "National Oceanic and Atmospheric Administration’s (NOAA) Teacher at Sea Program ", "Graduate Credit": "", "URL": "http://teacheratsea.noaa.gov/#/about/who_may_apply", "Location": "Numerous", "Organization": "The U.S. Federal Government", "Start Date": "Numerous", "Emily: 👍": "", "Description": "The mission of the National Oceanic and Atmospheric Administration’s (NOAA) Teacher at Sea Program is to provide teachers hands-on, real-world research experience working at sea with world-renowned NOAA scientists, thereby giving them unique insight into oceanic and atmospheric research crucial to the nation. The program provides a unique opportunity for kindergarten through college-level teachers to sail aboard NOAA research ships to work under the tutelage of scientists and crew. \n\nSince its inception in 1990, NOAA’s Teacher at Sea Program has enabled nearly 700 teachers to gain first-hand experience of science and life at sea. By participating in this program, teachers profoundly enrich their classroom curricula, enhance their approaches to teaching science, and engage their local community with knowledge that can only be gained by living and working side-by-side, day and night, with scientists who contribute to the world's oceanic and atmospheric scientific research."},
{"Category": "Language", "End Date": "", "Name": "Organic World Language", "Graduate Credit": "", "URL": "http://www.owlanguage.com/", "Location": "Numerous and Online", "Organization": "Organic World Language Institute", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Workshops, Online PD, School Visits, Bootcamps, and more! OWL offers fun, interactive, and informative workshops for any and all educators interested in student-centered, proficiency-based instruction. Join the transformative experience of a dynamic, high-energy workshop where concepts are applied through interactive, hands-on activities and collaborations. We strive to create a sustainable professional development partnership with you and your program to provide the best possible support as you continue your journey towards best practices. "},
{"Category": "Leadership, Pedagogy, School Design, Diversity/Equity/Inclusion, Humanities, Global Studies, Library, Literature, Writing, History, STEM, Technology, Science, Math, Student Life, Counseling", "End Date": "", "Name": "PreK–12 Professional Development at Harvard University", "Graduate Credit": "", "URL": "https://www.gse.harvard.edu/ppe/programs/prek12", "Location": "Cambridge, MA", "Organization": "Harvard University ", "Start Date": "Numerous", "Emily: 👍": "", "Description": "The Harvard Graduate School of Education's PreK–12 professional education programs are crafted for a broad cross section of stakeholders: superintendents, principals, directors, coordinators, teachers and those who shape or implement educational policy. The overarching focus of these programs is to increase an educator's capacity to improve learning outcomes for all children.\n\nThrough a variety of learning techniques–case studies, lectures and small group discussions–participants acquire new perspectives on leadership, deepen their repertoire of problem-solving skills, engage in personal reflection and build lasting professional networks. All of our institutes will not only let you recharge and connect with like-minded individuals who face issues similar to yours, they will show you how to apply what you learn directly to your work for years to come. Join our community of learners.\n\nSee website for info on specific workshops."},
{"Category": "Pedagogy, Leadership, School Design, STEM, Science", "End Date": "", "Name": "Systems Thinking in Schools", "Graduate Credit": "", "URL": "http://watersfoundation.org/professional-development-events/pd-offerings/", "Location": "Numerous", "Organization": "Waters Foundation", "Start Date": "Numerous", "Emily: 👍": "", "Description": "The Systems Thinking in Schools Project offers a variety of professional development (PD) opportunities including workshops, learning collaboratives, regional institutes, webinars, online learning modules and follow-up coaching and consulting.  Here are some of the benefits to participating in our PD sessions:\n\nTeachers learn from and alongside their peers.\nPD is directly related to standards-based curriculum.\nSessions include time for reflection and meaning making.\nParticipants are able to develop action plans relevant to their own work. \n\nOfferings include: \nSystems Thinking Level 1:  Developing Capacity for Thinking Learning and Leading\nSystems Thinking Level 2:  Embracing the Power of Visual Tools, Including Simulation Models\nLearning Through Play: Kinesthetic and Computer Models for Deeper Understanding \n\n"},
{"Category": "Science, Sustainability, Global Studies, Research", "End Date": "", "Name": "Teach Earth, United States", "Graduate Credit": "", "URL": "http://earthwatch.org/education/teacher-fellowships/teach-earth-united-states", "Location": "Numerous", "Organization": "Earthwatch", "Start Date": "Numerous", "Emily: 👍": "", "Description": "Teach Earth is built upon the principle that every individual can contribute to a sustainable planet, regardless of scientific background or skill. Each year, we select talented teachers from all subject areas to work side by side with world-class scientists on field research expeditions around the world. From the edge of the Arctic to the coast of Maine, these teachers collect data on climate change, ecology, wildlife, and more. Teachers have the opportunity to learn the scientific process first hand and help to solve some of the world’s most pressing environmental challenges. Teachers return to the classroom with new perspectives and knowledge, invigorated and inspired to share the experience of real discovery with their students.\n\nThe Teach Earth Experience:\n-Immerse yourself in a 7-14 day science learning and professional development experience in natural landscapes around the world\n-Support a critical conservation research project and help to solve key environmental challenges\n-Gain confidence, skills, and knowledge in scientific research and environmental issues through hands-on data collection and through lectures with world class scientists\n-Invigorate your teaching with new insights gained “in the field” and inspire your students in new ways\n-Collaborate with a team of teachers and share best practices, ideas, and the spirit of team-based scientific inquiry\n-Receive mentorship from an experienced Senior Fellow on transitioning your field experience to home\n-Ignite scientific discovery and environmental awareness within your classroom or community through a community action project or lesson plan\n"},
{"Category": "Humanities, History, Literature, Writing, Global Studies, Arts, Theater", "End Date": "", "Name": "National Endowment for the Humanities: Summer Programs in the Humanities for School and College Educators", "Graduate Credit": "", "URL": "https://www.neh.gov/divisions/education/summer-programs", "Location": "Numerous", "Organization": "National Endowment for the Humanities", "Start Date": "Summer (numerous)", "Emily: 👍": "X", "Description": "Each year, NEH offers tuition-free opportunities for school, college, and university educators to study a variety of humanities topics. Stipends of $600-$3,300 help cover expenses for these one- to four-week programs. Applications are due at the begining of March.\n\nThere are so many options all over the country. \n\nFor example, a handful of the 2017 summer options are below.\n\nSeminar options included: \n-Existentialism, Mount Holyoke College, South Hadley, MA, July 16-August 4 (3 weeks)  \n-Punishment, Politics and Culture, Amherst College, Amherst, MA, July 3- 28, 2017 (4 weeks) \n-What Did Independence Mean For Women, 1776-1876?, Penn State University, Pittsburg, PA, July 2-21 (3 weeks) \n\nSummer Institutes options included: \n-Foreign Exchanges: The U.S. and the Wider World in the Twentieth Century, Watertown, MA, July 2-21 (3 weeks) \n-From Harlem to Hip-hop: African-American History, Literature, and Song, Fairfield University, Fairfield, CT, June 24 - July 14 (3 weeks) \n-The Immigrant Experience in California through Literature & Theatre, San Jose State University, San Jose, CA, June 25 - July 9 (2 weeks) \n\nLandmarks of American History and Culture Workshop options included: \n-African Americans in the Making of Early New England, Deerfield, MA\n-America's Industrial Revolution at The Henry Ford, Deerborn, MI\n-Emily Dickinson: Person, Poetry, and Place, Amherst, MA\n-Jump at the Sun: Zora Neale Hurston and Her Eatonville Roots, Eatonville, FL\n\nFor a full list of offerings, more information, and application instructions, please visit the website."},
{"Category": "Pedagogy, School Design, Leadership, Humanities", "End Date": "", "Name": "WMWP Summer Leadership Institute", "Graduate Credit": "", "URL": "https://www.umass.edu/wmwp/wmwp-summer-leadership-institute", "Location": "Amherst, MA", "Organization": "Western Massachusetts Writing Project", "Start Date": "Summer 2018", "Emily: 👍": "", "Description": "WMWP's annual Summer Leadership Institute brings together outstanding teachers who work with students in all academic content areas and at all grade levels, pre‑K through college. Supported by the WMWP facilitators and each other, these teachers spend three weeks immersed in writing, reading, and reflective inquiry.\n\nDuring the following school year, they conduct action-research projects in their own classrooms and come together for three reunion meetings. At the end of this process, they become WMWP Teacher-Consultants. In this capacity they may provide professional development to schools for WMWP; present their research in local, regional, and national venues; and contribute to the ongoing growth of WMWP.\n\nIn this way, the Summer Leadership Institute represents the first leg in what thousands of National Writing Project teachers around the country have described as a career-transforming journey.\n\nAs participants, teachers engage in their own writing in order to explore ways to use writing more meaningfully in their classrooms. They participate in a collaborative inquiry community: reading current theory and research, engaging in classroom-based action research, and presenting a professional workshop. Inquiry focuses on the following themes:\n\nCLASSROOM INQUIRY: How can reflecting on my teaching help me ask meaningful questions to improve my practice?\n\nREFLECTION AND IMPLEMENTATION: How do I incorporate change into my practice? How can attention to difference in my classroom inform my pedagogy and/or curriculum?\n\nLANGUAGE AND POWER: How can language be used in a classroom to empower or disempower students? How can a student's native language be valued in my classroom?\n\nLITERACY AND LEARNING: How can I help students become more confident and effective writers and readers? What writing-to-learn and critical reading strategies can I use to help students develop content knowledge and understanding?"},
{"Category": "Humanities, History, Research", "End Date": "", "Name": "Summer Workshops for Educators on Using Historical Documents in the Classroom", "Graduate Credit": "X", "URL": "https://www.archives.gov/education/primarily-teaching", "Location": "Numerous", "Organization": "National Archives", "Start Date": "Summer 2018", "Emily: 👍": "X", "Description": "Join us to conduct research with original documents in the holdings of the National Archives and Presidential Libraries. Discover some of those incredible teachable documents that help educators and students unlock the past.\n\nAll workshops will have a national theme matching that of National History Day (NHD)  in 2019. (Participation in NHD is not required.) You will explore a specific topic that fits within the broader theme, researching primary sources like letters, reports, petitions, case files, photographs, and more.\n\nYou will identify between 3 and 5 items (documents, photos, maps, etc.) to digitize and make available online. We will add these to our online tool for teaching with documents— DocsTeach.org—while you're onsite. During the workshop, you'll produce a DocsTeach learning activity using these digitized primary sources.\nIf you will research an additional topic, it should fit within the broader Triumph & Tragedy in History theme. We will try to help you identify material in our collection that matches your topic. "},
{"Category": "Humanities, Literature, Writing, Arts, Theater", "End Date": "", "Name": "Middlebury Breadloaf School of English", "Graduate Credit": "X", "URL": "http://www.middlebury.edu/blse", "Location": "Ripton, VT; Santa Fe, NM; Oxford, United Kingdom", "Organization": "Middlebury College", "Start Date": "Summer 2018", "Emily: 👍": "", "Description": "A summer graduate school that brings together more than 425 students at our three campuses each summer. \n\nThe Bread Loaf experience, especially for those pursuing a master's degree over four or five summers, is deep, rich, and transformative. Our students participate in an academic program that offers a huge array of courses about literature and language, taught by our world-class faculty. \n\nBread Loaf's summer schedule makes it ideally suited for teachers. A majority of our students are middle and high school teachers who take classes that deepen and expand their knowledge of the subjects they teach. \n\nStudents may attend Bread Loaf for one or more summers and take courses in continuing graduate education, or they may enroll in full degree programs, leading to the Master of Arts and Master of Letters degrees in English.\n\nFor information on the theater program at Bread Loaf, go to: http://www.middlebury.edu/blse/theater"},
{"Category": "Language", "End Date": "", "Name": "CARLA Summer Institutes", "Graduate Credit": "X", "URL": "http://carla.umn.edu/institutes/index.html", "Location": "Minneapolis, MN", "Organization": "Center for Advanced Research on Language Acquisition (CARLA) at the University of Minnesota", "Start Date": "Summer 2018 (numerous)", "Emily: 👍": "", "Description": "The Center for Advanced Research on Language Acquisition (CARLA) at the University of Minnesota has provided high-quality professional development for language teachers for over 20 years. Launched in 1996, this internationally known program reflects CARLA's commitment to link research and theory with practical applications for the classroom. Each institute is highly interactive and includes discussion, theory-building, hands-on activities, and plenty of networking opportunities. \n\nThe reach of the CARLA summer institute program is wide—it has served language teachers from every state plus Washington D.C., Puerto Rico and the Virgin Islands. In total, CARLA summer institute participants reported teaching 53 languages from Arabic to Yoruba. In addition, CARLA summer institute participants have come from 51 countries. The top ten countries represented at the program to date have been: Japan, Canada, So. Korea, Spain, Taiwan, Brazil, China, France and Saudi Arabia.\n\nWhile Spanish teachers have accounted for 46% of the program’s participants, over 25% of program participants have been teachers of 49 different less commonly taught languages (LCTL).\n\n"},
{"Category": "History, Humanities", "End Date": "", "Name": "The Gilder Lehrman Institute of American History Summer Institutes", "Graduate Credit": "", "URL": "https://www.gilderlehrman.org/content/teacher-seminars", "Location": "Numerous", "Organization": "The Gilder Lehrman Institute of American History", "Start Date": "Summer 2018 (numerous)", "Emily: 👍": "", "Description": "Each summer, the Gilder Lehrman Institute offers academically rigorous Teacher Seminars for K–12 educators. These highly competitive one-week seminars are open exclusively to participants in the Institute’s free Affiliate School Program. \n\nTo see a full list of 2017 offerings, visit the website. There are more than two dozen seminars.\n\nExamples include:\n-The Life and Writings of Frederick Douglass\n-9-11 and American Memory\n-American Protest Literature: Thomas Paine to the Present\n-The Era of Theodore Roosevelt\n-Immigrants in American History\n-Foreign and Domestic Politics since the 1970s\n-Westward Expansion\n-Empire City: New York from 1877 to 2001"},
{"Category": "Diversity/Equity/Inclusion, Gender Studies", "End Date": "", "Name": "Multicultural Leadership Institute 2019", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#MLT16", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Summer 2019", "Emily: 👍": "", "Description": "Interested in creating and sustaining a multicultural school?\nThis five-day institute is designed for educators to create and sustain authentically multicultural schools through reflection, understanding, planning, and implementation.\n\nOur Multicultural Leadership Institute provides responsive professional development by leveraging current research and practice, along with Wildwood School's institutional experiences. The setting is intimate and intentionally small, limited to 40 participants.\n\nThe Institute supports individuals and cohorts committed to developing a shared vision of institutional and cultural change within their schools. Participants will consider, generate, and refine strategies to foster authentically inclusive and equitable practices.\n\nThe Institute features:\n\n-Expert guest presenters and facilitators\n-Dynamic protocols and learning experiences\n-Overview of Wildwood School's multicultural program\n-Personal and school focused application\n-A multicultural framework for personal and school focused application\n-Introduction to stages of white racial identity development and white anti-racist practices\n-Multicultural leadership team development"},
{"Category": "Leadership, Pedagogy, School Design", "End Date": "", "Name": "Systems Thinking Collaborative: Summer Intensive Workshop", "Graduate Credit": "", "URL": "https://www.wildwood.org/page.cfm?p=1627#Systems", "Location": "Los Angeles, CA", "Organization": "Wildwood School", "Start Date": "Summer 2019", "Emily: 👍": "", "Description": "Ready for the next iteration of deep learning?\n\nThis exceptional four-day workshop supports elementary teachers and administrators interested in integrating Systems Thinking into daily practice.\n\nSystems thinking stems from the premise that students deepen their thinking and expand their knowledge when they're encouraged to make connections between their learning and the natural and human-made systems around them.\n\nWhen students see their learning through a systems thinking lens, they understand that actions taken in one area affect other areas—whether in their classrooms, their communities, or their world.\n\nSystems thinking fosters a learning environment where students explore ethical, environmental, and global issues holistically encouraging both increased personal responsibility and social action. It also enlivens and invigorates teachers' planning and practice.\n\nA public/private learning partnership\n\nYour hosts and facilitators are teachers and administrators from Wildwood School (private) and Palms Elementary School (public)—the founding members of the Systems Thinking Collaborative, a growing community of public and private schools committed to student and school success everywhere through Systems Thinking. \n\nWildwood and Palms teachers have worked and learned together over the past 3 years, incubating Systems Thinking in their schools and classrooms. This unique work and its benefits for students and teachers have been documented by researchers at universities in California and Tennessee."},
{"Category": "History, Humanities", "End Date": "Summer 2019", "Name": "Supreme Court Summer Institute for Teachers", "Graduate Credit": "", "URL": "https://www.streetlaw.org/programs/scsi", "Location": "Washington, DC", "Organization": "Supreme Court Historical Society & Street Law", "Start Date": "Summer 2019", "Emily: 👍": "X", "Description": "The Institute includes sessions led by Supreme Court experts, journalists, authors, and lawyers, who give teachers an in-depth understanding of how the Court chooses and decides cases, and what it is like to argue before the Court. The Institute covers six current or recent cases, and teachers even learn about the personalities of the justices. This exciting opportunity culminates with a visit to the Court to hear decisions handed down and a reception at the Court.\n\nThe Institute prepares teachers to use innovative methods to teach about both current and historical cases. Beyond the content-rich sessions and activities, teachers are also equipped with the skills and tools to train fellow teachers at home.\n\nSince it began in 1995, the Supreme Court Summer Institute for Teachers has brought together over 1,200 teachers from across the country to convene in Washington, D.C., for six days of educational activities related to teaching about the U.S. Supreme Court. \n\n"},
{"Category": "Humanities, History, Global Studies, Journalism, Literature, Writing", "End Date": "Summer 2019", "Name": "C-SPAN's Teacher Fellowship Program", "Graduate Credit": "", "URL": "https://www.c-span.org/classroom/opportunities/", "Location": "Washington, DC", "Organization": "C-SPAN", "Start Date": "Summer 2019", "Emily: 👍": "X", "Description": "C-SPAN’s Fellowship program is for educators who have experience using C-SPAN’s programming in the classroom and can demonstrate innovative methods of integrating those programs into educational experiences.\n\nFor four weeks during summer, Fellowship recipients will collaborate with C-SPAN’s Education department to develop new teaching materials using C-SPAN resources in order to better serve our Classroom members nationwide. The Fellowship takes place at C-SPAN’s offices in Washington, DC. Each Fellow receives a stipend of $7,000 to cover housing, travel, and living expenses. Fellows will also participate in C-SPAN’s Summer Educators’ Conferences where they share their ideas and experiences using C-SPAN’s programs with conference attendees."},
{"Category": "Counseling", "End Date": "", "Name": "Association of College Counselors in Independent Schools Summer Institute", "Graduate Credit": "", "URL": "http://www.accisnet.org/programs", "Location": "TBD", "Organization": "Association of College Counselors in Independent Schools", "Start Date": "TBD", "Emily: 👍": "", "Description": "Since the first summer gathering of 75 ACCIS members at Kenyon College in the summer of 2008, the Summer Institute has become a “must-do” professional development event for independent school college counselors.  Approximately 300 ACCIS members gather for three days in June for informative and thought-provoking presentations led by fellow members, and roundtable discussions highlighting best practices, innovations and fundamental challenges in our profession. Prominent national thinkers, writers, and educators set the tone through keynote presentations and open dialogue with attendees. Opportunities to tour nearby colleges as well as the host campus, plus informal networking and social opportunities, make the Summer Institute a comprehensive, reinvigorating and influential experience. \n\nThe Summer Institute is usually held in mid- to late June starting on a Sunday evening and concluding by Wednesday morning."},
{"Category": "Counseling", "End Date": "TBD", "Name": "New England Association for College Admission Counseling Summer Institute", "Graduate Credit": "", "URL": "https://neacac.memberclicks.net/summer-institute", "Location": "TBD", "Organization": "New England Association for College Admission Counseling", "Start Date": "TBD", "Emily: 👍": "", "Description": "Summer Institute is designed for secondary school counselors and college admission counselors with two or fewer years of experience. The integrated program fosters a deeper understanding of the interaction between secondary school counselors and admission counselors, as well as expert insight into the current trends and issues within the profession. Participants will benefit from the opportunity to connect and interact with experienced faculty members from high schools and colleges from throughout New England. Through small mentor group discussions,program specific curriculum tracks for secondary school counselors and admissions counselors, and workshops and group presentations, participants will learn about job responsibilities, communication in the admission/counseling process, recruitment/travel, ethical issues in admissions, financial aid, standardized testing, and advancing through the profession, to name a few. Networking, through both formal and informal gatherings, is another critical component of the Summer Institute experience."},
{"Category": "Leadership, Pedagogy, School Design", "End Date": "", "Name": "Critical Friends Group® (CFG®) New Coaches Training", "Graduate Credit": "", "URL": "http://www.wildwood.org/page.cfm?p=1627#CFG", "Location": "Your School", "Organization": "Wildwood School", "Start Date": "Your choice", "Emily: 👍": "X", "Description": "Ready to develop peer-to-peer coaching at your school?\n\nThis five-day workshop provides educators with research-based tools for developing a collaborative culture that fosters professional learning communities and improves student achievement. Beginning Coaches Training offers an opportunity to learn the fundamentals of CFG coaching by experiencing them firsthand. Participants also meet and work with like-minded professionals engaged in similar work across the country.\n\nBy the end of the workshop, participants will:\n\nBe CFG coaches certified by The National School Reform Faculty"},
];